[
  {
    "week": 1,
    "theme": "People",
    "topic": "A Family Member You Are Proud Of",
    "l1_part2_model_input": "Describe a family member who you are proud of. You should say:\nWho this person is\nWhen this happened\nWhat this person did\nAnd explain why you felt proud.",
    "l1_part2_student_q2": "Describe a family member who has achieved something great. You should say:\nWho the person is\nWhat the achievement was\nHow they achieved it\nAnd explain how their achievement influenced you.",
    "l1_part2_student_q3": "Describe a family member you admire for their personality. You should say:\nWho this person is\nWhat kind of personality they have\nHow they treat others\nAnd explain why you admire their character.",
    "l2_part3_questions": [
      "What would children do to make their parents proud?",
      "What did you do to make your parents proud when you were young?",
      "What advantages of yours make you proud?",
      "When was the last time that you felt proud of yourself?",
      "How does family pride contribute to the stability of a society?",
      "Do you think the definition of \"success\" within families has changed between the past and the present?"
    ]
  },
  {
    "week": 2,
    "theme": "Places",
    "topic": "Working Abroad / Foreign Country",
    "l1_part2_model_input": "Describe a foreign country where you'd like to work for a short time. You should say:\nWhere you would like to go\nWhat kind of work you want to do\nWhen you would like to go\nAnd explain why you want to work in that place.",
    "l1_part2_student_q2": "Describe a city you would like to live in for work purposes. You should say:\nWhich city it is\nWhat industry is popular there\nHow you know about this place\nAnd explain why this place is good for your career.",
    "l1_part2_student_q3": "Describe a place you visited that you think would be a good place to work. You should say:\nWhere the place is\nWhen you visited it\nWhat the lifestyle is like there\nAnd explain why you think working there would be enjoyable.",
    "l2_part3_questions": [
      "What kind of job is easy to get in a foreign country?",
      "Should young people work abroad?",
      "Do Chinese parents encourage their children to work abroad?",
      "Why do some people not want to work overseas?",
      "What are the benefits of working abroad?",
      "How does the migration of skilled workers (brain drain) affect the economy of the country they leave?"
    ]
  },
  {
    "week": 3,
    "theme": "Items (Abstract)",
    "topic": "Your Perfect Job",
    "l1_part2_model_input": "Describe your perfect job. You should say:\nWhat it is\nWhere you heard about it\nWhat you need to learn to get the job\nAnd explain why you think it is your perfect job.",
    "l1_part2_student_q2": "Describe a job you would like to have in the future. You should say:\nWhat the job is\nWhat qualifications are required\nWhether it is a popular job\nAnd explain why this job appeals to you.",
    "l1_part2_student_q3": "Describe a well-paid job that you would be good at. You should say:\nWhat the job is\nWhat skills you have that match this job\nHow you would find this job\nAnd explain why you think you would succeed in this role.",
    "l2_part3_questions": [
      "What jobs do children want to do when they grow up?",
      "What should people consider when choosing jobs?",
      "Is salary the main reason people choose a certain job?",
      "What kind of jobs are well-paid?",
      "Do people's ideal jobs change as they grow up?",
      "To what extent does technology (such as AI) threaten traditional job roles in modern society?"
    ]
  },
  {
    "week": 4,
    "theme": "Events",
    "topic": "A Disappointed Movie",
    "l1_part2_model_input": "Describe a movie you watched recently that you felt disappointed about. You should say:\nWhat it was\nWhy you decided to watch it\nWhen you watched it\nAnd explain why you felt disappointed about it.",
    "l1_part2_student_q2": "Describe a film that did not meet your expectations. You should say:\nWhat the film was called\nWhat you expected to see\nWhat actually happened in the film\nAnd explain why it failed to meet your expectations.",
    "l1_part2_student_q3": "Describe a time you regretted watching a specific movie or show. You should say:\nWhere you watched it\nWho you watched it with\nWhy you chose it\nAnd explain what made the experience negative.",
    "l2_part3_questions": [
      "Do you believe movie reviews?",
      "What are the different types of films in your country?",
      "Are historical films popular in your country? Why?",
      "Do you think films with famous actors or actresses are more likely to become successful?",
      "Why are Japanese animated films so popular?",
      "Should directors pay a lot of money to famous actors?"
    ]
  },
  {
    "week": 5,
    "theme": "People",
    "topic": "Protecting Nature",
    "l1_part2_model_input": "Describe a person who encouraged you to protect nature. You should say:\nWho this person is\nHow you knew this person\nWhat he/she said or did to encourage you\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe a person who is very interested in the environment. You should say:\nWho they are\nWhat they do to help the environment\nHow they influence others\nAnd explain what you have learned from them.",
    "l1_part2_student_q3": "Describe an environmental activist or leader you admire. You should say:\nWho this person is\nWhat cause they fight for\nHow they spread their message\nAnd explain why you respect their efforts.",
    "l2_part3_questions": [
      "How do people protect the environment?",
      "Do you think it's important to protect wild animals/nature?",
      "What are the main environmental problems in your country?",
      "Do you think we should use more renewable energy? Why?",
      "Should schools teach students about environmental protection?",
      "[New] How effective is international cooperation in solving global environmental crises?"
    ]
  },
  {
    "week": 6,
    "theme": "Places",
    "topic": "A Place with Trees / Nature",
    "l1_part2_model_input": "Describe a place with a lot of trees that you would like to visit (e.g., a forest, oasis). You should say:\nWhere it is\nHow you knew this place\nWhat it is like\nAnd explain why you would like to visit it.",
    "l1_part2_student_q2": "Describe a park or garden in your city that you enjoy visiting. You should say:\nWhere it is located\nHow often you go there\nWhat you do there\nAnd explain why you find this place relaxing.",
    "l1_part2_student_q3": "Describe a natural environment (such as a forest or mountain) that impressed you. You should say:\nWhere this place is\nWhen you went there\nWho you went with\nAnd explain why this place was memorable.",
    "l2_part3_questions": [
      "Why do people like visiting places with trees or forests?",
      "Are natural views better than city views?",
      "Do all people need some nature?",
      "Are people hard-wired to protect the environment?",
      "How does rapid urbanization impact the mental health of city dwellers?",
      "Should governments prioritize economic development over the preservation of natural green spaces?"
    ]
  },
  {
    "week": 7,
    "theme": "Items",
    "topic": "A Mobile App",
    "l1_part2_model_input": "Describe an application (app) you usually use on your phone or computer. You should say:\nWhat it is\nWhen you use it\nWhy you use it often\nAnd explain how you feel about it.",
    "l1_part2_student_q2": "Describe a mobile app that has made your daily life easier. You should say:\nWhat the app is\nHow it functions\nWhat specific problem it solves for you\nAnd explain why you would recommend it to others.",
    "l1_part2_student_q3": "Describe an app you use for learning or self-improvement. You should say:\nWhat the app teaches\nHow often you use it\nHow effective it is\nAnd explain why you prefer using an app over traditional methods.",
    "l2_part3_questions": [
      "What is the difference between how young and old people use apps?",
      "Why do some people dislike using apps?",
      "What is the most popular app in your country?",
      "Are people becoming too dependent on mobile apps?",
      "To what extent do mobile applications compromise user privacy and data security?",
      "Will digital tools eventually replace traditional face-to-face services entirely?"
    ]
  },
  {
    "week": 8,
    "theme": "Events",
    "topic": "Giving Advice",
    "l1_part2_model_input": "Describe a time when you gave advice to others. You should say:\nWhen it was\nTo whom you gave the advice\nWhat the advice was\nAnd explain why you gave the advice.",
    "l1_part2_student_q2": "Describe a time you received useful advice from someone. You should say:\nWho gave you the advice\nWhat the situation was\nHow you applied the advice\nAnd explain how this advice helped you.",
    "l1_part2_student_q3": "Describe a situation where you had to make a difficult decision. You should say:\nWhat the decision was\nWho you consulted for help\nWhat the outcome was\nAnd explain how you felt after making the decision.",
    "l2_part3_questions": [
      "Should people prepare before giving advice?",
      "Is it good to ask for advice from strangers online?",
      "What are the personalities of people whose job is to give advice to others?",
      "What are the problems if you ask too many people for advice?",
      "Is the advice given by older generations still relevant to the problems young people face today?",
      "To what extent does professional counseling differ from advice given by friends or family?"
    ]
  },
  {
    "week": 9,
    "theme": "People",
    "topic": "A Child Who Enjoys Art",
    "l1_part2_model_input": "Describe a child who enjoys drawing/painting. You should say:\nHow you know this child\nHow often he/she draws\nWhat he/she likes to draw or paint\nAnd explain why you think he/she likes drawing/painting.",
    "l1_part2_student_q2": "Describe a creative child you know. You should say:\nWho the child is\nWhat creative activity they do (e.g., crafts, building)\nHow they show their creativity\nAnd explain why you think creativity is important for their development.",
    "l1_part2_student_q3": "Describe a young person who has a natural talent. You should say:\nWho they are\nWhat their talent is (music, art, sports, etc.)\nHow you discovered their talent\nAnd explain what you think the future holds for them.",
    "l2_part3_questions": [
      "Why do people choose to visit galleries and museums in person instead of viewing art online?",
      "Should galleries and museums be free of charge to the public?",
      "Why do some people find life inspiration from visiting these places?",
      "Why do most children draw more often than adults do?",
      "Is art education in schools as important as science or mathematics?",
      "How does engaging in artistic activities contribute to the cognitive development of a society?"
    ]
  },
  {
    "week": 10,
    "theme": "Places",
    "topic": "An Interesting Building",
    "l1_part2_model_input": "Describe an interesting building you'd like to visit. You should say:\nWhere it is\nHow you knew about it\nWhat you know about it\nAnd explain how you will feel if you go there.",
    "l1_part2_student_q2": "Describe a historical building in your country. You should say:\nWhere it is located\nWhen it was built\nWhat it is used for today\nAnd explain why it is important to your country's heritage.",
    "l1_part2_student_q3": "Describe a modern building that impressed you. You should say:\nWhere it is\nWhat it looks like\nWhat function it serves\nAnd explain why you admire its architecture.",
    "l2_part3_questions": [
      "Should all museums and historical buildings sell tickets?",
      "Which kind of building do people prefer, villas or apartments?",
      "Why do people prefer to live in new houses?",
      "Which do people prefer, modern buildings or traditional buildings?",
      "How does the architecture of a city influence the cultural identity of its residents?",
      "Is it necessary to preserve old buildings even if they impede modern urban development?"
    ]
  },
  {
    "week": 11,
    "theme": "Items",
    "topic": "Desired Technology",
    "l1_part2_model_input": "Describe a technology product you would like to own. You should say:\nWhat it is\nHow much it costs\nWhat you will use it for\nAnd explain why you would like to own it.",
    "l1_part2_student_q2": "Describe a piece of modern technology that saves you time. You should say:\nWhat the device is\nHow often you use it\nHow it works\nAnd explain why it is efficient.",
    "l1_part2_student_q3": "Describe an invention that has changed the world significantly. You should say:\nWhat the invention is\nWhen it was created\nHow it affects our daily lives\nAnd explain whether you think the change is positive or negative.",
    "l2_part3_questions": [
      "What tech products are your friends using these days?",
      "Why do people love using tech products?",
      "What are the differences between chatting online and chatting face-to-face?",
      "Has technology widened the economic gap between the rich and the poor?",
      "Do you think people are losing their ability to communicate effectively due to screens?",
      "To what extent should governments regulate the development of Artificial Intelligence?"
    ]
  },
  {
    "week": 12,
    "theme": "Events",
    "topic": "Losing Your Way",
    "l1_part2_model_input": "Describe an occasion when you lost your way. You should say:\nWhere you were\nWhat happened\nHow you felt\nAnd explain how you found your way.",
    "l1_part2_student_q2": "Describe a time you arrived late for an important event. You should say:\nWhat the event was\nWhy you were late\nWhat the consequences were\nAnd explain how you felt about the situation.",
    "l1_part2_student_q3": "Describe a time you helped someone who was lost. You should say:\nWhere this happened\nWho the person was\nHow you helped them\nAnd explain how you felt after helping them.",
    "l2_part3_questions": [
      "Why do some people get lost more easily than others?",
      "Do you think it is important to do some preparation before you travel to new places?",
      "How can people find their way when they are lost?",
      "Is a paper map still necessary?",
      "Has the reliance on GPS technology reduced our natural ability to navigate?",
      "How does getting \"lost\" (metaphorically) in a new culture help a person grow?"
    ]
  },
  {
    "week": 13,
    "theme": "People",
    "topic": "A Famous Person",
    "l1_part2_model_input": "Describe a famous person you would like to meet. You should say:\nWho he/she is\nHow you know about him/her\nHow/where you would like to meet him/her\nAnd explain why you would like to meet him/her.",
    "l1_part2_student_q2": "Describe a famous sportsperson you admire. You should say:\nWho this person is\nWhat sport they play\nWhat achievements they have made\nAnd explain why you admire them more than other athletes.",
    "l1_part2_student_q3": "Describe a famous person from your country who is known internationally. You should say:\nWho they are\nWhat they are famous for (e.g., politics, arts, science)\nHow they represent your country\nAnd explain if you are proud of them.",
    "l2_part3_questions": [
      "What are the advantages and disadvantages of being a famous child?",
      "What can today's children do to become famous?",
      "Do people become famous because of their talent?",
      "Should students have physical education and do sports at school?",
      "To what extent do celebrities sacrifice their privacy for their career?",
      "Do famous people have a moral responsibility to be good role models for society?"
    ]
  },
  {
    "week": 14,
    "theme": "Places",
    "topic": "Shopping Mall",
    "l1_part2_model_input": "Describe a shopping mall you often visit. You should say:\nWhere it is\nWho you usually go with\nWhat you do there\nAnd explain why you like going to this mall so often.",
    "l1_part2_student_q2": "Describe a traditional street market you enjoy visiting. You should say:\nWhere it is located\nWhat kinds of things they sell\nHow the atmosphere differs from a mall\nAnd explain why you like shopping there.",
    "l1_part2_student_q3": "Describe a shop that you recently recommended to a friend. You should say:\nWhat the shop sells\nWhere it is\nWhy you recommended it\nAnd explain what makes this shop special.",
    "l2_part3_questions": [
      "Some people believe building shopping malls isn't a good thing, what do you think?",
      "Why do people enjoy going to malls?",
      "How did people pay in the past, and how do they pay now?",
      "What are the downsides of mobile payments?",
      "Has the rise of e-commerce (online shopping) caused the death of local small businesses?",
      "Is consumerism (the desire to buy more things) beneficial or harmful to society?"
    ]
  },
  {
    "week": 15,
    "theme": "Items",
    "topic": "Books and Stories",
    "l1_part2_model_input": "Describe a book you read that you found useful. You should say:\nWhat it is\nWhen you read it\nWhy you think it is useful\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe a story you read or heard recently. You should say:\nWhat the story was about\nWhere you read or heard it\nWho the main characters were\nAnd explain why this story stayed in your memory.",
    "l1_part2_student_q3": "Describe a traditional story from your country. You should say:\nWhat the story is\nWhen you first heard it\nWhat moral lesson it teaches\nAnd explain why it is still popular today.",
    "l2_part3_questions": [
      "What should the government do to make libraries better?",
      "Which one is better, paper books or e-books?",
      "Why should children listen to bedtime stories?",
      "Do Chinese children prefer ancient stories or fairy tales?",
      "Has the internet reduced the attention span required to read long novels?",
      "Is storytelling an essential part of preserving a culture's history?"
    ]
  },
  {
    "week": 16,
    "theme": "Events",
    "topic": "Laughter & Emotions",
    "l1_part2_model_input": "Describe an occasion when many people laughed together. You should say:\nWhen it happened\nWhere it happened\nWho you were with\nAnd explain why many people were laughing (or smiling) together.",
    "l1_part2_student_q2": "Describe a time you saw someone show their feelings very openly. You should say:\nWho this person was\nWhat happened to make them emotional\nHow they expressed their feelings (laughing, crying, etc.)\nAnd explain how you felt witnessing this.",
    "l1_part2_student_q3": "Describe a comedy movie or live performance that made you laugh. You should say:\nWhat it was\nWho the actors were\nWhat the funniest part was\nAnd explain why it was memorable.",
    "l2_part3_questions": [
      "Why do people laugh in their daily lives?",
      "Why do people smile when they take photos? Is it a genuine smile or a fake one?",
      "Should we express our emotions immediately or hide them?",
      "Regarding showing emotions, are there any differences between women and men?",
      "Is humor an essential tool for effective leadership in the workplace?",
      "How does cultural background influence what people find funny?"
    ]
  },
  {
    "week": 17,
    "theme": "People",
    "topic": "Friendship",
    "l1_part2_model_input": "Describe a friend you have known for a long time. You should say:\nWhere you met this friend\nWhen you met this friend\nWhat he/she is like\nAnd explain why you have remained friends for so long.",
    "l1_part2_student_q2": "Describe a friend who has played an important role in your life. You should say:\nWho they are\nHow they helped or influenced you\nWhat you admire about them\nAnd explain why they are important to you.",
    "l1_part2_student_q3": "Describe a friend who is talented at music or singing. You should say:\nWho they are\nWhat instrument they play or how they sing\nWhen you listen to them\nAnd explain how you feel when you hear them perform.",
    "l2_part3_questions": [
      "What is the difference between friendships at work and those outside of work?",
      "At what age do you think people start to have friendships?",
      "Do you think music is beneficial for children at school?",
      "Do you think a child's relationship with friends can be replaced by that with parents?",
      "Has social media changed the definition of \"friendship\" in modern society?",
      "Is it possible to maintain a lifelong friendship despite living in different countries?"
    ]
  },
  {
    "week": 18,
    "theme": "Places",
    "topic": "Housing & Accommodation",
    "l1_part2_model_input": "Describe your favorite place in your house where you can relax. You should say:\nWhere it is\nWhat it is like\nWhat you enjoy doing there\nAnd explain why you feel relaxed at this place.",
    "l1_part2_student_q2": "Describe a house or apartment you would like to live in. You should say:\nWhere it would be located\nHow big it would be\nHow you would decorate it\nAnd explain why this is your dream home.",
    "l1_part2_student_q3": "Describe a home you visited that you liked. You should say:\nWhose home it was\nWhere it was located\nWhat the decoration was like\nAnd explain what made it impressive.",
    "l2_part3_questions": [
      "Why is it difficult for some people to relax?",
      "Which is more important, mental relaxation or physical relaxation?",
      "Why do people prefer to live in new houses?",
      "How has the \"Work From Home\" trend changed the way people design their houses?",
      "What are the social consequences of housing shortages in major cities?",
      "Should the government regulate housing prices to ensure everyone has a place to live?"
    ]
  },
  {
    "week": 19,
    "theme": "Items",
    "topic": "Important Objects",
    "l1_part2_model_input": "Describe something that you can't live without (not a computer/phone). You should say:\nWhat it is\nWhat you do with it\nHow it helps you in your life\nAnd explain why you can't live without it.",
    "l1_part2_student_q2": "Describe an old object that your family has kept for a long time. You should say:\nWhat the object is\nHow long your family has had it\nWho it belonged to originally\nAnd explain why it is important to your family history.",
    "l1_part2_student_q3": "Describe a gift you received that you treasure. You should say:\nWhat the gift is\nWho gave it to you\nOn what occasion you received it\nAnd explain why it is special to you.",
    "l2_part3_questions": [
      "Why do some grown-ups hate to throw out old things?",
      "What do you think influences people to buy new things?",
      "Do young people appreciate antiques and old things as much as older people?",
      "Why do people like to go to museums to see old objects?",
      "Is the culture of consumerism (buying things for pleasure) sustainable for the planet?",
      "Does the \"planned obsolescence\" of products (products designed to break) harm society?"
    ]
  },
  {
    "week": 20,
    "theme": "Events",
    "topic": "Journeys & Travel",
    "l1_part2_model_input": "Describe a long journey you want to enjoy again. You should say:\nWhen you took the journey\nWhere you went\nWho you were with\nAnd explain why you want to go again.",
    "l1_part2_student_q2": "Describe a bicycle, motorcycle, or car trip you would like to go on. You should say:\nWho you would like to go with\nWhere you would like to go\nWhich vehicle you would choose\nAnd explain why you would like to travel this way.",
    "l1_part2_student_q3": "Describe a time your travel plans were delayed or changed. You should say:\nWhere you were going\nWhat caused the delay\nWhat you did while waiting\nAnd explain how you felt about the change in plans.",
    "l2_part3_questions": [
      "Who prefers long journeys, young people or old people?",
      "What do people prepare before a journey?",
      "Why do people prefer traveling in their own countries rather than foreign countries?",
      "Do you think air pollution comes mostly from mobile vehicles?",
      "Do you think people need to change the way of transportation drastically to protect the environment?",
      "Has the ability to travel cheaply (budget airlines) changed how people view the world?"
    ]
  },
  {
    "week": 21,
    "theme": "People",
    "topic": "Talent & Intelligence",
    "l1_part2_model_input": "Describe a creative person whose work you admire (e.g., artist or musician). You should say:\nWho this person is\nHow you knew him/her\nWhat creative work he/she does\nAnd explain why you admire him/her.",
    "l1_part2_student_q2": "Describe a person who has a natural talent (e.g., for sports, music, or math). You should say:\nWho the person is\nWhat talent they possess\nWhen you discovered this talent\nAnd explain whether you think they use this talent well.",
    "l1_part2_student_q3": "Describe a person who solved a problem in a clever way. You should say:\nWho the person is\nWhat the problem was\nHow they solved it\nAnd explain why you think their solution was intelligent.",
    "l2_part3_questions": [
      "How can we know if a child has talent or not?",
      "Is it a waste of time if people don't use their talents?",
      "Are children born smart, or do they become smart through learning?",
      "Is being intelligent always a good thing? Are there limitations?",
      "Do you think the education system stifles creativity by focusing too much on academic scores?",
      "Can creativity be learned, or is it an innate quality?"
    ]
  },
  {
    "week": 22,
    "theme": "Places",
    "topic": "Family Business & Shops",
    "l1_part2_model_input": "Describe a person you know who works in a family business. (Examiner Note: Focus your description on the business place itself) You should say:\nWho he/she is\nWhat the business is (e.g., store/restaurant)\nWhat products it sells\nAnd explain what you have learned from observing this business.",
    "l1_part2_student_q2": "Describe a successful small shop or business in your hometown. You should say:\nWhere it is located\nWhat it sells\nWho goes there\nAnd explain why it is successful.",
    "l1_part2_student_q3": "Describe a business or company you would like to work for. You should say:\nWhere it is located\nWhat the environment is like\nWhat the company does\nAnd explain why you want to work there.",
    "l2_part3_questions": [
      "Would you like to start a family business?",
      "What are the advantages and disadvantages of family businesses?",
      "Why do young people start their own business?",
      "How do large international corporations impact local family-owned businesses?",
      "Is it better for a city's economy to have many small shops or a few large shopping malls?",
      "How has the rise of online shopping changed the physical landscape of city centers?"
    ]
  },
  {
    "week": 23,
    "theme": "Items",
    "topic": "Childhood Toys",
    "l1_part2_model_input": "Describe a toy that you loved in your childhood. You should say:\nWhat the toy was\nWho gave it to you\nHow often you played with it\nAnd explain why it was so special to you.",
    "l1_part2_student_q2": "Describe a game (indoor or outdoor) you played when you were a child. You should say:\nWhat the game was\nWho you played it with\nWhere you played it\nAnd explain why you enjoyed it.",
    "l1_part2_student_q3": "Describe a toy or game that is popular with children today. You should say:\nWhat it is\nWhy it is popular\nWhether you think it is good for children\nAnd explain how it compares to toys from your childhood.",
    "l2_part3_questions": [
      "Do boys and girls prefer different kinds of toys?",
      "How do toys that were popular in the past compare with toys that are popular now?",
      "What should people consider when choosing a toy for a child?",
      "Should kids be permitted to pick their own toys at a toy store?",
      "Do educational toys really help children become smarter?",
      "Is it harmful for children to own too many toys?"
    ]
  },
  {
    "week": 24,
    "theme": "Events",
    "topic": "Technical Mishaps",
    "l1_part2_model_input": "Describe a time when the electricity suddenly went off where you live. You should say:\nWhen it happened\nHow long it lasted\nWhat you did during that time\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe an occasion when an important piece of equipment stopped working. You should say:\nWhat the equipment was\nWhen it happened\nHow it affected you\nAnd explain how you solved the problem.",
    "l1_part2_student_q3": "Describe a time when you broke something by accident. You should say:\nWhat the item was\nHow the accident happened\nHow you felt immediately after\nAnd explain what you did to fix the situation.",
    "l2_part3_questions": [
      "When will equipment break normally? Why?",
      "Do people buy a new one when something is broken, or repair it?",
      "Which do you think is better for production: using machines or making things by hand?",
      "Does the place where you live often experience power cuts?",
      "Are modern societies too dependent on electricity and technology?",
      "Is the \"throwaway culture\" (buying new instead of repairing) sustainable for the environment?"
    ]
  },
  {
    "week": 25,
    "theme": "People",
    "topic": "Mentorship & Support",
    "l1_part2_model_input": "Describe a time when you encouraged someone to do something that he/she didn't want to do. You should say:\nWho he or she is\nWhat you encouraged him/her to do\nHow he/she reacted\nAnd explain why you encouraged him/her to do it.",
    "l1_part2_student_q2": "Describe an important decision you made with the help of others. You should say:\nWhat the decision was\nWho helped you make it\nWhy you needed their help\nAnd explain how you felt about the result.",
    "l1_part2_student_q3": "Describe a person you know who loves to learn from others. You should say:\nWho this person is\nHow they learn (asking questions, observing)\nWhat they have learned\nAnd explain why you think this is a good quality.",
    "l2_part3_questions": [
      "How can leaders encourage their employees?",
      "When should parents encourage their children?",
      "Why do some people like to ask others for advice?",
      "What important decisions should be made by teenagers themselves?",
      "Is positive reinforcement (encouragement) more effective than criticism?",
      "How does peer pressure differ from positive encouragement?"
    ]
  },
  {
    "week": 26,
    "theme": "Places",
    "topic": "Shopping & Service",
    "l1_part2_model_input": "Describe a time you received good service from a staff member in a shop/company. (Examiner Note: Focus your description on the place where this happened) You should say:\nWhere the shop/company is\nWhen you received the good service\nWhat service you received\nAnd explain how you felt about the service.",
    "l1_part2_student_q2": "Describe a shop where you bought something expensive. You should say:\nWhat the shop was\nWhere it is located\nWhat you bought there\nAnd explain why you chose that specific place.",
    "l1_part2_student_q3": "Describe a newly opened shop or facility in your area. You should say:\nWhere it is\nWhat it sells or offers\nWho goes there\nAnd explain if you think it will be successful.",
    "l2_part3_questions": [
      "Do you think expensive services are necessarily good services?",
      "Which one is better, face-to-face service or online service?",
      "Why do people buy things that they clearly don't need?",
      "Do you often go over your budget when you go shopping?",
      "How does poor customer service affect a company's reputation in the age of social media?",
      "Is the trend of automation (e.g., self-checkout) killing the \"human touch\" in shopping?"
    ]
  },
  {
    "week": 27,
    "theme": "Items",
    "topic": "Digital Media",
    "l1_part2_model_input": "Describe an online TV program. You should say:\nWhat the program is\nWhen and where you watched it\nWhat it was about\nAnd explain why you liked/disliked this program.",
    "l1_part2_student_q2": "Describe something interesting you saw on social media. You should say:\nWhat platform you were using\nWhat the content was (video, article, post)\nWhy it caught your attention\nAnd explain why you felt it was interesting.",
    "l1_part2_student_q3": "Describe a website or platform you use to get information. You should say:\nWhat the website is\nHow often you visit it\nWhat kind of information it provides\nAnd explain why you trust it.",
    "l2_part3_questions": [
      "What do you think are the benefits of watching TV programs?",
      "Why don't young people pay much attention to local news?",
      "Do you think some people waste too much time on social media?",
      "What do you think are the drawbacks of social media?",
      "Has the rise of streaming services (like Netflix) destroyed traditional television?",
      "Do you think governments should censor content on the internet?"
    ]
  },
  {
    "week": 28,
    "theme": "Events",
    "topic": "Social Outings",
    "l1_part2_model_input": "Describe a time when you had dinner together with your friend. You should say:\nWhen it was\nWhat you ate\nWhat you talked about\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe an event you attended (e.g., concert or party) that you didn't enjoy. You should say:\nWhat the event was\nWho you went with\nWhy you went there\nAnd explain why you didn't enjoy it.",
    "l1_part2_student_q3": "Describe a celebration you attended recently. You should say:\nWhat the celebration was for\nWhere it was held\nWho was there\nAnd explain how you felt during the event.",
    "l2_part3_questions": [
      "Why are people nowadays less willing to have meals with their families?",
      "What are the differences in food for different occasions?",
      "What kind of music events do people like today?",
      "Do you think children should receive some musical education?",
      "Is it important for communities to have public festivals and celebrations?",
      "How has the definition of \"socializing\" changed with the introduction of smartphones?"
    ]
  },
  {
    "week": 29,
    "theme": "People",
    "topic": "Ethics & Interactions",
    "l1_part2_model_input": "Describe a person who apologized to you. You should say:\nWho the person was\nWhen it was\nWhy this person apologized\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe a time when you told your friend an important truth. You should say:\nWho your friend is\nWhat the truth was\nWhat your friend's reaction was\nAnd explain why you think it was important to be honest.",
    "l1_part2_student_q3": "Describe a person you admire for their honesty. You should say:\nWho this person is\nHow they showed their honesty\nWhat the result of their honesty was\nAnd explain why you respect them.",
    "l2_part3_questions": [
      "In what situations should we apologize immediately?",
      "Do you think accepting apologies is always the correct thing to do?",
      "Do you agree that sometimes people should tell lies (white lies)?",
      "Do you think we should tell the truth at all times?",
      "Is \"honesty\" still valued as a primary virtue in modern business?",
      "How does a culture of forgiveness contribute to social harmony?"
    ]
  },
  {
    "week": 30,
    "theme": "Places (Nature)",
    "topic": "Wild Animals & Habitats",
    "l1_part2_model_input": "Describe a wild animal that you want to know more about. (Examiner Note: You may focus on where this animal lives) You should say:\nWhat it is\nWhere you saw it (or where it lives)\nWhy you are interested in it\nAnd explain why you want to know more about it.",
    "l1_part2_student_q2": "Describe a place where you saw wild animals (e.g., Zoo, National Park). You should say:\nWhere the place was\nWhat animals you saw\nHow the animals were treated\nAnd explain how you felt visiting this place.",
    "l1_part2_student_q3": "Describe a natural habitat you would like to visit to see wildlife. You should say:\nWhere it is located\nWhat kind of ecosystem it is\nWhat animals live there\nAnd explain why you want to go there.",
    "l2_part3_questions": [
      "Why are some people more willing to protect wild animals than others?",
      "Do you think it's important to take children to the zoo to see animals?",
      "Does tourism have a positive or negative impact on animals?",
      "Should animals be kept in captivity for entertainment purposes?",
      "How does the extinction of a single species affect the wider environment?",
      "Is it the responsibility of rich nations to help poor nations protect their wildlife?"
    ]
  },
  {
    "week": 31,
    "theme": "Items (Abstract)",
    "topic": "Science & Imagination",
    "l1_part2_model_input": "Describe an area of science (physics, biology, psychology, etc.) that interests you. You should say:\nWhat it is\nWhen you knew about it\nHow you learnt it\nAnd explain why you are interested.",
    "l1_part2_student_q2": "Describe a time when you needed to use your imagination. You should say:\nWhen it was\nWhy you needed to use your imagination\nHow you used it\nAnd explain how you felt about the result.",
    "l1_part2_student_q3": "Describe a scientific invention that you think is very important. You should say:\nWhat it is\nWho invented it (if you know)\nHow it helps people\nAnd explain why the world would be different without it.",
    "l2_part3_questions": [
      "Are science majors popular in schools?",
      "Is learning science important? What are the applications of science in daily life?",
      "Which requires more imagination: reading books or watching cartoons?",
      "Which occupations (or jobs) require a high degree of imagination?",
      "Does the current education system encourage or kill creativity?",
      "Is scientific progress always good for society, or are there ethical risks?"
    ]
  },
  {
    "week": 32,
    "theme": "Events",
    "topic": "Learning & Trying New Things",
    "l1_part2_model_input": "Describe a new activity that you tried for the first time and felt excited about. You should say:\nWhat it was\nWhen you tried it\nWho you did it with\nAnd explain why you felt excited.",
    "l1_part2_student_q2": "Describe the first time you used a foreign language to communicate. You should say:\nWho you talked to\nWhere it happened\nWhat you talked about\nAnd explain how you felt about your language skills.",
    "l1_part2_student_q3": "Describe a challenge you faced when learning something new. You should say:\nWhat you were learning\nWhy it was difficult\nHow you overcame the difficulty\nAnd explain what you learned from the experience.",
    "l2_part3_questions": [
      "Why do some people like extreme sports?",
      "What common activities could make people relax?",
      "Why do people learn foreign languages?",
      "At what age do you think is the best time for people to learn a foreign language?",
      "Is it necessary to learn the culture of a country when learning its language?",
      "Does globalization mean that everyone will eventually speak the same language?"
    ]
  },
  {
    "week": 33,
    "theme": "People",
    "topic": "Habits & Character",
    "l1_part2_model_input": "Describe a good habit your friend has and you want to develop. You should say:\nWho your friend is\nWhat habit he/she has\nWhen you noticed this habit\nAnd explain why you want to develop this habit.",
    "l1_part2_student_q2": "Describe a bad habit you successfully got rid of. You should say:\nWhat the habit was\nHow long you had it\nHow you stopped it\nAnd explain how your life improved afterwards.",
    "l1_part2_student_q3": "Describe a person you know who is very disciplined. You should say:\nWho they are\nWhat their daily routine is like\nWhy they are so disciplined\nAnd explain what you admire about them.",
    "l2_part3_questions": [
      "What influences do children with bad habits have on other children?",
      "Why do some habits change when people get older?",
      "How do we develop bad habits?",
      "What can we do to get rid of bad habits?",
      "Do you think successful people always have strict daily routines?",
      "Is self-discipline more important than natural talent for success?"
    ]
  },
  {
    "week": 34,
    "theme": "Places",
    "topic": "Restricted Areas & Rules",
    "l1_part2_model_input": "Describe an occasion when you were not allowed to use your mobile phone. (Examiner Note: Focus your description on the place/setting where this rule applied) You should say:\nWhen it was\nWhere it happened\nWhy you were not allowed to use your phone\nAnd explain how you felt about it.",
    "l1_part2_student_q2": "Describe a public place where people must be quiet (e.g., Library, Hospital). You should say:\nWhere it is\nHow often you go there\nWhy silence is important there\nAnd explain how you behave when you are there.",
    "l1_part2_student_q3": "Describe a place you visited where there were strict rules. You should say:\nWhere it was\nWhat the rules were\nWhy the rules existed\nAnd explain if you agreed with the rules.",
    "l2_part3_questions": [
      "How do young and old people use mobile phones differently?",
      "Do you think it is necessary to have laws on the use of mobile phones?",
      "Is it a waste of time to take pictures with mobile phones?",
      "Should there be more \"phone-free zones\" in public spaces?",
      "How has constant connectivity (always being online) affected mental health?",
      "Do rules in society limit our freedom or protect us?"
    ]
  },
  {
    "week": 35,
    "theme": "Items (Time)",
    "topic": "Planning & Waiting",
    "l1_part2_model_input": "Describe something you plan regularly. You should say:\nWhat it is that you plan regularly\nHow often you plan it\nWhat you do to plan it\nAnd explain why you plan it and how you feel about planning it.",
    "l1_part2_student_q2": "Describe a time when you waited for something special. You should say:\nWhat you were waiting for\nHow long you waited\nWhat you did while waiting\nAnd explain how you felt when it finally happened.",
    "l1_part2_student_q3": "Describe a time when you were very busy. You should say:\nWhen it was\nWhy you were so busy\nHow you managed your time\nAnd explain how you felt after the busy period was over.",
    "l2_part3_questions": [
      "Is making plans important?",
      "Should children plan their future careers?",
      "Do you think it is important to be a patient person?",
      "Why do some people dislike waiting?",
      "Does modern technology make us more impatient?",
      "\"Time is money.\" Do you agree with this statement? Why or why not?"
    ]
  },
  {
    "week": 36,
    "theme": "Events",
    "topic": "Competition & Winning",
    "l1_part2_model_input": "Describe a competition (e.g., TV, school, or sports) that you took part in. You should say:\nWhat the competition was\nWhen it took place\nWhat you had to do\nAnd explain how you felt about participating in it.",
    "l1_part2_student_q2": "Describe a prize that you won. You should say:\nWhat the prize was\nHow you won it\nWho you were competing against\nAnd explain how you felt when you received it.",
    "l1_part2_student_q3": "Describe a live sports match or competition you watched. You should say:\nWhat the sport was\nWhere you watched it\nWho was playing\nAnd explain why it was exciting to watch.",
    "l2_part3_questions": [
      "Why do people like to participate in competitions?",
      "Is it good to teach children to be competitive at a young age?",
      "What skills can people learn from team sports that they cannot learn from individual sports?",
      "Do you think companies encourage competition between employees? Is this healthy?",
      "Why are reality TV competitions (like singing or cooking shows) so popular globally?",
      "Is \"winning\" the only thing that matters in professional sports?"
    ]
  },
  {
    "week": 37,
    "theme": "People",
    "topic": "Neighbors & Community",
    "l1_part2_model_input": "Describe a neighbor you have who is interesting or helpful. You should say:\nWho this person is\nHow long you have known them\nHow often you see them\nAnd explain why you think they are interesting/helpful.",
    "l1_part2_student_q2": "Describe a person who contributes a lot to your local community. You should say:\nWho the person is\nWhat they do for the community\nWhy they do it\nAnd explain how their actions affect the neighborhood.",
    "l1_part2_student_q3": "Describe a time you helped a neighbor. You should say:\nWhat the problem was\nHow you helped\nWhat the result was\nAnd explain how you felt about helping them.",
    "l2_part3_questions": [
      "What are the qualities of a \"good neighbor\"?",
      "How has the relationship between neighbors changed compared to the past?",
      "Why do people in big cities often not know their neighbors?",
      "Do you think community centers are important for a neighborhood?",
      "How can neighbors help each other in times of crisis or emergency?",
      "Should there be laws to control noisy neighbors?"
    ]
  },
  {
    "week": 38,
    "theme": "Places",
    "topic": "Water & Coastal Areas",
    "l1_part2_model_input": "Describe a place near water (such as a river, lake, or the ocean) that you enjoyed visiting. You should say:\nWhere this place was\nWhat you did there\nWho you went with\nAnd explain why you liked this place.",
    "l1_part2_student_q2": "Describe a holiday destination you would like to visit. You should say:\nWhere it is located\nHow you would travel there\nWhat you would do there\nAnd explain why this place attracts you.",
    "l1_part2_student_q3": "Describe a place in your country that is famous for its natural beauty. You should say:\nWhere it is\nWhat it looks like\nWhy it is famous\nAnd explain if you think it is a good place for tourists.",
    "l2_part3_questions": [
      "Why do so many people like to live near the water?",
      "What are the dangers of water pollution to society?",
      "Should the government limit tourism in environmentally sensitive areas?",
      "How important is water transportation (shipping) to the global economy?",
      "Do you think future wars will be fought over water resources?",
      "How can individuals reduce their water consumption in daily life?"
    ]
  },
  {
    "week": 39,
    "theme": "Items",
    "topic": "Clothing & Fashion",
    "l1_part2_model_input": "Describe a uniform you have worn (e.g., at school or work). You should say:\nWhen you wore it\nWhat it looked like\nWho provided it\nAnd explain how you felt about wearing it.",
    "l1_part2_student_q2": "Describe a piece of clothing you like to wear on special occasions. You should say:\nWhat it is\nWhere you bought it\nWhen you wear it\nAnd explain why you like it.",
    "l1_part2_student_q3": "Describe a traditional piece of clothing from your country. You should say:\nWhat it is called\nWho wears it\nWhen people usually wear it\nAnd explain the cultural significance of this clothing.",
    "l2_part3_questions": [
      "Why do some companies and schools require people to wear uniforms?",
      "Do you think people are judged too much by the clothes they wear?",
      "How has fashion changed in your country in recent years?",
      "Is it necessary to follow the latest fashion trends?",
      "Do you think expensive designer clothes are worth the money?",
      "Does the \"fast fashion\" industry (cheap, disposable clothing) harm the environment?"
    ]
  },
  {
    "week": 40,
    "theme": "Events",
    "topic": "Festivals & Culture",
    "l1_part2_model_input": "Describe an important traditional festival in your country. You should say:\nWhen the festival takes place\nWhat people do during this festival\nWhat special food is eaten\nAnd explain why this festival is important.",
    "l1_part2_student_q2": "Describe a party or celebration you attended. You should say:\nWhat the celebration was for (e.g., wedding, birthday)\nWho was there\nWhat happened at the party\nAnd explain whether you enjoyed it or not.",
    "l1_part2_student_q3": "Describe a national holiday in your country. You should say:\nWhat day it is\nThe history behind it\nHow you usually spend this day\nAnd explain why it is significant to your nation.",
    "l2_part3_questions": [
      "Is globalization causing young people to lose interest in traditional festivals?",
      "Do you think festivals have become too commercialized (focused on money/shopping)?",
      "Why are public holidays important for the workforce?",
      "How do festivals help to preserve a country's culture?",
      "Should immigrants learn about the festivals of their new country?",
      "What is the difference between how children and adults enjoy festivals?"
    ]
  }
]