[
  {
    "week": 1,
    "part_2": {
      "q1": [
        "Describe a family member who you are proud of.",
        "You should say: Who this person is When this happened What this person did And explain why you felt proud.",
        "To begin with,",
        "I want to talk about my uncle,",
        "who is an accomplished doctor,",
        "because I truly look up to him.",
        "Actually,",
        "he is a very diligent person who always puts others first.",
        "Whenever his patients need help,",
        "he is considerate and completely selfless.",
        "In fact,",
        "he has a generous nature and essentially has a heart of gold.",
        "For example,",
        "he will always go the extra mile to ensure everyone is safe.",
        "I think,",
        "seeing his devoted attitude is highly inspiring to me.",
        "To be honest,",
        "I felt so proud when he saved a life last year."
      ],
      "q2": [
        "Describe a family member who has achieved something great.",
        "You should say: Who the person is What the achievement was How they achieved it And explain how their achievement influenced you.",
        "Honestly,",
        "I want to talk about my older cousin and her amazing achievements.",
        "Last year,",
        "she managed to start her own successful coffee shop in our city.",
        "To make this happen,",
        "she worked day and night to save enough money.",
        "Of course,",
        "it was not easy for her to build everything from nothing.",
        "However,",
        "she learned how to make great drinks and advertise her business online.",
        "I think,",
        "her hard work definitely showed me that anything is possible.",
        "In the end,",
        "her incredible success really motivated me to study much harder for my own future goals."
      ],
      "q3": [
        "Describe a family member you admire for their personality.",
        "You should say: Who this person is What kind of personality they have How they treat others And explain why you admire their character.",
        "I would like to say,",
        "my grandmother is someone I deeply admire for her amazing personality.",
        "Basically,",
        "she is the most patient and caring person I have ever met in my entire life.",
        "Whenever someone is feeling upset,",
        "she always knows exactly what to say to cheer them up quickly.",
        "For example,",
        "she treats every single neighbor like they are part of our own family.",
        "To be honest,",
        "she never gets angry or shouts at anyone.",
        "As a result,",
        "everyone in our community loves and respects her.",
        "Ultimately,",
        "I admire her character because she makes the world a happier place."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What would children do to make their parents proud?",
        "Generally speaking,",
        "children can make their parents proud by excelling in their education,",
        "as academic success is highly valued.",
        "This is because,",
        "parents often sacrifice time to instill good study habits in their kids.",
        "For instance,",
        "when a student achieves top grades,",
        "parents truly appreciate the immense effort shown."
      ],
      "q2": [
        "Q2: What did you do to make your parents proud when you were young?",
        "Looking back,",
        "I made my parents proud when I decided to follow in someone's footsteps by learning the piano.",
        "The primary reason is that,",
        "my mother is a musician who wanted me to share her passion.",
        "As an example,",
        "performing well at my first recital proved that the apple doesn't fall far from the tree."
      ],
      "q3": [
        "Q3: What advantages of yours make you proud?",
        "From my perspective,",
        "I am most proud of my ability to maintain peace,",
        "because it creates harmony in my social circles.",
        "This is largely due to the fact that,",
        "resolving disputes requires immense patience and excellent communication skills.",
        "For example,",
        "whenever my classmates argue,",
        "I step in to offer calm guidance to resolve the issue."
      ],
      "q4": [
        "Q4: When was the last time that you felt proud of yourself?",
        "To be specific,",
        "I felt incredibly proud last month when I helped bridge a generation gap between my grandfather and me.",
        "This was significant because,",
        "younger people and older relatives often struggle to comprehend each other.",
        "As an illustration,",
        "I taught him how to use a smartphone,",
        "which greatly improved our daily conversations."
      ],
      "q5": [
        "Q5: How does family pride contribute to the stability of a society?",
        "It is widely acknowledged that,",
        "family pride creates a strong foundation,",
        "which ultimately leads to a more stable community.",
        "The core reason is that,",
        "people naturally want to protect and support their own flesh and blood.",
        "For instance,",
        "families that respect each other are far less likely to commit crimes in public areas."
      ],
      "q6": [
        "Q6: Do you think the definition of \"success\" within families has changed between the past and the present?",
        "Undeniably,",
        "the definition of success has evolved,",
        "as modern families value personal happiness over just financial wealth.",
        "In the past,",
        "success simply meant being the main breadwinner to provide basic necessities.",
        "Today,",
        "however,",
        "achieving a healthy work-life balance and pursuing individual passions are seen as equally important."
      ]
    }
  },
  {
    "week": 2,
    "part_2": {
      "q1": [
        "Describe a foreign country where you'd like to work for a short time.",
        "You should say: Where you would like to go What kind of work you want to do When you would like to go And explain why you want to work in that place.",
        "To be honest,",
        "I would love to work in London,",
        "which is a cosmopolitan city,",
        "because it offers many excellent opportunities.",
        "Personally,",
        "I want to immerse myself in the culture and avoid any culture shock.",
        "Hopefully,",
        "I can find a lucrative job in the technology sector soon.",
        "I think,",
        "working there will genuinely help me broaden one's horizons.",
        "Of course,",
        "I am an adaptable and diligent person,",
        "so I will easily overcome any language barrier.",
        "Even if,",
        "I have to start from scratch,",
        "it will give me a new perspective on life."
      ],
      "q2": [
        "Describe a city you would like to live in for work purposes.",
        "You should say: Which city it is What industry is popular there How you know about this place And explain why this place is good for your career.",
        "Personally,",
        "I would absolutely love to live and work in Shenzhen in the near future.",
        "To begin with,",
        "this city is famous for its booming technology and software industries.",
        "Actually,",
        "I first learned about this vibrant place from reading various business articles online.",
        "In my opinion,",
        "it is a fantastic location for my long-term career development.",
        "This is because,",
        "there are countless innovative companies that hire young graduates every single year.",
        "Furthermore,",
        "the fast-paced lifestyle pushes people to learn new skills constantly.",
        "Ultimately,",
        "moving there would provide me with the perfect environment to grow professionally."
      ],
      "q3": [
        "Describe a place you visited that you think would be a good place to work.",
        "You should say: Where the place is When you visited it What the lifestyle is like there And explain why you think working there would be enjoyable.",
        "Without a doubt,",
        "a place I visited that would be great for work is Singapore.",
        "I remember,",
        "I traveled there with my parents during the summer holidays two years ago.",
        "From what I saw,",
        "the lifestyle there is very organized,",
        "clean,",
        "and highly efficient.",
        "Actually,",
        "the public transport system makes commuting to an office incredibly easy.",
        "I think,",
        "working there would be deeply enjoyable because the overall environment is very safe.",
        "Besides that,",
        "the city offers amazing food and relaxing parks for the weekends.",
        "Therefore,",
        "it seems like an ideal place to balance a career and personal life."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What kind of job is easy to get in a foreign country?",
        "Generally speaking,",
        "jobs in the restaurant sector are the easiest to secure,",
        "as they require fewer formal qualifications.",
        "This is because,",
        "these entry-level roles usually welcome a highly diverse workforce.",
        "For example,",
        "international students often find quick work in local cafes to bypass the initial language barrier."
      ],
      "q2": [
        "Q2: Should young people work abroad?",
        "In my view,",
        "young people should definitely try to work overseas,",
        "because it provides an incredibly inspiring life experience.",
        "The main reason is that,",
        "international travel fosters rapid personal growth and deepens cultural integration.",
        "For instance,",
        "living in a foreign melting pot teaches young professionals how to become independent quickly."
      ],
      "q3": [
        "Q3: Do Chinese parents encourage their children to work abroad?",
        "Admittedly,",
        "many Chinese parents do encourage working abroad,",
        "as they believe it leads to a more prosperous future.",
        "This is due to the fact that,",
        "global experience can significantly enhance a resume in today’s job market.",
        "As an illustration,",
        "parents often support their children financially so they can benefit from ongoing globalization."
      ],
      "q4": [
        "Q4: Why do some people not want to work overseas?",
        "On the other hand,",
        "some individuals avoid working abroad,",
        "because they fear facing isolation or racial discrimination.",
        "Furthermore,",
        "leaving behind family and friends can ruin their sense of emotional stability and social harmony.",
        "For example,",
        "many people strongly prefer the quiet comfort of their hometown rather than adapting overseas."
      ],
      "q5": [
        "Q5: What are the benefits of working abroad?",
        "Without a doubt,",
        "working abroad offers immense benefits,",
        "as it helps individuals develop vital cross-cultural communication skills.",
        "This is because,",
        "employees must learn local customs,",
        "following the idea that when in Rome,",
        "do as the Romans do.",
        "Consequently,",
        "this cultural flexibility makes them highly valuable to international corporations in the long run."
      ],
      "q6": [
        "Q6: How does the migration of skilled workers (brain drain) affect the economy of the country they leave?",
        "Unfortunately,",
        "the phenomenon of brain drain severely impacts a developing nation,",
        "because it removes essential talent.",
        "The primary issue is that,",
        "losing highly educated professionals slows down domestic innovation and technological progress.",
        "For instance,",
        "when top engineers migrate to wealthier countries,",
        "their home nation struggles to build modern infrastructure."
      ]
    }
  },
  {
    "week": 3,
    "part_2": {
      "q1": [
        "Describe your perfect job.",
        "You should say: What it is Where you heard about it What you need to learn to get the job And explain why you think it is your perfect job.",
        "To begin with,",
        "my dream job is to become an architect,",
        "because I am highly adaptable,",
        "and I love designing things.",
        "Actually,",
        "I first heard about this exciting profession from a documentary on television.",
        "To get this job,",
        "I need to become fully qualified by studying advanced mathematics.",
        "I know,",
        "it is a very demanding and challenging field to enter.",
        "However,",
        "I want to climb the career ladder and work for a prestigious company.",
        "Ultimately,",
        "it is perfect because it is both a lucrative way to make a living and incredibly fulfilling."
      ],
      "q2": [
        "Describe a job you would like to have in the future.",
        "You should say: What the job is What qualifications are required Whether it is a popular job And explain why this job appeals to you.",
        "Honestly,",
        "I would absolutely love to be a software engineer in the future.",
        "To achieve this,",
        "I will need a strong university degree in computer programming.",
        "Right now,",
        "this is an incredibly popular job all around the world due to the rapid rise of modern technology.",
        "I think,",
        "this profession appeals to me because I truly enjoy solving complex logic puzzles.",
        "Furthermore,",
        "the tech industry offers a lot of flexibility and the chance to work from home.",
        "Most importantly,",
        "I want to create useful applications that can genuinely help people in their daily lives."
      ],
      "q3": [
        "Describe a well-paid job that you would be good at.",
        "You should say: What the job is What skills you have that match this job How you would find this job And explain why you think you would succeed in this role.",
        "In my opinion,",
        "a well-paid job that I would be great at is an international translator.",
        "Currently,",
        "I have excellent language skills and a deep understanding of different cultures.",
        "To actually find this role,",
        "I would probably apply directly to big international companies or government agencies online.",
        "I believe,",
        "I would succeed because I am very patient and pay close attention to tiny details.",
        "Also,",
        "I am very comfortable speaking in front of large groups of people.",
        "Therefore,",
        "I could easily help businesses communicate effectively across borders without any awkward misunderstandings."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What jobs do children want to do when they grow up?",
        "Generally speaking,",
        "children often dream of becoming doctors or astronauts,",
        "as these roles seem highly heroic.",
        "This is largely because,",
        "kids are heavily influenced by the media and the exciting cartoons they watch.",
        "For instance,",
        "watching a superhero movie might spark the initial motivation to save lives when they are older."
      ],
      "q2": [
        "Q2: What should people consider when choosing jobs?",
        "In my view,",
        "individuals must consider their personal interests,",
        "because passion is essential for long-term career satisfaction.",
        "Furthermore,",
        "evaluating the level of job security is absolutely crucial in today's unpredictable global economy.",
        "For example,",
        "choosing a stable industry prevents the constant terrible fear of sudden unemployment during a financial crisis."
      ],
      "q3": [
        "Q3: Is salary the main reason people choose a certain job?",
        "Admittedly,",
        "salary is a major factor,",
        "as everyone needs sufficient income to bring home the bacon.",
        "However,",
        "a high salary alone cannot compensate for a toxic work environment or extreme daily stress.",
        "Consequently,",
        "many employees will actually accept a slightly lower wage if it guarantees a better work-life balance."
      ],
      "q4": [
        "Q4: What kind of jobs are well-paid?",
        "It is widely acknowledged that,",
        "roles in technology and finance are highly lucrative,",
        "because they strictly drive the modern economy.",
        "The core reason is that,",
        "these sectors require specialized knowledge and professionals who can think outside the box.",
        "For instance,",
        "top software developers in prosperous cities receive massive financial bonuses for creating innovative programs."
      ],
      "q5": [
        "Q5: Do people's ideal jobs change as they grow up?",
        "Undeniably,",
        "career aspirations shift drastically over time,",
        "as adults gain a much more realistic understanding of the world.",
        "As people mature,",
        "they realize they do not want to be stuck forever in a boring dead-end job.",
        "As an illustration,",
        "a teenager might want to be a singer,",
        "but later cautiously chooses a stable accounting career instead."
      ],
      "q6": [
        "Q6: To what extent does technology (such as AI) threaten traditional job roles in modern society?",
        "Without a doubt,",
        "the rise of automation poses a significant threat,",
        "as machines can now perform repetitive tasks perfectly.",
        "The primary issue is that,",
        "this technological shift rapidly accelerates the brain drain in traditional manufacturing sectors.",
        "For example,",
        "factory workers are frequently replaced by intelligent robots,",
        "forcing them to learn completely new digital skills."
      ]
    }
  },
  {
    "week": 4,
    "part_2": {
      "q1": [
        "Describe a movie you watched recently that you felt disappointed about.",
        "You should say: What it was Why you decided to watch it When you watched it And explain why you felt disappointed about it.",
        "To be honest,",
        "I want to talk about a sci-fi movie I saw last weekend,",
        "because it was highly anticipated,",
        "and I love the actors.",
        "Actually,",
        "the studio tried to hype up the film with amazing trailers.",
        "However,",
        "the storyline was completely predictable and deeply confusing.",
        "I think,",
        "the acting was very mediocre,",
        "making the whole experience a huge let-down.",
        "Personally,",
        "I felt it was incredibly overrated by the critics.",
        "In fact,",
        "watching it felt like a complete waste of time instead of being fulfilling.",
        "Ultimately,",
        "it failed to meet my demanding expectations for a good film."
      ],
      "q2": [
        "Describe a film that did not meet your expectations.",
        "You should say: What the film was called What you expected to see What actually happened in the film And explain why it failed to meet your expectations.",
        "Recently,",
        "I watched a comedy film that really failed to meet my expectations.",
        "To begin with,",
        "I expected to see a funny story packed with constant jokes.",
        "Instead,",
        "the plot was incredibly slow and the humor felt very forced and unnatural.",
        "Basically,",
        "the characters just sat around talking for two hours without anything exciting happening.",
        "I think,",
        "it failed to impress me because the writing was just not clever at all.",
        "Moreover,",
        "the ending was very abrupt and left too many questions unanswered.",
        "Overall,",
        "I left the cinema feeling quite bored and frustrated."
      ],
      "q3": [
        "Describe a time you regretted watching a specific movie or show.",
        "You should say: Where you watched it Who you watched it with Why you chose it And explain what made the experience negative.",
        "I clearly remember,",
        "regretting a horror movie I watched at home with my best friend last month.",
        "Actually,",
        "we chose it because it was popular online and everyone was talking about it.",
        "However,",
        "the experience was completely negative because the movie relied too much on cheap jump scares.",
        "To make matters worse,",
        "the special effects looked incredibly fake and ruined the atmosphere.",
        "Furthermore,",
        "the main characters made ridiculous decisions that made no logical sense.",
        "In the end,",
        "we both agreed that we could have spent our evening doing something much more fun."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Do you believe movie reviews?",
        "Generally speaking,",
        "I only trust reviews from independent critics,",
        "as mainstream websites are often paid for marketing.",
        "This is because,",
        "studios use their massive financial influence to artificially boost the ratings of a blockbuster.",
        "For instance,",
        "many highly rated action films turn out to be completely boring when you actually watch them."
      ],
      "q2": [
        "Q2: What are the different types of films in your country?",
        "In my observation,",
        "audiences in my country enjoy a wide variety of films,",
        "though comedies are particularly beloved.",
        "The primary reason is that,",
        "people seek lighthearted entertainment as a motivation to relax after working hard.",
        "As an example,",
        "the romance and martial arts genre also attract massive crowds during national holidays."
      ],
      "q3": [
        "Q3: Are historical films popular in your country?",
        "Why?",
        "Undeniably,",
        "historical films are extremely popular,",
        "because they deeply connect the younger generation with their cultural heritage.",
        "This is largely due to the fact that,",
        "these movies often feature stunning traditional cinematography and epic battles.",
        "For example,",
        "historical stories are frequently a massive box office hit during the lively Spring Festival season."
      ],
      "q4": [
        "Q4: Do you think films with famous actors or actresses are more likely to become successful?",
        "Admittedly,",
        "having a star-studded cast guarantees initial ticket sales,",
        "as loyal fans will always support their favorite celebrities.",
        "However,",
        "fame alone cannot save a movie if the script is poorly written or the directing is weak.",
        "Consequently,",
        "relying entirely on famous faces instead of good storytelling is a very risky strategy for modern filmmakers."
      ],
      "q5": [
        "Q5: Why are Japanese animated films so popular?",
        "It is widely acknowledged that,",
        "Japanese animation is globally successful,",
        "because it explores deep philosophical themes beautifully.",
        "Furthermore,",
        "their unique visual style easily keeps audiences completely on the edge of one's seat.",
        "For instance,",
        "the smart combination of emotional storytelling and modern digital automation (自动化 (used in context of CGI)) creates true visual masterpieces."
      ],
      "q6": [
        "Q6: Should directors pay a lot of money to famous actors?",
        "In my view,",
        "directors should not overpay actors,",
        "as this practice severely limits the budget for actual production quality.",
        "The core issue is that,",
        "excessive salaries take away funds needed for proper editing and navigating strict censorship requirements.",
        "Therefore,",
        "it is much wiser to invest money in talented script writers rather than just paying expensive celebrities."
      ]
    }
  },
  {
    "week": 5,
    "part_2": {
      "q1": [
        "Describe a person who encouraged you to protect nature.",
        "You should say: Who this person is How you knew this person What he/she said or did to encourage you And explain how you felt about it.",
        "To begin with,",
        "I want to talk about my uncle,",
        "who is a very conscientious person,",
        "because he constantly teaches me to be eco-friendly.",
        "Actually,",
        "he is a truly passionate advocate for sustainable living in our hometown.",
        "For example,",
        "he always tries to do his bit by picking up litter in the park.",
        "I think,",
        "he is a genuine nature lover who makes sure to practice what you preach every day.",
        "To be honest,",
        "his daily dedication is incredibly inspiring to me.",
        "Therefore,",
        "his amazing actions are never predictable and always motivate me."
      ],
      "q2": [
        "Describe a person who is very interested in the environment.",
        "You should say: Who they are What they do to help the environment How they influence others And explain what you have learned from them.",
        "Honestly,",
        "I would like to describe a university professor I met last year.",
        "Basically,",
        "she dedicates all her free time to planting trees in our local community.",
        "In addition,",
        "she runs a popular social media account to educate young people about climate change.",
        "I think,",
        "she influences others by showing how simple actions can make a huge difference.",
        "For instance,",
        "she convinced my entire class to stop using plastic water bottles.",
        "Ultimately,",
        "I have learned from her that every individual has the power to protect our beautiful planet."
      ],
      "q3": [
        "Describe an environmental activist or leader you admire.",
        "You should say: Who this person is What cause they fight for How they spread their message And explain why you respect their efforts.",
        "Personally,",
        "I deeply admire a young activist from my city who fights for clean oceans.",
        "Essentially,",
        "his main cause is to stop factories from dumping dangerous chemicals into the water.",
        "To achieve this,",
        "he organizes massive beach clean-up events every single month.",
        "Furthermore,",
        "he spreads his message by giving passionate speeches at local high schools.",
        "I believe,",
        "his bravery is truly remarkable because he often faces strong opposition from wealthy companies.",
        "In the end,",
        "I respect his efforts because he risks his own comfort for the greater good."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: How do people protect the environment?",
        "Generally speaking,",
        "people protect the environment by recycling daily,",
        "because this massively reduces unnecessary waste.",
        "This is absolutely crucial since,",
        "protecting local biodiversity is necessary for human survival.",
        "For instance,",
        "even though one person's effort feels like a drop in the ocean,",
        "collective community action makes a huge difference."
      ],
      "q2": [
        "Q2: Do you think it's important to protect wild animals/nature?",
        "Undeniably,",
        "it is vital to protect nature,",
        "as wildlife strictly maintains our fragile ecological balance.",
        "The primary reason is that,",
        "failing to prioritize conservation will destroy future food sources.",
        "Consequently,",
        "we must bridge the generation gap to ensure older and younger people work together on this urgent issue."
      ],
      "q3": [
        "Q3: What are the main environmental problems in your country?",
        "In my view,",
        "the most serious problem is severe air pollution,",
        "which deeply affects public health.",
        "This is largely due to the fact that,",
        "rapid industrial growth has prioritized profits over clean air.",
        "As an illustration,",
        "heavy smog in major cities is just the tip of the iceberg regarding the damage."
      ],
      "q4": [
        "Q4: Do you think we should use more renewable energy?",
        "Why?",
        "Without a doubt,",
        "we must aggressively shift to renewable energy,",
        "because fossil fuels are rapidly depleting.",
        "This is absolutely necessary since,",
        "traditional dirty energy sources actively wreak havoc on the global climate.",
        "For example,",
        "utilizing solar panels can significantly reduce our carbon footprint and prevent further deadly temperature increases."
      ],
      "q5": [
        "Q5: Should schools teach students about environmental protection?",
        "Absolutely,",
        "schools must teach environmental protection,",
        "as children are the future leaders of our planet.",
        "The core reason is that,",
        "early education effectively fosters a lifelong sense of responsibility towards nature.",
        "For instance,",
        "teaching students about animal extinction helps them genuinely understand the real-world consequences of human negligence."
      ],
      "q6": [
        "Q6: How effective is international cooperation in solving global environmental crises?",
        "It is widely acknowledged that,",
        "international cooperation is highly effective,",
        "because pollution does not respect national borders.",
        "This essentially means that,",
        "a single country's domestic policies cannot solve global warming alone.",
        "Therefore,",
        "global treaties have a massive influence on successfully reducing carbon emissions across the entire industrialized world."
      ]
    }
  },
  {
    "week": 6,
    "part_2": {
      "q1": [
        "Describe a place with a lot of trees that you would like to visit (e.",
        "g.,",
        "a forest,",
        "oasis).",
        "You should say: Where it is How you knew this place What it is like And explain why you would like to visit it.",
        "To begin with,",
        "I really want to visit a tranquil bamboo forest in Sichuan,",
        "because I need to get away from it all,",
        "which sounds amazing.",
        "Actually,",
        "I discovered this picturesque location while reading an eco-friendly travel blog online.",
        "Apparently,",
        "the scenery is completely breathtaking with endless lush green trees.",
        "I think,",
        "it is quite isolated,",
        "making it the perfect place to find some peace and quiet.",
        "Furthermore,",
        "the local village focuses heavily on sustainable tourism.",
        "Ultimately,",
        "I want to visit this place because it is totally off the beaten track."
      ],
      "q2": [
        "Describe a park or garden in your city that you enjoy visiting.",
        "You should say: Where it is located How often you go there What you do there And explain why you find this place relaxing.",
        "Honestly,",
        "my favorite place to relax is the central botanical garden located right in the middle of our city.",
        "Typically,",
        "I try to go there at least twice a month on Sunday mornings.",
        "While I am there,",
        "I usually sit on a quiet bench and read a novel.",
        "Sometimes,",
        "I just enjoy watching the little birds and the people walking by.",
        "I think,",
        "I find this place so relaxing because it completely blocks out the noisy city traffic.",
        "In the end,",
        "breathing in the fresh air always makes me feel incredibly calm and refreshed."
      ],
      "q3": [
        "Describe a natural environment (such as a forest or mountain) that impressed you.",
        "You should say: Where this place is When you went there Who you went with And explain why this place was memorable.",
        "Without a doubt,",
        "the most impressive natural environment I have ever seen is the Yellow Mountain.",
        "I remember,",
        "I traveled there with my parents during the national holiday last autumn.",
        "To be honest,",
        "the hike up the mountain was incredibly exhausting for all of us.",
        "However,",
        "the view from the very top was absolutely worth the physical effort.",
        "I believe,",
        "this place was so memorable because we saw a stunning sea of clouds below us.",
        "Ultimately,",
        "standing above the clouds made me feel completely disconnected from my daily stressful life."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do people like visiting places with trees or forests?",
        "Generally speaking,",
        "people visit forests to escape stress,",
        "as modern life is often overwhelming.",
        "This is due to the fact that,",
        "rapid urbanization creates noisy and crowded living conditions.",
        "For example,",
        "taking a walk among trees is literally a breath of fresh air for exhausted city workers."
      ],
      "q2": [
        "Q2: Are natural views better than city views?",
        "In my view,",
        "natural views are far superior,",
        "because they provide immense psychological benefits.",
        "The primary reason is that,",
        "staring at a concrete jungle all day increases mental fatigue.",
        "As an illustration,",
        "looking at green plants has a proven therapeutic effect on the human brain."
      ],
      "q3": [
        "Q3: Do all people need some nature?",
        "Absolutely,",
        "every human needs access to nature,",
        "as we are biologically connected to the earth.",
        "This is crucial since,",
        "humanity evolved in a natural habitat long before modern cities existed.",
        "Consequently,",
        "getting back to nature on weekends is essential for maintaining our emotional health."
      ],
      "q4": [
        "Q4: Are people hard-wired to protect the environment?",
        "Admittedly,",
        "not everyone is naturally protective,",
        "because greed often overrides environmental concerns.",
        "The core issue is that,",
        "massive corporations frequently prioritize profits over the preservation of natural resources.",
        "For instance,",
        "ongoing deforestation for farming proves that many people value money over ecological balance."
      ],
      "q5": [
        "Q5: How does rapid urbanization impact the mental health of city dwellers?",
        "Undeniably,",
        "city expansion heavily impacts mental health,",
        "as it separates people from calming green spaces.",
        "Furthermore,",
        "the constant traffic noise and severe pollution contribute to very high stress levels.",
        "Therefore,",
        "city residents frequently suffer from anxiety compared to those living in quiet country areas."
      ],
      "q6": [
        "Q6: Should governments prioritize economic development over the preservation of natural green spaces?",
        "It is widely acknowledged that,",
        "governments must balance development and nature,",
        "because destroying green spaces is permanent.",
        "This is necessary since,",
        "economic growth means nothing if it destroys local biodiversity.",
        "For example,",
        "building a factory over a park permanently ruins the community's quality of life."
      ]
    }
  },
  {
    "week": 7,
    "part_2": {
      "q1": [
        "Describe an application (app) you usually use on your phone or computer.",
        "You should say: What it is When you use it Why you use it often And explain how you feel about it.",
        "To begin with,",
        "I want to describe WeChat,",
        "which is truly an indispensable app,",
        "because I use it daily.",
        "Actually,",
        "this innovative platform puts everything right at your fingertips.",
        "For instance,",
        "I use it to chat with friends,",
        "ensuring I never feel isolated.",
        "I think,",
        "its clean interface is incredibly user-friendly and highly efficient.",
        "However,",
        "the short videos can be quite addictive and I often lose track of time.",
        "Sometimes,",
        "I am completely glued to the screen watching breathtaking travel clips.",
        "Overall,",
        "I feel that this app has completely transformed my social life."
      ],
      "q2": [
        "Describe a mobile app that has made your daily life easier.",
        "You should say: What the app is How it functions What specific problem it solves for you And explain why you would recommend it to others.",
        "Honestly,",
        "a mobile app that has made my life much easier is a digital map.",
        "Basically,",
        "it uses GPS technology to track my location and gives me live audio directions.",
        "In the past,",
        "I used to get lost very easily whenever I visited a new city.",
        "However,",
        "this helpful app completely solves that problem by showing me the fastest routes.",
        "I think,",
        "I would highly recommend it to others because it saves so much time and daily stress.",
        "Ultimately,",
        "it is completely free and works perfectly even when traffic is terrible."
      ],
      "q3": [
        "Describe an app you use for learning or self-improvement.",
        "You should say: What the app teaches How often you use it How effective it is And explain why you prefer using an app over traditional methods.",
        "Personally,",
        "I frequently use a popular language learning app to improve my English vocabulary.",
        "Typically,",
        "I try to practice on it for about twenty minutes every single night before bed.",
        "I believe,",
        "it is highly effective because it uses fun games to test my daily memory.",
        "Actually,",
        "I prefer using this app over traditional textbooks because it is much more interactive.",
        "Furthermore,",
        "I can use it anywhere,",
        "like when I am sitting on the bus.",
        "In the end,",
        "it makes studying feel like an entertaining hobby rather than boring schoolwork."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What is the difference between how young and old people use apps?",
        "Generally speaking,",
        "young people use apps for entertainment,",
        "while older generations focus on practical tools.",
        "This is because,",
        "teenagers have a much higher dependency on social media for their daily communication.",
        "For instance,",
        "a young person might act like a social butterfly online,",
        "whereas grandparents only use banking apps."
      ],
      "q2": [
        "Q2: Why do some people dislike using apps?",
        "In my view,",
        "some individuals dislike apps,",
        "because they feel overwhelmed by constant daily notifications.",
        "The primary reason is that,",
        "continuous phone alerts lead to severe information overload and mental fatigue.",
        "Furthermore,",
        "many older users are deeply concerned that these applications secretly steal their personal privacy."
      ],
      "q3": [
        "Q3: What is the most popular app in your country?",
        "Without a doubt,",
        "the most popular app is WeChat,",
        "as it completely dominates digital communication.",
        "This is largely due to the fact that,",
        "the rapid digitalization of society requires an all-in-one platform.",
        "For example,",
        "it facilitates everything from daily business interaction to paying utility bills with a single tap."
      ],
      "q4": [
        "Q4: Are people becoming too dependent on mobile apps?",
        "Admittedly,",
        "society has become overly dependent,",
        "because apps now control almost every daily task.",
        "This reliance is a double-edged sword,",
        "as it brings great convenience but severely reduces basic survival skills.",
        "As an illustration,",
        "due to modern urbanization,",
        "many young people cannot navigate their own city without maps."
      ],
      "q5": [
        "Q5: To what extent do mobile applications compromise user privacy and data security?",
        "Unfortunately,",
        "mobile apps heavily compromise data security,",
        "as many platforms legally sell user information.",
        "The core issue is that,",
        "greedy companies track our location and browsing habits to generate targeted advertising.",
        "Therefore,",
        "poor cybersecurity measures often leave individuals completely vulnerable to identity theft and financial fraud."
      ],
      "q6": [
        "Q6: Will digital tools eventually replace traditional face-to-face services entirely?",
        "It is widely acknowledged that,",
        "digital tools will not replace humans,",
        "because physical contact remains vital.",
        "This is necessary since,",
        "humans naturally crave empathy and real emotional connection during difficult or stressful situations.",
        "For instance,",
        "speaking to a real doctor provides a therapeutic comfort that an AI robot simply cannot replicate."
      ]
    }
  },
  {
    "week": 8,
    "part_2": {
      "q1": [
        "Describe a time when you gave advice to others.",
        "You should say: When it was To whom you gave the advice What the advice was And explain why you gave the advice.",
        "To begin with,",
        "I want to talk about giving constructive advice to my friend,",
        "because he was very hesitant.",
        "Actually,",
        "he was reluctant to study for his IELTS exam.",
        "Since we were in the same boat,",
        "I decided to share a word of wisdom with him.",
        "I told him that,",
        "creating an efficient schedule is truly indispensable for success.",
        "Luckily,",
        "he didn't get angry and really decided to take it to heart.",
        "I think,",
        "he realized my suggestion was very sensible.",
        "Ultimately,",
        "he was extremely grateful when he finally passed his test."
      ],
      "q2": [
        "Describe a time you received useful advice from someone.",
        "You should say: Who gave you the advice What the situation was How you applied the advice And explain how this advice helped you.",
        "Honestly,",
        "the best advice I ever received was from my older sister last year.",
        "At the time,",
        "I was feeling extremely stressed about my final university exams.",
        "Basically,",
        "she advised me to stop studying late at night and prioritize getting enough sleep.",
        "To apply this,",
        "I strictly turned off my mobile phone at ten o'clock every single evening.",
        "I think,",
        "this advice helped me tremendously because my brain felt much sharper during the day.",
        "In the end,",
        "I managed to pass all my exams with excellent grades without feeling completely exhausted."
      ],
      "q3": [
        "Describe a situation where you had to make a difficult decision.",
        "You should say: What the decision was Who you consulted for help What the outcome was And explain how you felt after making the decision.",
        "I clearly remember,",
        "a situation where I had to choose between two different universities.",
        "Actually,",
        "one was located in my hometown,",
        "and the other was far away in Beijing.",
        "To make the right choice,",
        "I immediately consulted my parents and my favorite high school teacher.",
        "After listening to their opinions,",
        "I decided to step out of my comfort zone and move to Beijing.",
        "I believe,",
        "the outcome was fantastic because I met so many amazing new friends there.",
        "Ultimately,",
        "I felt incredibly proud of myself for making such an independent decision."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Should people prepare before giving advice?",
        "Generally speaking,",
        "people should definitely prepare before giving advice,",
        "as words can deeply impact others.",
        "This is because,",
        "offering an objective perspective requires careful thought and understanding of the situation.",
        "For instance,",
        "speaking without preparation often leads to careless comments rather than true wisdom."
      ],
      "q2": [
        "Q2: Is it good to ask for advice from strangers online?",
        "In my view,",
        "asking strangers online is highly risky,",
        "because you cannot verify their actual expertise.",
        "The primary reason is that,",
        "trusting anonymous forums is often like the blind leading the blind.",
        "Furthermore,",
        "sharing detailed personal problems on the internet severely compromises your own digital privacy."
      ],
      "q3": [
        "Q3: What are the personalities of people whose job is to give advice to others?",
        "Without a doubt,",
        "professionals who give advice possess high emotional intelligence,",
        "as their job requires empathy.",
        "This is crucial since,",
        "providing effective counseling demands immense patience and active listening skills.",
        "As an illustration,",
        "a good therapist always maintains a calm and supportive attitude during every client interaction."
      ],
      "q4": [
        "Q4: What are the problems if you ask too many people for advice?",
        "Admittedly,",
        "asking too many people causes total confusion,",
        "because everyone will offer a completely different opinion.",
        "The core issue is that,",
        "conflicting advice creates a mental dilemma and paralyzes your decision-making.",
        "Consequently,",
        "you might end up deciding to just sit on the fence forever without acting."
      ],
      "q5": [
        "Q5: Is the advice given by older generations still relevant to the problems young people face today?",
        "Undeniably,",
        "advice from older generations remains highly relevant,",
        "as human nature does not change over time.",
        "Even though technology advances rapidly,",
        "the fundamental struggles of human relationships and careers are always the same.",
        "Therefore,",
        "listening to grandparents prevents young people from having to learn the hard way."
      ],
      "q6": [
        "Q6: To what extent does professional counseling differ from advice given by friends or family?",
        "It is widely acknowledged that,",
        "professional advice is strictly evidence-based,",
        "whereas friends offer purely emotional support.",
        "This is necessary since,",
        "trained experts use proven psychological strategies for proper intervention in serious crises.",
        "For example,",
        "a family member might just agree with you,",
        "but a professional will challenge your thoughts."
      ]
    }
  },
  {
    "week": 9,
    "part_2": {
      "q1": [
        "Describe a child who enjoys drawing/painting.",
        "You should say: How you know this child How often he/she draws What he/she likes to draw or paint And explain why you think he/she likes drawing/painting.",
        "To begin with,",
        "I want to talk about my nephew,",
        "who is a very imaginative child,",
        "because he loves painting.",
        "Actually,",
        "he is incredibly gifted and clearly possesses a hidden talent for visual arts.",
        "Whenever he holds a brush,",
        "he is truly in one's element and becomes highly expressive.",
        "In fact,",
        "he is very observant and likes to think outside the box.",
        "Even though,",
        "his bedroom gets very messy,",
        "his parents are never reluctant to buy him paint.",
        "I think,",
        "he enjoys drawing because it allows him to share his feelings.",
        "Ultimately,",
        "I am grateful to see his creativity grow daily."
      ],
      "q2": [
        "Describe a creative child you know.",
        "You should say: Who the child is What creative activity they do (e.",
        "g.,",
        "crafts,",
        "building) How they show their creativity And explain why you think creativity is important for their development.",
        "Honestly,",
        "I want to describe a very creative child I know,",
        "which is my younger brother.",
        "Basically,",
        "his favorite creative activity is building huge,",
        "complex cities using Lego blocks.",
        "He shows his creativity by mixing different sets together to build spaceships that nobody else has ever thought of.",
        "I think,",
        "creativity is extremely important for his early development because it teaches him how to solve problems independently.",
        "Furthermore,",
        "building things with his hands improves his patience and focus.",
        "In the end,",
        "his creative playtime makes him a much smarter and happier child."
      ],
      "q3": [
        "Describe a young person who has a natural talent.",
        "You should say: Who they are What their talent is (music,",
        "art,",
        "sports,",
        "etc.",
        ") How you discovered their talent And explain what you think the future holds for them.",
        "I would like to say,",
        "a young person with a natural talent is my little sister.",
        "Actually,",
        "her special talent is playing the violin beautifully without needing to read sheet music.",
        "I first discovered her talent when she copied a song she heard on the television perfectly.",
        "I believe,",
        "she has an amazing gift that makes her stand out from other kids her age.",
        "Looking ahead,",
        "I think the future holds great things for her if she continues practicing.",
        "Ultimately,",
        "she could easily become a professional musician and travel the world performing."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do people choose to visit galleries and museums in person instead of viewing art online?",
        "Generally speaking,",
        "people visit galleries in person,",
        "because seeing a physical masterpiece is much more impactful.",
        "This is due to the fact that,",
        "computer screens cannot accurately display the true aesthetic texture of oil paint.",
        "For example,",
        "standing in front of a real painting allows for a much deeper emotional appreciation of the artwork."
      ],
      "q2": [
        "Q2: Should galleries and museums be free of charge to the public?",
        "In my view,",
        "museums should absolutely be free,",
        "as art must be accessible to everyone in society.",
        "The primary reason is that,",
        "charging high ticket prices excludes poor families from gaining cultural wisdom.",
        "As an illustration,",
        "free public galleries help to paint a picture of history for children who cannot afford private lessons."
      ],
      "q3": [
        "Q3: Why do some people find life inspiration from visiting these places?",
        "Without a doubt,",
        "exhibitions provide immense inspiration,",
        "because they showcase the highest limits of human creativity.",
        "This is crucial since,",
        "viewing historical artifacts gives people a highly objective perspective on their own modern struggles.",
        "Consequently,",
        "an exhausted worker might feel highly motivated after seeing how ancient people built beautiful statues from nothing."
      ],
      "q4": [
        "Q4: Why do most children draw more often than adults do?",
        "Admittedly,",
        "children draw constantly to express themselves,",
        "as they have fewer language skills than grown adults.",
        "Furthermore,",
        "adults are usually more down to earth and busy with stressful jobs to sit and paint.",
        "For instance,",
        "a child will freely draw a purple dog,",
        "proving that beauty is in the eye of the beholder without caring about rules."
      ],
      "q5": [
        "Q5: Is art education in schools as important as science or mathematics?",
        "Undeniably,",
        "art education is equally important,",
        "because it actively develops a student's creative problem-solving skills.",
        "While math teaches strict logic,",
        "art teaches kids how to invent new ideas and express complex emotions properly.",
        "Therefore,",
        "ignoring the arts creates robotic students who lack the innovative thinking needed for future societal progress."
      ],
      "q6": [
        "Q6: How does engaging in artistic activities contribute to the cognitive development of a society?",
        "It is widely acknowledged that,",
        "artistic activities boost cognitive development,",
        "as they challenge the brain to think visually.",
        "This essentially means that,",
        "communities that support the arts tend to produce more forward-thinking engineers and designers.",
        "For example,",
        "learning to play musical instruments improves memory and spatial awareness,",
        "making the whole society much smarter."
      ]
    }
  },
  {
    "week": 10,
    "part_2": {
      "q1": [
        "Describe an interesting building you'd like to visit.",
        "You should say: Where it is How you knew about it What you know about it And explain how you will feel if you go there.",
        "To begin with,",
        "I really want to visit a magnificent museum in Beijing,",
        "because I love history.",
        "Actually,",
        "this iconic building is a famous landmark that will definitely stand the test of time.",
        "I heard that,",
        "the inside is extremely spacious and filled with very imaginative artworks.",
        "Even though,",
        "the exterior looks slightly dilapidated,",
        "it holds many contemporary exhibits.",
        "If I go there,",
        "I will be very observant to catch every tiny detail.",
        "I think,",
        "seeing it in person will totally take one's breath away."
      ],
      "q2": [
        "Describe a historical building in your country.",
        "You should say: Where it is located When it was built What it is used for today And explain why it is important to your country's heritage.",
        "Honestly,",
        "I want to describe the Forbidden City,",
        "which is a very famous historical building in China.",
        "To begin with,",
        "it is located right in the center of Beijing and was built hundreds of years ago.",
        "Today,",
        "it is mainly used as a massive public museum for tourists to explore.",
        "I think,",
        "this place is incredibly important to my country's heritage because it shows how ancient emperors lived.",
        "Furthermore,",
        "the wooden architecture is completely unique and beautiful.",
        "In the end,",
        "visiting there makes me feel deeply connected to my ancestors."
      ],
      "q3": [
        "Describe a modern building that impressed you.",
        "You should say: Where it is What it looks like What function it serves And explain why you admire its architecture.",
        "I clearly remember,",
        "being deeply impressed by the Shanghai Tower when I visited the city last year.",
        "Actually,",
        "it is a massive modern skyscraper located in the main financial district.",
        "It looks like a giant twisting glass tube reaching up into the clouds.",
        "As far as I know,",
        "it serves as an office building for many wealthy international companies.",
        "I truly admire its architecture because it looks incredibly futuristic and stylish.",
        "Ultimately,",
        "standing next to such a tall structure made me realize how fast our country is developing."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Should all museums and historical buildings sell tickets?",
        "Generally speaking,",
        "museums should sell tickets,",
        "as they need funds to maintain their beautiful heritage.",
        "This is because,",
        "the daily preservation of ancient artifacts requires a massive financial budget.",
        "For instance,",
        "using ticket money helps hire experts to restore an old painting so it remains a true masterpiece."
      ],
      "q2": [
        "Q2: Which kind of building do people prefer,",
        "villas or apartments?",
        "In my view,",
        "wealthy people prefer villas,",
        "while most standard citizens live in high-rise apartments.",
        "The primary reason is that,",
        "a city skyscraper provides affordable housing for thousands of daily workers.",
        "As an illustration,",
        "living in a crowded residential block is the only way to get a roof over one's head in Beijing."
      ],
      "q3": [
        "Q3: Why do people prefer to live in new houses?",
        "Without a doubt,",
        "people prefer new houses,",
        "because they offer modern comfort and better safety features.",
        "This is largely due to the fact that,",
        "newly built homes have highly upgraded infrastructure like smart heating.",
        "For example,",
        "older properties often have leaking pipes and broken windows,",
        "which are extremely expensive to fix."
      ],
      "q4": [
        "Q4: Which do people prefer,",
        "modern buildings or traditional buildings?",
        "Admittedly,",
        "young people prefer modern designs,",
        "whereas the older generation deeply values traditional architecture.",
        "The core issue is that,",
        "modern offices are practical,",
        "but ancient temples have a unique aesthetic charm.",
        "Consequently,",
        "modern glass towers turn the city into a cold concrete jungle,",
        "which many older citizens strongly dislike."
      ],
      "q5": [
        "Q5: How does the architecture of a city influence the cultural identity of its residents?",
        "Undeniably,",
        "architecture shapes identity,",
        "as local buildings constantly remind people of their shared history.",
        "When a city protects its ancient walls,",
        "it helps to successfully build bridges between the past and present.",
        "Therefore,",
        "growing up around traditional courtyards makes citizens feel incredibly proud of their unique local culture."
      ],
      "q6": [
        "Q6: Is it necessary to preserve old buildings even if they impede modern urban development?",
        "It is widely acknowledged that,",
        "preserving old buildings is essential,",
        "because history cannot be replaced once destroyed.",
        "This means that,",
        "developers should carefully build around historical sites rather than tearing them down for quick money.",
        "For instance,",
        "European cities successfully mix ancient churches with new train stations without losing their charm."
      ]
    }
  },
  {
    "week": 11,
    "part_2": {
      "q1": [
        "Describe a technology product you would like to own.",
        "You should say: What it is How much it costs What you will use it for And explain why you would like to own it.",
        "To begin with,",
        "I really want to buy a cutting-edge laptop,",
        "because my current computer is completely obsolete,",
        "and I urgently need an upgrade.",
        "Actually,",
        "this new device is a highly versatile tool that is absolutely perfect for school.",
        "Even though it is quite compact,",
        "the internal hard drive is incredibly spacious.",
        "I know that it is extremely pricey and will definitely cost an arm and a leg.",
        "However,",
        "the magnificent screen makes it a definite must-have for my daily homework.",
        "Ultimately,",
        "owning this state-of-the-art machine would make my study sessions much more productive."
      ],
      "q2": [
        "Describe a piece of modern technology that saves you time.",
        "You should say: What the device is How often you use it How it works And explain why it is efficient.",
        "Honestly,",
        "I want to talk about my smart robotic vacuum cleaner that saves me hours of tedious housework.",
        "Typically,",
        "I use this convenient device every single day before I leave for school.",
        "Basically,",
        "it works by scanning the layout of the room and automatically sweeping up dust from the floor.",
        "I think,",
        "it is incredibly efficient because I can control it directly from my mobile phone.",
        "Therefore,",
        "it cleans the entire apartment perfectly while I am completely busy doing other things.",
        "Ultimately,",
        "this amazing machine gives me much more free time to simply relax and enjoy my evenings."
      ],
      "q3": [
        "Describe an invention that has changed the world significantly.",
        "You should say: What the invention is When it was created How it affects our daily lives And explain whether you think the change is positive or negative.",
        "Without a doubt,",
        "the most significant invention that has changed our world is the internet.",
        "As far as I know,",
        "it was created several decades ago to help scientists share important research.",
        "Today,",
        "it affects our daily lives constantly by allowing us to chat with friends across the globe instantly.",
        "In my opinion,",
        "this massive change is overwhelmingly positive because it makes learning new things so much easier.",
        "However,",
        "we must be careful not to spend too much time staring at screens.",
        "Overall,",
        "the internet has deeply connected humanity and completely transformed how we live."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What tech products are your friends using these days?",
        "Generally speaking,",
        "my friends are currently obsessed with Virtual reality headsets,",
        "because they completely Revolutionize modern gaming.",
        "This is because,",
        "these immersive devices allow young players to experience entirely new worlds right from their bedrooms.",
        "For example,",
        "instead of a boring Distraction,",
        "they cleverly use it to explore ancient historical Heritage sites online."
      ],
      "q2": [
        "Q2: Why do people love using tech products?",
        "In my view,",
        "people genuinely love modern gadgets,",
        "as they provide massive convenience and endless entertainment options.",
        "The primary reason is that,",
        "heavy tasks that previously took hours can now be completed At the click of a button.",
        "As an illustration,",
        "we can instantly order hot food or seamlessly book taxis without ever leaving our comfortable homes."
      ],
      "q3": [
        "Q3: What are the differences between chatting online and chatting face-to-face?",
        "Undeniably,",
        "face-to-face communication builds deeper emotional bonds,",
        "whereas texting often causes unfortunate interpersonal misunderstandings.",
        "This is largely due to the fact that,",
        "digital messages completely lack essential physical body language and vocal tone.",
        "Consequently,",
        "relying solely on internet chatting frequently leads to a severe sense of social Isolation among teenagers."
      ],
      "q4": [
        "Q4: Has technology widened the economic gap between the rich and the poor?",
        "Admittedly,",
        "technology has heavily widened the wealth gap,",
        "as expensive devices are strictly limited to affluent families.",
        "However,",
        "a clear Silver lining is that cheap smartphones now give poor students excellent access to free education.",
        "For instance,",
        "upgrading digital Infrastructure in rural villages helps impoverished children finally learn critical skills online."
      ],
      "q5": [
        "Q5: Do you think people are losing their ability to communicate effectively due to screens?",
        "Without a doubt,",
        "heavy screen usage severely damages our social skills,",
        "because we practice real conversations much less frequently.",
        "This is primarily since,",
        "younger generations constantly text rather than speaking directly just to Keep up with the times.",
        "Therefore,",
        "many teenagers feel extremely awkward and painfully anxious when they have to order food face-to-face."
      ],
      "q6": [
        "Q6: To what extent should governments regulate the development of Artificial Intelligence?",
        "It is widely acknowledged that,",
        "governments must strictly regulate Artificial Intelligence,",
        "as it possesses highly dangerous capabilities.",
        "The core issue is that,",
        "unregulated algorithms could easily manipulate public opinions or steal private user data.",
        "For example,",
        "creating strict international laws effectively prevents wealthy tech companies from secretly abusing these powerful new computer systems."
      ]
    }
  },
  {
    "week": 12,
    "part_2": {
      "q1": [
        "Describe an occasion when you lost your way.",
        "You should say: Where you were What happened How you felt And explain how you found your way.",
        "To begin with,",
        "I clearly remember getting completely lost in Beijing,",
        "because I was wandering through an unfamiliar neighborhood.",
        "Actually,",
        "I was trying to find a famous restaurant but suddenly felt extremely disoriented.",
        "Because the tiny streets looked identical,",
        "I started to go around in circles.",
        "At first,",
        "I was terribly panicked and thought finding my way back was a lost cause.",
        "Luckily,",
        "I used my compact and versatile smartphone to ask a helpful local police officer for directions.",
        "Ultimately,",
        "I felt so relieved when I finally arrived back at my hotel safe and sound."
      ],
      "q2": [
        "Describe a time you arrived late for an important event.",
        "You should say: What the event was Why you were late What the consequences were And explain how you felt about the situation.",
        "Honestly,",
        "I want to describe a terrible time when I arrived very late for my best friend's birthday party.",
        "To begin with,",
        "the party was held at a nice restaurant across the city during the busy Friday rush hour.",
        "Unfortunately,",
        "I missed my bus and got stuck in heavy traffic for over an hour.",
        "When I finally arrived,",
        "they had already finished eating the delicious birthday cake without me.",
        "I felt incredibly embarrassed and highly apologetic about ruining the special mood.",
        "In the end,",
        "I learned a harsh lesson about leaving my house much earlier."
      ],
      "q3": [
        "Describe a time you helped someone who was lost.",
        "You should say: Where this happened Who the person was How you helped them And explain how you felt after helping them.",
        "I clearly remember,",
        "a time when I helped a confused foreign tourist who was completely lost near the subway station.",
        "Actually,",
        "this happened last summer while I was casually walking home from my high school.",
        "The man was holding a large paper map and desperately trying to find the national museum.",
        "Fortunately,",
        "I speak basic English,",
        "so I carefully explained the correct subway line he needed to take.",
        "He smiled brightly and thanked me multiple times for my quick assistance.",
        "Ultimately,",
        "I felt extremely proud of myself for using my language skills to help a stranger."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do some people get lost more easily than others?",
        "Generally speaking,",
        "some individuals get lost easily,",
        "because they naturally lack a basic sense of spatial Orientation.",
        "This is because,",
        "they completely ignore their surroundings and rely entirely on digital Distraction like texting.",
        "For instance,",
        "someone who never pays attention to a physical Landmark will severely struggle to memorize any new city route."
      ],
      "q2": [
        "Q2: Do you think it is important to do some preparation before you travel to new places?",
        "In my view,",
        "thorough preparation is absolutely vital,",
        "as it ensures you remain safe in completely unknown environments.",
        "The primary reason is that,",
        "doing research helps you quickly Find one's feet in a foreign culture.",
        "However,",
        "some brave backpackers wildly prefer zero planning,",
        "simply deciding to Cross that bridge when you come to it."
      ],
      "q3": [
        "Q3: How can people find their way when they are lost?",
        "Without a doubt,",
        "using mobile phone Navigation apps is easily the most effective method for lost travelers.",
        "This is largely due to the fact that,",
        "GPS technology can pinpoint your exact global location almost instantly.",
        "Alternatively,",
        "if they have no internet connection,",
        "they must trust their own Intuition or bravely ask a local police officer."
      ],
      "q4": [
        "Q4: Is a paper map still necessary?",
        "Admittedly,",
        "paper maps are rarely used daily,",
        "but they remain strictly necessary for severe emergency backup situations.",
        "The core issue is that,",
        "smart phones can easily run out of battery or lose signal in rural mountains.",
        "Consequently,",
        "if you hike entirely Off the beaten track,",
        "a physical map is the only reliable survival tool."
      ],
      "q5": [
        "Q5: Has the reliance on GPS technology reduced our natural ability to navigate?",
        "Undeniably,",
        "our heavy Reliance on GPS has severely diminished our brain's natural mapping abilities over time.",
        "As people blindly follow screen directions,",
        "they completely stop memorizing street names or observing the actual physical world.",
        "Therefore,",
        "if the Virtual map crashes,",
        "most young drivers are completely incapable of driving themselves back home safely."
      ],
      "q6": [
        "Q6: How does getting \"lost\" (metaphorically) in a new culture help a person grow?",
        "It is widely acknowledged that,",
        "struggling in a new culture intensely builds personal resilience and extreme patience.",
        "This is necessary since,",
        "navigating entirely unfamiliar social rules forces individuals to step far outside their comfortable boundaries.",
        "For example,",
        "accidentally ordering the wrong food teaches travelers to embrace exciting mistakes and ultimately become much more adaptable."
      ]
    }
  },
  {
    "week": 13,
    "part_2": {
      "q1": [
        "Describe a famous person you would like to meet.",
        "You should say: Who he/she is How you know about him/her How/where you would like to meet him/her And explain why you would like to meet him/her.",
        "To begin with,",
        "I would absolutely love to meet a highly influential athlete named Yao Ming,",
        "because he is a true basketball legend.",
        "Actually,",
        "I first learned about this amazingly talented player from watching his legendary NBA games on television.",
        "If I met him,",
        "I would ask for some helpful advice on how to improve my own sports skills.",
        "I think,",
        "despite always being in the limelight,",
        "he remains incredibly humble and firmly down to earth.",
        "Furthermore,",
        "his charismatic personality makes him a perfect role model for teenagers.",
        "Ultimately,",
        "I would feel so relieved and happy to shake his giant hand."
      ],
      "q2": [
        "Describe a famous sportsperson you admire.",
        "You should say: Who this person is What sport they play What achievements they have made And explain why you admire them more than other athletes.",
        "Honestly,",
        "I want to talk about a famous sportsperson I deeply admire,",
        "which is the incredible tennis player,",
        "Roger Federer.",
        "To begin with,",
        "he plays professional tennis and has won numerous international championships throughout his long career.",
        "Actually,",
        "I respect him greatly because he achieved all his massive success through strict discipline and endless daily practice.",
        "Furthermore,",
        "he always displays perfect manners and treats his fierce opponents with genuine respect on the court.",
        "In the end,",
        "I admire him much more than other athletes because he carries himself like a true,",
        "polite gentleman."
      ],
      "q3": [
        "Describe a famous person from your country who is known internationally.",
        "You should say: Who they are What they are famous for (e.",
        "g.,",
        "politics,",
        "arts,",
        "science) How they represent your country And explain if you are proud of them.",
        "I clearly remember,",
        "reading about Jackie Chan,",
        "who is easily one of the most internationally recognized actors from my country.",
        "Basically,",
        "he is famous globally for his unique martial arts movies and doing his own incredibly dangerous stunts.",
        "I think,",
        "he represents our country exceptionally well by actively spreading traditional Chinese culture through his highly entertaining films.",
        "Furthermore,",
        "he donates a lot of his personal wealth to various important charities worldwide.",
        "Ultimately,",
        "I am extremely proud of his global impact because he shows the whole world our strong work ethic and bravery."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What are the advantages and disadvantages of being a famous child?",
        "Generally speaking,",
        "famous children gain massive wealth early,",
        "but sadly lose their normal childhood Privacy completely.",
        "This is because,",
        "their entire life is documented by ruthless Paparazzi everywhere they go daily.",
        "For instance,",
        "child actors often Live in a fishbowl,",
        "which inevitably causes severe anxiety and strongly prevents them from making genuine friends."
      ],
      "q2": [
        "Q2: What can today's children do to become famous?",
        "In my view,",
        "children today can easily achieve massive fame by consistently posting creative videos on modern social media.",
        "The primary reason is that,",
        "society has a heavy Reliance on digital entertainment and viral internet trends.",
        "As an illustration,",
        "a kid playing guitar online can quickly become a global Household name overnight without any professional agent."
      ],
      "q3": [
        "Q3: Do people become famous because of their talent?",
        "Without a doubt,",
        "true long-term fame requires genuine talent,",
        "but short-term popularity is often just based on visual beauty.",
        "This is crucial since,",
        "the media's current Orientation strongly favors attractive individuals who cause dramatic controversy.",
        "Consequently,",
        "many influencers gain millions of followers solely due to a shocking Scandal rather than any actual artistic ability."
      ],
      "q4": [
        "Q4: Should students have physical education and do sports at school?",
        "Admittedly,",
        "physical education is incredibly essential,",
        "because it strictly keeps young students highly active and physically healthy.",
        "The core issue is that,",
        "modern schools focus too heavily on exams,",
        "ignoring the massive mental health benefits of team sports.",
        "Therefore,",
        "regular running or playing basketball makes a vital Contribution to reducing a teenager's daily academic stress."
      ],
      "q5": [
        "Q5: To what extent do celebrities sacrifice their privacy for their career?",
        "Undeniably,",
        "celebrities sacrifice almost everything,",
        "as the mainstream media completely destroys their ability to live peacefully.",
        "Once they become successful,",
        "losing their quiet personal life is simply the inevitable Price of fame.",
        "For example,",
        "famous singers cannot even go to a supermarket without aggressive fans demanding photos and signatures constantly."
      ],
      "q6": [
        "Q6: Do famous people have a moral responsibility to be good role models for society?",
        "It is widely acknowledged that,",
        "stars have a huge duty to behave properly,",
        "because millions of young children copy them.",
        "This means that,",
        "exhibiting a toxic lifestyle will permanently ruin their public Reputation and damage impressionable fans.",
        "For instance,",
        "an actor promoting charity work heavily inspires teenagers,",
        "while an actor doing drugs normalizes terrible behavior."
      ]
    }
  },
  {
    "week": 14,
    "part_2": {
      "q1": [
        "Describe a shopping mall you often visit.",
        "You should say: Where it is Who you usually go with What you do there And explain why you like going to this mall so often.",
        "To begin with,",
        "I want to talk about a bustling shopping mall in the city center,",
        "because I absolutely love going there.",
        "Actually,",
        "I usually go there with my best friend whenever we wildly want to shop till you drop.",
        "We mainly enjoy looking at trendy clothes,",
        "even if we are just simply window shopping.",
        "I think,",
        "it is incredibly convenient because the subway stops directly underneath the massive building.",
        "As a strict bargain hunter,",
        "I highly appreciate the vastly affordable food options in the basement.",
        "Even though it often gets quite overcrowded,",
        "the incredibly charismatic staff and highly influential brand stores make it totally worthwhile."
      ],
      "q2": [
        "Describe a traditional street market you enjoy visiting.",
        "You should say: Where it is located What kinds of things they sell How the atmosphere differs from a mall And explain why you like shopping there.",
        "Honestly,",
        "I want to describe a wonderful traditional night market located safely in my grandparents' hometown.",
        "To begin with,",
        "they sell a huge variety of fresh local vegetables,",
        "handmade crafts,",
        "and incredibly delicious street snacks.",
        "I really enjoy the atmosphere because it is so much warmer and far more energetic than a quiet,",
        "modern shopping mall.",
        "The local sellers are always shouting loudly and joking happily with the friendly customers.",
        "I think,",
        "I like shopping there because it feels deeply authentic and allows me to truly experience the real culture of my family."
      ],
      "q3": [
        "Describe a shop that you recently recommended to a friend.",
        "You should say: What the shop sells Where it is Why you recommended it And explain what makes this shop special.",
        "I clearly remember,",
        "highly recommending a small,",
        "independent bookstore to my university classmate last week.",
        "Actually,",
        "the tiny shop mainly sells rare second-hand books and lovely vintage music records.",
        "It is safely located quietly down a narrow alleyway far behind the main city public library.",
        "I recommended it to her because she deeply loves reading classic literature in a peaceful,",
        "extremely cozy environment.",
        "I believe,",
        "what makes this specific shop so special is the extremely knowledgeable owner who always suggests the perfect story.",
        "Ultimately,",
        "it is a hidden gem that true book lovers will appreciate."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Some people believe building shopping malls isn't a good thing,",
        "what do you think?",
        "Generally speaking,",
        "massive shopping malls destroy local culture,",
        "as they aggressively force small,",
        "independent shops to close down entirely.",
        "This is because,",
        "giant Retail chains strongly promote shallow Consumerism rather than genuinely supporting the local community.",
        "For instance,",
        "building a huge concrete plaza often ruins the historical neighborhood's visual charm and heavily increases terrible traffic congestion."
      ],
      "q2": [
        "Q2: Why do people enjoy going to malls?",
        "In my view,",
        "citizens visit malls primarily for entertainment,",
        "because they offer a safe,",
        "climate-controlled environment for socializing.",
        "The primary reason is that,",
        "many young workers desperately rely on Retail therapy to relieve their intense office stress.",
        "As an illustration,",
        "a colorful window display will instantly Catch one's eye,",
        "making exhausted shoppers feel happy and completely relaxed."
      ],
      "q3": [
        "Q3: How did people pay in the past,",
        "and how do they pay now?",
        "Undeniably,",
        "past generations used heavy physical cash,",
        "whereas modern shoppers rely exclusively on scanning mobile phone payment codes.",
        "This is largely due to the fact that,",
        "advanced E-commerce platforms have completely digitized every single daily financial Transaction.",
        "For example,",
        "apps like Alipay allow young buyers to purchase expensive items instantly without needing to carry a thick leather wallet."
      ],
      "q4": [
        "Q4: What are the downsides of mobile payments?",
        "Admittedly,",
        "digital payments heavily encourage extremely Impulsive buying,",
        "as spending invisible digital money feels entirely painless.",
        "Furthermore,",
        "continuously linking your bank card to numerous phone applications actively threatens your personal Privacy and online security.",
        "Consequently,",
        "a simple hacker attack could easily steal your passwords and completely Break the bank in mere seconds."
      ],
      "q5": [
        "Q5: Has the rise of e-commerce (online shopping) caused the death of local small businesses?",
        "Without a doubt,",
        "online shopping has widely devastated local stores,",
        "because internet platforms offer significantly cheaper retail prices.",
        "This is crucial since,",
        "small family shops cannot realistically afford the highly expensive rent required to maintain a physical street presence.",
        "Therefore,",
        "many traditional bookstores have sadly gone bankrupt because customers vastly prefer ordering cheaper digital copies directly to their front door."
      ],
      "q6": [
        "Q6: Is consumerism (the desire to buy more things) beneficial or harmful to society?",
        "It is widely acknowledged that,",
        "extreme consumerism is highly harmful,",
        "as it continuously destroys the natural fragile environment.",
        "The core issue is that,",
        "rapidly manufacturing millions of cheap,",
        "disposable products creates massive amounts of toxic plastic waste.",
        "For instance,",
        "fast-fashion clothing brands have a terrible Reputation for severely polluting rivers just to sell slightly cheaper t-shirts."
      ]
    }
  },
  {
    "week": 15,
    "part_2": {
      "q1": [
        "Describe a book you read that you found useful.",
        "You should say: What it is When you read it Why you think it is useful And explain how you felt about it.",
        "To begin with,",
        "I will talk about an educational book I read,",
        "because it was extremely useful for my studies.",
        "Actually,",
        "it is a famous classic novel that is currently very trendy.",
        "Although many people heavily judge a book by its cover,",
        "the deep storyline here is incredibly captivating.",
        "I think,",
        "the detailed chapters are highly thought-provoking and entirely memorable.",
        "For example,",
        "it was such an amazing page-turner that I managed to completely lose oneself in it.",
        "To be honest,",
        "reading it on an loudly overcrowded train helped me significantly."
      ],
      "q2": [
        "Describe a story you read or heard recently.",
        "You should say: What the story was about Where you read or heard it Who the main characters were And explain why this story stayed in your memory.",
        "Honestly,",
        "I want to describe a truly fascinating story that I heard on a popular internet podcast recently.",
        "To begin with,",
        "the story was heavily about a brave young detective who desperately tried to solve a very mysterious local crime.",
        "I listened to this amazing tale while walking home from my high school last week.",
        "I think,",
        "the main characters were incredibly clever and always worked together closely as a team.",
        "Furthermore,",
        "the surprising plot twist at the end was completely unexpected.",
        "In the end,",
        "this thrilling story stayed in my memory because it kept me guessing constantly."
      ],
      "q3": [
        "Describe a traditional story from your country.",
        "You should say: What the story is When you first heard it What moral lesson it teaches And explain why it is still popular today.",
        "I clearly remember,",
        "the famous traditional story of the Monkey King from my beautiful country.",
        "Actually,",
        "I first heard this magical legend from my grandmother when I was just a little child.",
        "Basically,",
        "it is an exciting tale about a magical monkey who travels to find sacred religious texts.",
        "I believe,",
        "the main moral lesson it strictly teaches is the extreme importance of loyalty and great courage.",
        "Moreover,",
        "the brave hero always uses his clever mind to defeat evil monsters.",
        "Ultimately,",
        "it is still incredibly popular today because it represents our deep cultural history and values."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What should the government do to make libraries better?",
        "Generally speaking,",
        "the government should heavily fund public libraries,",
        "because improving local Accessibility boosts national education.",
        "This is largely due to the fact that,",
        "providing free resources significantly increases basic Literacy rates among poor families.",
        "For example,",
        "when a dedicated Bookworm has free digital tablets,",
        "they can easily study anytime."
      ],
      "q2": [
        "Q2: Which one is better,",
        "paper books or e-books?",
        "In my view,",
        "e-books are much better,",
        "as they offer incredible convenience for modern daily travel.",
        "The primary reason is that,",
        "carrying heavy physical books is exhausting,",
        "whereas a digital device holds thousands of novels.",
        "However,",
        "some traditional readers strongly prefer paper books because they actively resist modern digital Consumerism and screen glare."
      ],
      "q3": [
        "Q3: Why should children listen to bedtime stories?",
        "Without a doubt,",
        "listening to bedtime stories is vital,",
        "because it profoundly stimulates a young child's Imagination.",
        "This is crucial since,",
        "hearing complex narratives safely helps kids logically process their own daily emotional struggles.",
        "For instance,",
        "parents who quietly Hit the books with their toddlers create a highly relaxing routine before sleep."
      ],
      "q4": [
        "Q4: Do Chinese children prefer ancient stories or fairy tales?",
        "Admittedly,",
        "younger Chinese children strongly prefer magical fairy tales,",
        "whereas older students slowly appreciate ancient historical myths.",
        "The core issue is that,",
        "little kids are naturally drawn to extremely colorful,",
        "highly Impulsive magical heroes.",
        "Conversely,",
        "understanding ancient dynasties actually requires them to successfully Read between the lines to learn deep moral lessons."
      ],
      "q5": [
        "Q5: Has the internet reduced the attention span required to read long novels?",
        "Undeniably,",
        "the modern internet has severely ruined our ability to focus,",
        "because short videos deliver instant gratification.",
        "As a result,",
        "a teenager's natural Attention span is completely shattered by constantly scrolling through endless social media feeds.",
        "Consequently,",
        "reading a huge thick novel now feels incredibly tedious and boring to many young internet users."
      ],
      "q6": [
        "Q6: Is storytelling an essential part of preserving a culture's history?",
        "It is widely acknowledged that,",
        "vocal storytelling is absolutely essential,",
        "as it successfully guarantees the Preservation of local heritage.",
        "This means that,",
        "before written languages existed,",
        "tribal elders transferred vital survival wisdom through spoken poems.",
        "Therefore,",
        "verbal traditions beautifully keep ancient societal customs highly relevant and alive for the next generation."
      ]
    }
  },
  {
    "week": 16,
    "part_2": {
      "q1": [
        "Describe an occasion when many people laughed together.",
        "You should say: When it happened Where it happened Who you were with And explain why many people were laughing (or smiling) together.",
        "To begin with,",
        "I want to describe a highly memorable school trip,",
        "because it was truly a joyful experience.",
        "Actually,",
        "we were on a bus when our teacher suddenly decided to crack a joke.",
        "Initially,",
        "there was an awkward silence since nobody understood the punchline.",
        "However,",
        "he then made a completely hilarious face that was surprisingly captivating.",
        "Consequently,",
        "the entire class burst into laughter at the exact same time.",
        "I think,",
        "the positive energy was incredibly contagious among all the students.",
        "Ultimately,",
        "it proved that laughter is the best medicine,",
        "making it a very amusing memory."
      ],
      "q2": [
        "Describe a time you saw someone show their feelings very openly.",
        "You should say: Who this person was What happened to make them emotional How they expressed their feelings (laughing,",
        "crying,",
        "etc.",
        ") And explain how you felt witnessing this.",
        "Honestly,",
        "I want to describe a touching moment I witnessed during a local singing competition last summer.",
        "To begin with,",
        "a young girl had just finished performing a beautiful song on the main stage.",
        "When the judges announced that she had won first place,",
        "she instantly started crying tears of absolute joy.",
        "I think,",
        "seeing her openly express such raw emotion was incredibly moving for everyone in the audience.",
        "Furthermore,",
        "she hugged her proud parents tightly and thanked them for their endless support.",
        "Ultimately,",
        "witnessing this genuine display made me feel immensely happy for her hard-earned success."
      ],
      "q3": [
        "Describe a comedy movie or live performance that made you laugh.",
        "You should say: What it was Who the actors were What the funniest part was And explain why it was memorable.",
        "I clearly remember,",
        "watching a fantastic comedy performance at a small local theater downtown two months ago.",
        "Actually,",
        "the main actor was a famous comedian who told silly stories about his crazy childhood experiences.",
        "I think,",
        "the funniest part was when he imitated his angry grandfather trying to use a modern smartphone.",
        "Basically,",
        "his facial expressions and dramatic body language were absolutely perfect and highly entertaining.",
        "Furthermore,",
        "the entire crowd was laughing constantly from the beginning to the very end.",
        "In the end,",
        "it was memorable because it helped me forget about my stressful school exams."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do people laugh in their daily lives?",
        "Generally speaking,",
        "people laugh daily because humor is a Universal human mechanism for safely coping with stress.",
        "This is because,",
        "sharing a clever joke strongly promotes deep emotional Bonding between hardworking colleagues and close friends.",
        "For instance,",
        "individuals with a warm Sense of humor frequently use laughter to navigate awkward situations easily."
      ],
      "q2": [
        "Q2: Why do people smile when they take photos?",
        "Is it a genuine smile or a fake one?",
        "In my view,",
        "smiling for photos is often a forced social expectation rather than a completely genuine psychological reaction.",
        "The primary reason is that,",
        "cultural norms demand us to clearly look Expressive and incredibly happy in captured memories.",
        "As an illustration,",
        "many people will painfully Keep a straight face until the camera actually flashes,",
        "instantly faking sudden joy."
      ],
      "q3": [
        "Q3: Should we express our emotions immediately or hide them?",
        "Without a doubt,",
        "balancing our emotions is crucial,",
        "because constant emotional Suppression leads to severe mental health issues.",
        "This is largely due to the fact that,",
        "strictly hiding deep anger creates massive Psychological burdens over extended periods.",
        "However,",
        "one should not always broadly Wear one's heart on one's sleeve during highly formal business meetings."
      ],
      "q4": [
        "Q4: Regarding showing emotions,",
        "are there any differences between women and men?",
        "Admittedly,",
        "society historically conditions young men to strictly hide sadness,",
        "whereas women are generally allowed to be highly expressive.",
        "The core issue is that,",
        "toxic traditional gender roles actively discourage men from seeking essential emotional support or displaying vulnerability.",
        "Consequently,",
        "modern progressive education heavily focuses on significantly improving emotional Literacy among young boys to safely prevent depression."
      ],
      "q5": [
        "Q5: Is humor an essential tool for effective leadership in the workplace?",
        "Undeniably,",
        "workplace humor is a vital leadership trait,",
        "as it dramatically improves the overall Accessibility of a busy manager.",
        "This means that,",
        "exhausted employees feel significantly more comfortable sharing highly innovative ideas with a friendly boss who occasionally jokes.",
        "Therefore,",
        "appropriate office banter effectively reduces tension and steadily increases daily team productivity levels."
      ],
      "q6": [
        "Q6: How does cultural background influence what people find funny?",
        "It is widely acknowledged that,",
        "cultural heritage entirely shapes comedy,",
        "because most jokes heavily rely on shared historical context.",
        "This is necessary since,",
        "a clever linguistic pun frequently makes absolutely no logical sense when literally translated abroad.",
        "For instance,",
        "dry British sarcasm might tragically seem extremely rude to someone from a more formal Eastern background."
      ]
    }
  },
  {
    "week": 17,
    "part_2": {
      "q1": [
        "Describe a friend you have known for a long time.",
        "You should say: Where you met this friend When you met this friend What he/she is like And explain why you have remained friends for so long.",
        "To begin with,",
        "I want to describe my best friend,",
        "whom I have known since childhood,",
        "because we are totally inseparable.",
        "Actually,",
        "we first met in primary school and managed to hit it off immediately.",
        "I think,",
        "he is an incredibly considerate and highly supportive person.",
        "For example,",
        "he always tells hilarious jokes to ensure I have a joyful day.",
        "Even though many old friends naturally drift apart,",
        "our intimate bond remains wonderfully strong.",
        "To be honest,",
        "we have stayed closely together through thick and thin over the years.",
        "Ultimately,",
        "I deeply value our long-lasting relationship."
      ],
      "q2": [
        "Describe a friend who has played an important role in your life.",
        "You should say: Who they are How they helped or influenced you What you admire about them And explain why they are important to you.",
        "Honestly,",
        "I want to talk about a university classmate who genuinely played a massive role in shaping my career.",
        "To begin with,",
        "she was a highly ambitious student who always encouraged me to push beyond my personal limits.",
        "During our final year,",
        "she actively helped me prepare for numerous difficult job interviews by practicing daily.",
        "I think,",
        "I admire her most for her incredible patience and her unwavering dedication to achieving her goals.",
        "Ultimately,",
        "she is incredibly important to me because her wise guidance helped me secure my current dream job."
      ],
      "q3": [
        "Describe a friend who is talented at music or singing.",
        "You should say: Who they are What instrument they play or how they sing When you listen to them And explain how you feel when you hear them perform.",
        "I clearly remember,",
        "meeting a truly gifted friend who is absolutely fantastic at playing the acoustic guitar.",
        "Actually,",
        "we became friends at a local music club where he performs live shows every single weekend.",
        "Whenever I listen to him play,",
        "he easily creates a wonderfully relaxing atmosphere with his smooth melodies.",
        "I believe,",
        "his immense musical talent completely captivates the entire audience,",
        "making everyone feel peaceful and deeply emotional.",
        "In the end,",
        "hearing him perform live always leaves me feeling inspired and incredibly proud to call him my close friend."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What is the difference between friendships at work and those outside of work?",
        "Generally speaking,",
        "workplace relationships are often strictly professional,",
        "whereas outside friendships offer genuine emotional Companionship.",
        "This is because,",
        "a standard Colleague might just be a shallow Fair-weather friend who disappears when office projects fail.",
        "For instance,",
        "daily workplace Interaction is usually slightly Superficial compared to the deep bonds built with lifelong childhood peers."
      ],
      "q2": [
        "Q2: At what age do you think people start to have friendships?",
        "In my view,",
        "people broadly form basic friendships during early kindergarten,",
        "as toddlers naturally seek playmates to share toys.",
        "The primary reason is that,",
        "constantly seeking social connection is a completely Universal trait built into human biology.",
        "As an illustration,",
        "these early connections strongly aid essential Psychological development,",
        "even if the kids rarely See eye to eye."
      ],
      "q3": [
        "Q3: Do you think music is beneficial for children at school?",
        "Without a doubt,",
        "music is highly beneficial,",
        "because it significantly enhances memory and radically boosts creative problem-solving skills.",
        "This is crucial since,",
        "safely learning instruments requires intense discipline and steadily builds strong teamwork during group performances.",
        "Therefore,",
        "happily playing in a school band completely fosters true Lifelong friendships,",
        "proving that A friend in need is a friend indeed when practicing tough songs."
      ],
      "q4": [
        "Q4: Do you think a child's relationship with friends can be replaced by that with parents?",
        "Admittedly,",
        "strict parents provide essential physical safety,",
        "but they absolutely cannot entirely replace the unique equality found in peer friendships.",
        "The core issue is that,",
        "an inherent hierarchical power dynamic heavily exists between a demanding mother and a growing child.",
        "Consequently,",
        "anxious kids desperately need close friends of their own exact age to discuss private teenage secrets completely freely."
      ],
      "q5": [
        "Q5: Has social media changed the definition of \"friendship\" in modern society?",
        "Undeniably,",
        "online social networks have cheaply altered friendship,",
        "as naive people now wrongly equate mere digital followers with actual true friends.",
        "As lonely individuals constantly scroll online,",
        "they wildly prioritize collecting superficial internet likes rather than securely building profound offline relationships.",
        "For example,",
        "a depressed teenager might easily have thousands of virtual contacts but still feel devastatingly isolated in real life."
      ],
      "q6": [
        "Q6: Is it possible to maintain a lifelong friendship despite living in different countries?",
        "It is widely acknowledged that,",
        "vast long-distance friendships can survive beautifully,",
        "provided both parties put in continuous mutual effort.",
        "This practically means that,",
        "advanced communication technologies like video calling remarkably make maintaining daily emotional contact incredibly convenient globally.",
        "For instance,",
        "separated best friends will eagerly schedule weekly online chats to consistently share their ongoing personal lifestyle updates."
      ]
    }
  },
  {
    "week": 18,
    "part_2": {
      "q1": [
        "Describe your favorite place in your house where you can relax.",
        "You should say: Where it is What it is like What you enjoy doing there And explain why you feel relaxed at this place.",
        "To begin with,",
        "I want to confidently talk about my bedroom,",
        "which is incredibly cozy,",
        "because I can easily relax there.",
        "Actually,",
        "it is quite spacious and beautifully decorated with my favorite colorful posters.",
        "I think,",
        "the highly modern furniture makes it the perfect absolutely intimate sanctuary.",
        "Even when my desk gets slightly messy,",
        "I still consider it my ultimate home sweet home.",
        "Whenever my friends visit,",
        "I cheerfully encourage them to truly make oneself at home.",
        "Ultimately,",
        "this highly supportive environment fully gives me the essential peace and quiet I desperately need."
      ],
      "q2": [
        "Describe a house or apartment you would like to live in.",
        "You should say: Where it would be located How big it would be How you would decorate it And explain why this is your dream home.",
        "Honestly,",
        "I would absolutely love to live in a beautiful,",
        "high-rise apartment overlooking the vast ocean.",
        "To begin with,",
        "it would be located right on the stunning coastline of a very quiet,",
        "peaceful city.",
        "I think,",
        "it should be large enough to easily fit a small personal library and a bright painting studio.",
        "Furthermore,",
        "I would creatively decorate it using minimalist white furniture and numerous fresh green indoor plants.",
        "In the end,",
        "this is my ultimate dream home because hearing the calming ocean waves would heavily reduce my daily stress."
      ],
      "q3": [
        "Describe a home you visited that you liked.",
        "You should say: Whose home it was Where it was located What the decoration was like And explain what made it impressive.",
        "I clearly remember,",
        "visiting my wealthy uncle's massive house in the quiet countryside during the recent summer holidays.",
        "Actually,",
        "the beautiful home was perfectly located completely surrounded by dense green forests and a sparkling blue river.",
        "I believe,",
        "the interior decoration was highly impressive because it strongly featured classic wooden furniture and gorgeous antique oil paintings.",
        "Moreover,",
        "the massive kitchen felt incredibly warm and intensely welcoming for the entire extended family.",
        "Ultimately,",
        "what made it deeply impressive was the peaceful,",
        "slow-paced lifestyle it offered far away from the noisy city traffic."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why is it difficult for some people to relax?",
        "Generally speaking,",
        "relaxing is incredibly difficult,",
        "because modern Urban life is intensely competitive and highly demanding mentally.",
        "This is because,",
        "outrageously heavy workloads and severe financial pressure leave adults in a constant state of deep anxiety.",
        "For instance,",
        "helplessly struggling to safely secure basic Affordability for housing strongly prevents workers from genuinely enjoying their brief weekend downtime."
      ],
      "q2": [
        "Q2: Which is more important,",
        "mental relaxation or physical relaxation?",
        "In my view,",
        "deep mental relaxation is slightly more critical,",
        "as terrible psychological burnout completely drains all bodily energy rapidly.",
        "The primary reason is that,",
        "quietly resting on a soft sofa is utterly useless if your mind is heavily panicked.",
        "As an illustration,",
        "gently practicing mindful meditation securely provides much deeper emotional relief than just vaguely Superficial physical resting like sleeping all day."
      ],
      "q3": [
        "Q3: Why do people prefer to live in new houses?",
        "Without a doubt,",
        "newly built properties are highly desirable,",
        "because they require vastly less stressful structural maintenance overall.",
        "This is largely due to the fact that,",
        "modern apartment constructions brilliantly feature excellent smart technology and highly efficient heating systems.",
        "For example,",
        "a shiny brand new condo smoothly serves as a brilliant long-term financial Investment without hidden expensive plumbing repair costs."
      ],
      "q4": [
        "Q4: How has the \"Work From Home\" trend changed the way people design their houses?",
        "Admittedly,",
        "remote working has totally revolutionized modern home design,",
        "as completely dedicated quiet office spaces are now entirely essential.",
        "Furthermore,",
        "tired citizens increasingly prioritize heavily having strong structural soundproofing and exceptionally large windows to drastically improve their daily focus.",
        "Consequently,",
        "a simple suburban bedroom must now simultaneously function beautifully as a strict professional environment and a relaxing sanctuary."
      ],
      "q5": [
        "Q5: What are the social consequences of housing shortages in major cities?",
        "Unfortunately,",
        "an extreme modern housing Shortage causes massive societal inequality,",
        "because urban property prices inevitably completely Go through the roof.",
        "The core issue is that,",
        "passionate young university graduates are completely priced out,",
        "abruptly destroying their Lifelong dreams of urban stability.",
        "Therefore,",
        "failing to successfully help local youth quickly Get on the property ladder leads to widespread anger and plummeting birth rates."
      ],
      "q6": [
        "Q6: Should the government regulate housing prices to ensure everyone has a place to live?",
        "It is widely acknowledged that,",
        "strict state market Regulation is absolutely required,",
        "because securing a basic home is a fundamental human right.",
        "This is necessary since,",
        "completely uncontrolled greedy corporate landlords will absolutely exploit highly vulnerable citizens for maximum pure financial profit.",
        "For instance,",
        "legally implementing fair rent control policies beautifully ensures that low-income tired workers can always safely afford A roof over one's head."
      ]
    }
  },
  {
    "week": 19,
    "part_2": {
      "q1": [
        "Describe something that you can't live without (not a computer/phone).",
        "You should say: What it is What you do with it How it helps you in your life And explain why you can't live without it.",
        "To begin with,",
        "I definitely cannot live without my camera,",
        "which is a highly valuable tool,",
        "because I heavily love photography.",
        "Actually,",
        "it is a slightly fragile,",
        "beautifully decorated antique model from my late grandfather.",
        "Whenever I look at it,",
        "it is a deeply emotional blast from the past.",
        "I think,",
        "this perfectly irreplaceable item possesses immense pure sentimental worth.",
        "For example,",
        "my extended family decided to carefully pass down this heirloom strictly to me.",
        "To be honest,",
        "I fiercely hold dear the uniquely cozy memories it constantly captures.",
        "Ultimately,",
        "it strongly connects me directly to my rich family history."
      ],
      "q2": [
        "Describe an old object that your family has kept for a long time.",
        "You should say: What the object is How long your family has had it Who it belonged to originally And explain why it is important to your family history.",
        "Honestly,",
        "I want to describe an incredibly beautiful wooden dining table that my family has safely kept for decades.",
        "To begin with,",
        "my great-grandfather originally carved it entirely by hand when he first bought our old farmhouse.",
        "For as long as I can remember,",
        "we have eaten every single grand festival dinner around it.",
        "I think,",
        "it is extremely important to our family history because it strongly represents our unshakeable unity and shared love.",
        "Furthermore,",
        "the thick solid wood has survived countless generations without ever breaking.",
        "In the end,",
        "I hope to carefully keep it forever."
      ],
      "q3": [
        "Describe a gift you received that you treasure.",
        "You should say: What the gift is Who gave it to you On what occasion you received it And explain why it is special to you.",
        "I clearly remember,",
        "enthusiastically receiving a gorgeous leather notebook that I absolutely treasure far above everything else.",
        "Actually,",
        "my caring best friend kindly gave it to me as a thoughtful present for my eighteenth birthday celebration.",
        "I genuinely love it because I desperately needed a highly safe place to eagerly write down my personal poetry.",
        "I believe,",
        "it is incredibly special to me because she specifically engraved my initials beautifully onto the front cover.",
        "Moreover,",
        "the thick expensive paper inside feels extremely luxurious whenever I write.",
        "Ultimately,",
        "I will treasure this lovely gift forever."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do some grown-ups hate to throw out old things?",
        "Generally speaking,",
        "older adults fiercely keep old items,",
        "because these physical objects constantly trigger deep feelings of warm Nostalgia.",
        "This is because,",
        "an aging person will Accumulate countless precious memories perfectly tied to specific personal historical belongings.",
        "For instance,",
        "a dusty broken armchair might strongly seem useless to youth,",
        "but truly One man's trash is another man's treasure to lonely grandparents."
      ],
      "q2": [
        "Q2: What do you think influences people to buy new things?",
        "In my view,",
        "clever social media advertising heavily influences modern society,",
        "as it constantly loudly promotes a greedy Materialistic lifestyle.",
        "The primary reason is that,",
        "massive greedy corporations intentionally create an artificial sense of daily urgency to massively boost retail sales.",
        "As an illustration,",
        "toxic modern peer pressure strongly forces young teenagers to foolishly buy the newest smart devices simply to desperately look wealthy."
      ],
      "q3": [
        "Q3: Do young people appreciate antiques and old things as much as older people?",
        "Undeniably,",
        "the modern younger generation strongly prefers shiny new gadgets,",
        "whereas wise seniors truly deeply respect historical cultural artifacts.",
        "This is largely due to the fact that,",
        "busy young minds vastly prioritize immediate digital convenience entirely over long-term physical historical preservation.",
        "Consequently,",
        "only a highly rare few educated teenagers successfully view a vintage mechanical watch as a genuinely wise financial Investment."
      ],
      "q4": [
        "Q4: Why do people like to go to museums to see old objects?",
        "Admittedly,",
        "curious citizens eagerly visit grand museums to rapidly escape daily stress,",
        "because quietly viewing ancient tools satisfies deep human curiosity.",
        "The core issue is that,",
        "closely observing exactly how our strong ancestors creatively survived physically grounds us heavily in a chaotic modern world.",
        "Therefore,",
        "people happily eagerly pay the easy Affordability of a remarkably cheap ticket to properly educate their young children on local history."
      ],
      "q5": [
        "Q5: Is the culture of consumerism (buying things for pleasure) sustainable for the planet?",
        "Without a doubt,",
        "extreme Consumerism is utterly catastrophic,",
        "as it rapidly fatally depletes Earth's highly finite global natural resources.",
        "This is primarily since,",
        "the deeply blind pursuit of endless cheap luxury goods completely destroys all realistic hopes for global environmental Sustainability.",
        "For example,",
        "aggressively producing billions of cheap plastic toys unfortunately turns the entire developing world into a highly toxic Throwaway society."
      ],
      "q6": [
        "Q6: Does the \"planned obsolescence\" of products (products designed to break) harm society?",
        "It is widely acknowledged that,",
        "intentionally secretly breaking products heavily harms society,",
        "because it economically ruthlessly punishes poor struggling families.",
        "This essentially means that,",
        "deeply greedy tech companies actively force loyal consumers to act exactly like a desperate trapped Hoarder of useless broken chargers.",
        "For instance,",
        "purposely designing smartphones that deliberately legally slow down after two years causes massive financial stress and terrible electronic toxic waste."
      ]
    }
  },
  {
    "week": 20,
    "part_2": {
      "q1": [
        "Describe a long journey you want to enjoy again.",
        "You should say: When you took the journey Where you went Who you were with And explain why you want to go again.",
        "To begin with,",
        "I want to describe a scenic train trip I took to Yunnan,",
        "which was completely spontaneous,",
        "because I needed a break.",
        "Honestly,",
        "it was quite a bumpy ride since the train was delayed by rain.",
        "However,",
        "I decided to travel light so carrying my bags wasn't exhausting.",
        "Furthermore,",
        "I felt very adventurous exploring the local villages.",
        "In retrospect,",
        "it was a deeply sentimental experience for me.",
        "Ultimately,",
        "I gained some valuable memories,",
        "and I would love to hit the road and do it again."
      ],
      "q2": [
        "Describe a bicycle,",
        "motorcycle,",
        "or car trip you would like to go on.",
        "You should say: Who you would like to go with Where you would like to go Which vehicle you would choose And explain why you would like to travel this way.",
        "First of all,",
        "I would love to go on a motorcycle trip across the country.",
        "Honestly,",
        "I would invite my best friend to join me because we share the same passion for riding.",
        "Obviously,",
        "we would choose powerful touring motorcycles to handle the long distances comfortably.",
        "Furthermore,",
        "we would travel along the famous coastal highway to see the beautiful ocean views.",
        "Frankly,",
        "I want to travel this way because it feels incredibly free and exciting.",
        "Finally,",
        "feeling the wind while riding is an unforgettable experience that you just cannot get inside a regular car."
      ],
      "q3": [
        "Describe a time your travel plans were delayed or changed.",
        "You should say: Where you were going What caused the delay What you did while waiting And explain how you felt about the change in plans.",
        "To start off,",
        "I remember a time when my flight to Beijing was severely delayed.",
        "Unfortunately,",
        "there was a massive snowstorm that closed the entire airport.",
        "Consequently,",
        "I had to wait in the terminal for over eight hours.",
        "Meanwhile,",
        "I spent the time reading a novel and chatting with other stranded passengers.",
        "Truthfully,",
        "I felt extremely frustrated at first because I was missing an important dinner.",
        "Eventually,",
        "I realized it was out of my control and managed to calm down.",
        "Looking back,",
        "it taught me a lot about patience and staying positive."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Who prefers long journeys,",
        "young people or old people?",
        "Generally speaking,",
        "young people prefer long journeys,",
        "whereas older individuals usually avoid them.",
        "To explain,",
        "the youth have more energy for eco-tourism and care less about their carbon footprint when traveling far.",
        "For instance,",
        "many university students take month-long backpacking trips across different continents."
      ],
      "q2": [
        "Q2: What do people prepare before a journey?",
        "Undoubtedly,",
        "travelers pack essential items,",
        "and they also plan their itineraries carefully.",
        "This is because,",
        "thorough preparation helps them avoid the stressful hustle and bustle of navigating unfamiliar and crowded places.",
        "For example,",
        "booking hotels and researching local transit routes in advance ensures a much smoother trip."
      ],
      "q3": [
        "Q3: Why do people prefer traveling in their own countries rather than foreign countries?",
        "In my view,",
        "domestic travel is much cheaper,",
        "and it avoids language barriers.",
        "Specifically,",
        "people do not want a long commute or to deal with massive airport congestion during short holidays.",
        "As an illustration,",
        "driving to a nearby province is significantly easier than flying internationally."
      ],
      "q4": [
        "Q4: Do you think air pollution comes mostly from mobile vehicles?",
        "To a certain extent,",
        "cars are a major source,",
        "but factories contribute heavily too.",
        "Evidently,",
        "industrial exhaust and vehicular emission both accumulate in the atmosphere to cause severe smog.",
        "For instance,",
        "many manufacturing hubs have noticeably worse air quality than busy urban centers."
      ],
      "q5": [
        "Q5: Do you think people need to change the way of transportation drastically to protect the environment?",
        "Absolutely,",
        "a significant shift is required if we want to save our planet.",
        "Fundamentally,",
        "our current reliance on fossil fuels completely undermines long-term environmental sustainability.",
        "Therefore,",
        "switching globally to electric trains or hydrogen-powered buses will dramatically lower harmful pollution levels."
      ],
      "q6": [
        "Q6: Has the ability to travel cheaply (budget airlines) changed how people view the world?",
        "Certainly,",
        "budget travel has broadened perspectives,",
        "since more people can explore internationally.",
        "Consequently,",
        "average citizens can escape the daily rush hour to experience foreign cultures firsthand.",
        "For example,",
        "affordable flights allow students to witness global diversity,",
        "making them much more tolerant."
      ]
    }
  },
  {
    "week": 21,
    "part_2": {
      "q1": [
        "Describe a creative person whose work you admire (e.",
        "g.,",
        "artist or musician).",
        "You should say: Who this person is How you knew him/her What creative work he/she does And explain why you admire him/her.",
        "To begin with,",
        "I want to talk about an innovative musician I admire,",
        "who is extremely dedicated,",
        "and whose music is incredible.",
        "Honestly,",
        "he is completely versatile,",
        "playing multiple instruments flawlessly.",
        "Furthermore,",
        "he wasn't born with a silver spoon,",
        "but worked hard for his success.",
        "Sometimes,",
        "his performances are highly spontaneous.",
        "Moreover,",
        "he can think on his feet when a guitar string breaks.",
        "Truly,",
        "he is an exceptional talent and a true visionary.",
        "Additionally,",
        "his adventurous spirit makes him a natural on stage."
      ],
      "q2": [
        "Describe a person who has a natural talent (e.",
        "g.,",
        "for sports,",
        "music,",
        "or math).",
        "You should say: Who the person is What talent they possess When you discovered this talent And explain whether you think they use this talent well.",
        "To begin with,",
        "I would like to describe my younger cousin who has an incredible natural talent for mathematics.",
        "Honestly,",
        "he is only ten years old,",
        "but he can solve high school calculus problems effortlessly.",
        "Actually,",
        "I first discovered this talent when I was struggling with my own homework,",
        "and he pointed out the solution.",
        "Surprisingly,",
        "his brain just processes numbers in a completely different way.",
        "Ultimately,",
        "I believe he uses his talent exceptionally well because he tutors other children.",
        "Looking ahead,",
        "I am certain he will achieve great things in the scientific field."
      ],
      "q3": [
        "Describe a person who solved a problem in a clever way.",
        "You should say: Who the person is What the problem was How they solved it And explain why you think their solution was intelligent.",
        "First and foremost,",
        "I want to talk about my father,",
        "who is incredibly resourceful at fixing things around the house.",
        "Recently,",
        "our kitchen sink was completely blocked,",
        "and the plumber was unavailable.",
        "Suddenly,",
        "my dad decided to use a combination of baking soda and a modified wire hanger to clear the pipe.",
        "Amazingly,",
        "it worked perfectly within just a few minutes.",
        "Frankly,",
        "I thought his solution was highly intelligent because it saved us both time and money.",
        "Furthermore,",
        "it demonstrated how practical everyday knowledge can easily overcome seemingly difficult household emergencies."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: How can we know if a child has talent or not?",
        "Essentially,",
        "parents can spot talent early,",
        "especially when children show innate skills.",
        "Specifically,",
        "a child might naturally excel at tasks without needing intense preparation.",
        "For example,",
        "a brainy toddler who solves complex puzzles easily demonstrates high intellectual potential."
      ],
      "q2": [
        "Q2: Is it a waste of time if people don't use their talents?",
        "Honestly,",
        "it is a tragic loss,",
        "because society misses out on their gifts.",
        "Therefore,",
        "if we do not nurture our abilities,",
        "we fail to contribute meaningfully.",
        "For instance,",
        "a musical genius who ignores their gift limits their own creative emission into the world."
      ],
      "q3": [
        "Q3: Are children born smart,",
        "or do they become smart through learning?",
        "In reality,",
        "it is a combination,",
        "since both genetics and environment matter.",
        "Certainly,",
        "natural intelligence exists,",
        "but education refines it because practice makes perfect.",
        "As an example,",
        "rigorous academic training can make an average student highly successful over time."
      ],
      "q4": [
        "Q4: Is being intelligent always a good thing?",
        "Are there limitations?",
        "Admittedly,",
        "high intellect is beneficial,",
        "yet it can cause social isolation.",
        "Frequently,",
        "brilliant individuals focus on one niche instead of being a jack of all trades,",
        "causing them to struggle socially.",
        "For example,",
        "a math prodigy might feel completely misunderstood by regular classmates."
      ],
      "q5": [
        "Q5: Do you think the education system stifles creativity by focusing too much on academic scores?",
        "Absolutely,",
        "strict testing restricts imagination,",
        "and it limits independent thought.",
        "Consequently,",
        "schools reward memorization rather than original problem-solving skills.",
        "For instance,",
        "art and music programs are often canceled to make more time for standardized test preparation."
      ],
      "q6": [
        "Q6: Can creativity be learned,",
        "or is it an innate quality?",
        "Personally,",
        "I believe it can be developed,",
        "although some have natural inclinations.",
        "Fundamentally,",
        "being exposed to diverse experiences teaches the brain to form new connections.",
        "For example,",
        "taking painting classes can unlock a person's hidden artistic abilities over time."
      ]
    }
  },
  {
    "week": 22,
    "part_2": {
      "q1": [
        "Describe a person you know who works in a family business.",
        "(Examiner Note: Focus your description on the business place itself) You should say: Who he/she is What the business is (e.",
        "g.,",
        "store/restaurant) What products it sells And explain what you have learned from observing this business.",
        "First of all,",
        "I want to describe a diligent baker I know,",
        "who is highly entrepreneurial,",
        "and who owns a great shop.",
        "Essentially,",
        "his bakery is a traditional mom and pop store.",
        "Currently,",
        "his aging father continues to run the show.",
        "However,",
        "they plan to pass the torch to him soon.",
        "Honestly,",
        "they sell authentic sourdough bread that is universally loved.",
        "Furthermore,",
        "their business is extremely prosperous due to their hard work.",
        "Overall,",
        "they are a very reputable and dedicated family,",
        "providing exceptional service."
      ],
      "q2": [
        "Describe a successful small shop or business in your hometown.",
        "You should say: Where it is located What it sells Who goes there And explain why it is successful.",
        "To start off,",
        "I want to describe a highly successful local coffee shop located right in the center of my hometown.",
        "Truthfully,",
        "it sells the most amazing hand-crafted espresso and freshly baked pastries.",
        "Generally,",
        "it attracts a huge crowd of university students and young professionals every single morning.",
        "Primarily,",
        "I believe it is so successful because the owner treats every customer like a close friend.",
        "Moreover,",
        "the cozy atmosphere makes it the perfect place to study or relax.",
        "Ultimately,",
        "their dedication to quality ingredients sets them apart from the larger chain cafes."
      ],
      "q3": [
        "Describe a business or company you would like to work for.",
        "You should say: Where it is located What the environment is like What the company does And explain why you want to work there.",
        "First of all,",
        "I would absolutely love to work for a leading electric vehicle manufacturer like Tesla or BYD.",
        "Specifically,",
        "their main headquarters are located in major tech hubs,",
        "offering a dynamic environment.",
        "From what I understand,",
        "the workplace culture is highly innovative and encourages creative problem-solving.",
        "Honestly,",
        "I want to work there because I am deeply passionate about sustainable technology.",
        "Furthermore,",
        "being part of a team that designs future transportation would be incredibly rewarding.",
        "Finally,",
        "it would provide excellent career growth opportunities within a rapidly expanding global industry."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Would you like to start a family business?",
        "Personally,",
        "I would avoid it,",
        "because mixing family and work is stressful.",
        "Specifically,",
        "managing a startup requires intense focus that can easily damage personal relationships.",
        "For example,",
        "arguments over financial decisions might cause a family to go out of business."
      ],
      "q2": [
        "Q2: What are the advantages and disadvantages of family businesses?",
        "Generally,",
        "they offer deep trust,",
        "yet they often lack professional management.",
        "Undoubtedly,",
        "competition is fierce,",
        "and relatives may not have the innate skills to survive.",
        "For instance,",
        "a small family shop might lose out to a larger,",
        "more efficient corporation."
      ],
      "q3": [
        "Q3: Why do young people start their own business?",
        "Mainly,",
        "they desire independence,",
        "and they want to pursue their passions.",
        "Furthermore,",
        "the modern economy offers immense potential for innovative ideas to succeed quickly.",
        "As an illustration,",
        "many tech graduates create software apps to become their own bosses."
      ],
      "q4": [
        "Q4: How do large international corporations impact local family-owned businesses?",
        "Sadly,",
        "they often destroy local shops,",
        "as they offer much lower prices.",
        "Essentially,",
        "it is a cut-throat environment where big fish eat little fish.",
        "For example,",
        "a giant supermarket opening nearby usually bankrupts small neighborhood grocery stores."
      ],
      "q5": [
        "Q5: Is it better for a city's economy to have many small shops or a few large shopping malls?",
        "In my opinion,",
        "diverse small shops are better,",
        "because they distribute wealth evenly.",
        "Conversely,",
        "a monopoly by massive malls removes character from the city streets.",
        "Therefore,",
        "supporting local vendors keeps the community vibrant and financially stable."
      ],
      "q6": [
        "Q6: How has the rise of online shopping changed the physical landscape of city centers?",
        "Noticeably,",
        "many physical stores have closed down,",
        "and streets look emptier.",
        "As a result,",
        "high retail rents force traditional brands to move entirely to e-commerce platforms.",
        "For instance,",
        "former shopping districts are now being converted into residential apartments or cafes."
      ]
    }
  },
  {
    "week": 23,
    "part_2": {
      "q1": [
        "Describe a toy that you loved in your childhood.",
        "You should say: What the toy was Who gave it to you How often you played with it And explain why it was so special to you.",
        "To begin with,",
        "I will describe my wooden train set,",
        "which was highly educational,",
        "and which kept me busy.",
        "Honestly,",
        "looking at it now takes me on a trip down memory lane.",
        "Furthermore,",
        "it made me feel very imaginative as a kid.",
        "Actually,",
        "the wood was incredibly durable,",
        "so it never broke.",
        "Consequently,",
        "it became my absolute pride and joy.",
        "Moreover,",
        "it reminds me of my prosperous and happy childhood.",
        "Overall,",
        "this authentic memory is very precious to me.",
        "Finally,",
        "playing with it was simple child's play,",
        "making me feel deeply nostalgic today."
      ],
      "q2": [
        "Describe a game (indoor or outdoor) you played when you were a child.",
        "You should say: What the game was Who you played it with Where you played it And explain why you enjoyed it.",
        "To begin with,",
        "I want to talk about a classic game of hide-and-seek that I played constantly during my childhood.",
        "Usually,",
        "I played it with my younger brother and the neighborhood kids after school.",
        "Mostly,",
        "we utilized the large local park because it had countless trees and bushes to hide behind.",
        "Frankly,",
        "I enjoyed it immensely because the thrill of hiding in silence was incredibly exciting.",
        "Additionally,",
        "it was a fantastic way to stay active and run around outside.",
        "Looking back,",
        "those carefree afternoons remain some of my fondest early memories."
      ],
      "q3": [
        "Describe a toy or game that is popular with children today.",
        "You should say: What it is Why it is popular Whether you think it is good for children And explain how it compares to toys from your childhood.",
        "First and foremost,",
        "I will describe the digital building game Minecraft,",
        "which is massively popular with kids today.",
        "Essentially,",
        "it allows players to construct entire virtual worlds using pixelated blocks.",
        "Clearly,",
        "it is popular because it offers unlimited creative freedom and fun multiplayer modes.",
        "Personally,",
        "I think it is great for children because it enhances their spatial awareness and problem-solving skills.",
        "Compared to the simple plastic toys from my own childhood,",
        "this game is far more complex and interactive.",
        "Ultimately,",
        "it reflects how modern entertainment relies heavily on advanced digital technology."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Do boys and girls prefer different kinds of toys?",
        "Traditionally,",
        "yes,",
        "but modern parents are encouraging more gender-neutral options.",
        "Historically,",
        "society pushed dolls for girls and action figures for boys to shape their early socialization.",
        "Today,",
        "educational building blocks are equally popular for both genders' development."
      ],
      "q2": [
        "Q2: How do toys that were popular in the past compare with toys that are popular now?",
        "Undeniably,",
        "older toys were simpler,",
        "while modern toys are highly digital.",
        "Consequently,",
        "classic wooden toys required more physical interaction compared to today’s screen-based games.",
        "For example,",
        "playing board games demands more face-to-face communication than solitary mobile applications."
      ],
      "q3": [
        "Q3: What should people consider when choosing a toy for a child?",
        "Primarily,",
        "safety is crucial,",
        "but educational value is also highly important.",
        "Specifically,",
        "a good toy should stimulate cognitive growth and spark creativity.",
        "For instance,",
        "puzzles are excellent because they teach children how to play by the rules safely."
      ],
      "q4": [
        "Q4: Should kids be permitted to pick their own toys at a toy store?",
        "Occasionally,",
        "it is fine,",
        "provided parents set a strict budget beforehand.",
        "Otherwise,",
        "children might become a spoiled brat if they always get whatever they demand.",
        "As an illustration,",
        "allowing them to choose a small reward teaches them about the economy."
      ],
      "q5": [
        "Q5: Do educational toys really help children become smarter?",
        "Absolutely,",
        "they provide a strong foundation,",
        "though they cannot replace parenting.",
        "In fact,",
        "toys that challenge the brain can give kids an edge in future competition.",
        "For example,",
        "learning robotics early on develops critical thinking and spatial awareness."
      ],
      "q6": [
        "Q6: Is it harmful for children to own too many toys?",
        "Definitely,",
        "an excess of toys causes distraction,",
        "and it ruins appreciation.",
        "Ultimately,",
        "if parents wrap someone in cotton wool by buying everything,",
        "children lose focus.",
        "Therefore,",
        "having fewer items forces kids to be more resourceful and imaginative during playtime."
      ]
    }
  },
  {
    "week": 24,
    "part_2": {
      "q1": [
        "Describe a time when the electricity suddenly went off where you live.",
        "You should say: When it happened How long it lasted What you did during that time And explain how you felt about it.",
        "To begin with,",
        "I want to describe an unexpected power cut,",
        "which was highly inconvenient,",
        "and which left me completely in the dark.",
        "Honestly,",
        "I was trying to finish an urgent report for my boss.",
        "Suddenly,",
        "my computer shut down,",
        "making me feel totally frustrated.",
        "Furthermore,",
        "the elevator in my building was out of order.",
        "Consequently,",
        "I felt entirely helpless and trapped inside my apartment.",
        "Luckily,",
        "my laptop had a very durable battery.",
        "Ultimately,",
        "it managed to save the day so I could email the document.",
        "Overall,",
        "it taught me not to waste precious time."
      ],
      "q2": [
        "Describe an occasion when an important piece of equipment stopped working.",
        "You should say: What the equipment was When it happened How it affected you And explain how you solved the problem.",
        "To start off,",
        "I want to talk about a time when my washing machine suddenly broke down.",
        "Basically,",
        "I was preparing for a huge family holiday,",
        "and I needed clean clothes.",
        "Unfortunately,",
        "the machine started making a terrible noise before stopping completely.",
        "Consequently,",
        "my kitchen floor was flooded with soapy water.",
        "Honestly,",
        "it was a massive disaster that ruined my entire morning.",
        "Eventually,",
        "I had to call an expensive repairman to fix the broken pipe.",
        "Looking back,",
        "I felt incredibly stressed,",
        "but I was relieved when it finally worked again."
      ],
      "q3": [
        "Describe a time when you broke something by accident.",
        "You should say: What the item was How the accident happened How you felt immediately after And explain what you did to fix the situation.",
        "First and foremost,",
        "I will describe the terrible moment when I accidentally dropped my mother's favorite vase.",
        "Actually,",
        "I was cleaning the living room,",
        "and my hand simply slipped.",
        "Instantly,",
        "the beautiful glass shattered into a hundred pieces on the hard floor.",
        "Truthfully,",
        "I felt extremely guilty and terrified of her reaction.",
        "Therefore,",
        "I immediately swept up the mess and bought some strong glue to fix it.",
        "Unfortunately,",
        "the cracks were still very visible.",
        "Ultimately,",
        "I confessed the truth to her,",
        "and she was surprisingly understanding about the whole accident."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: When will equipment break normally?",
        "Why?",
        "Generally speaking,",
        "machines break after years of use,",
        "since they naturally degrade over time.",
        "Basically,",
        "constant daily friction causes unavoidable wear and tear on the internal mechanical parts.",
        "For example,",
        "a car engine will inevitably fail completely if the owner never changes the oil."
      ],
      "q2": [
        "Q2: Do people buy a new one when something is broken,",
        "or repair it?",
        "Nowadays,",
        "most people simply buy replacements,",
        "because modern gadgets are notoriously difficult to fix.",
        "Sadly,",
        "planned obsolescence has created a toxic throwaway culture globally.",
        "Consequently,",
        "throwing away a cracked smartphone and upgrading is often cheaper than paying for a professional repair."
      ],
      "q3": [
        "Q3: Which do you think is better for production: using machines or making things by hand?",
        "In my opinion,",
        "machines are far superior,",
        "as they ensure speed and absolute precision.",
        "Undoubtedly,",
        "automated manufacturing guarantees a much higher level of product reliability.",
        "For instance,",
        "modern robots in car factories can assemble complex parts flawlessly without ever getting tired."
      ],
      "q4": [
        "Q4: Does the place where you live often experience power cuts?",
        "Fortunately,",
        "blackouts are incredibly rare here,",
        "because the local power grid is highly advanced.",
        "Actually,",
        "due to rapid urban development,",
        "the government strictly maintains the electrical infrastructure.",
        "Therefore,",
        "they follow the rule of don't fix what isn't broken,",
        "avoiding unnecessary disruptions."
      ],
      "q5": [
        "Q5: Are modern societies too dependent on electricity and technology?",
        "Absolutely,",
        "we are entirely reliant on power,",
        "and our lives halt without it.",
        "Essentially,",
        "this massive dependency means that a simple power outage can shut down hospitals and banks.",
        "As a result,",
        "people cannot even buy food if the electronic payment systems crash."
      ],
      "q6": [
        "Q6: Is the \"throwaway culture\" (buying new instead of repairing) sustainable for the environment?",
        "Definitely not,",
        "it is highly destructive,",
        "since it generates massive amounts of electronic waste.",
        "Fundamentally,",
        "constant garbage disposal actively ruins global ecological sustainability.",
        "Instead,",
        "we must use our creativity to recycle old materials and protect our fragile planet."
      ]
    }
  },
  {
    "week": 25,
    "part_2": {
      "q1": [
        "Describe a time when you encouraged someone to do something that he/she didn't want to do.",
        "You should say: Who he or she is What you encouraged him/her to do How he/she reacted And explain why you encouraged him/her to do it.",
        "To begin with,",
        "I want to talk about my best friend,",
        "who felt completely frustrated,",
        "and who was incredibly reluctant to join a public speaking competition.",
        "Honestly,",
        "I knew this was an urgent opportunity for her growth.",
        "Therefore,",
        "I tried to be highly supportive and persuasive.",
        "Basically,",
        "I managed to talk her into joining the contest.",
        "Furthermore,",
        "I reminded her that two heads are better than one,",
        "offering to help her practice.",
        "Eventually,",
        "she decided to give it a shot.",
        "Ultimately,",
        "she realized it was a wise decision.",
        "Overall,",
        "she was deeply appreciative after winning third place."
      ],
      "q2": [
        "Describe an important decision you made with the help of others.",
        "You should say: What the decision was Who helped you make it Why you needed their help And explain how you felt about the result.",
        "First of all,",
        "I want to discuss the time I chose my university major.",
        "Initially,",
        "I was completely torn between studying literature or computer science.",
        "Honestly,",
        "I asked my parents and my favorite teacher for their advice.",
        "Consequently,",
        "we sat down and discussed my future career prospects for hours.",
        "Furthermore,",
        "they highlighted my strengths in logical thinking and coding.",
        "Ultimately,",
        "their valuable insights guided me to choose computer science.",
        "Looking back,",
        "I felt incredibly relieved and confident about the result.",
        "Truly,",
        "I could not have made such a massive life choice without their steady guidance."
      ],
      "q3": [
        "Describe a person you know who loves to learn from others.",
        "You should say: Who this person is How they learn (asking questions,",
        "observing) What they have learned And explain why you think this is a good quality.",
        "To start off,",
        "I will describe my grandfather,",
        "who is deeply passionate about acquiring new skills.",
        "Basically,",
        "he is retired but constantly seeks knowledge from people around him.",
        "Frequently,",
        "he asks me to teach him how to use modern smartphone applications.",
        "Moreover,",
        "he carefully observes mechanics when they repair his car to understand the process.",
        "Personally,",
        "I think this is a fantastic quality because it keeps his mind sharp and active.",
        "Eventually,",
        "his curiosity makes him an incredibly interesting person to talk to.",
        "Overall,",
        "he proves that you are never too old to learn something new."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: How can leaders encourage their employees?",
        "Generally speaking,",
        "good managers provide clear goals,",
        "and they reward hard work.",
        "Specifically,",
        "effective leadership requires bosses to actively lead by example rather than just shouting orders.",
        "For instance,",
        "a manager who stays late to help the team will easily inspire loyalty and dedication."
      ],
      "q2": [
        "Q2: When should parents encourage their children?",
        "In my opinion,",
        "parents should offer praise when kids try new things.",
        "Fundamentally,",
        "facing failure is scary,",
        "so children need constant emotional motivation to build their confidence.",
        "Therefore,",
        "cheering for a child after they lose a sports match helps them bounce back quickly."
      ],
      "q3": [
        "Q3: Why do some people like to ask others for advice?",
        "Honestly,",
        "many individuals lack self-confidence,",
        "so they seek external validation.",
        "Furthermore,",
        "asking for professional guidance ensures a much higher level of reliability when making choices.",
        "For example,",
        "consulting a financial advisor prevents people from making terrible investments with their savings."
      ],
      "q4": [
        "Q4: What important decisions should be made by teenagers themselves?",
        "Ideally,",
        "youths should choose their own hobbies,",
        "and they must select their own friends.",
        "Consequently,",
        "making these social choices helps them reduce parental dependency and learn to handle peer pressure.",
        "As a result,",
        "a teenager who picks their own sports club becomes much more independent."
      ],
      "q5": [
        "Q5: Is positive reinforcement (encouragement) more effective than criticism?",
        "Absolutely,",
        "praise builds trust,",
        "whereas harsh criticism often causes deep resentment.",
        "Actually,",
        "people are much more likely to improve their behavior when they receive gentle,",
        "constructive criticism instead of anger.",
        "For instance,",
        "praising a student's effort before correcting their math errors yields much better grades."
      ],
      "q6": [
        "Q6: How does peer pressure differ from positive encouragement?",
        "Fundamentally,",
        "pressure forces conformity,",
        "while encouragement sparks genuine personal growth.",
        "Essentially,",
        "true mentorship lifts a person up,",
        "whereas toxic peer influence drags them down into bad habits.",
        "To illustrate,",
        "forcing a friend to skip class is pressure,",
        "but studying together is pure encouragement."
      ]
    }
  },
  {
    "week": 26,
    "part_2": {
      "q1": [
        "Describe a time you received good service from a staff member in a shop/company.",
        "(Examiner Note: Focus your description on the place where this happened) You should say: Where the shop/company is When you received the good service What service you received And explain how you felt about the service.",
        "To begin with,",
        "I want to talk about a recent shopping trip,",
        "which was incredibly efficient,",
        "and where I received impeccable service.",
        "Honestly,",
        "the shop assistant was extremely courteous and attentive to my needs.",
        "Actually,",
        "she decided to go above and beyond to find my exact shoe size.",
        "Furthermore,",
        "she was quite persuasive without being overly pushy.",
        "Throughout the process,",
        "she helped me with a smile.",
        "Consequently,",
        "I felt absolutely satisfied with my purchase.",
        "Truly,",
        "they managed to treat someone like royalty in that store.",
        "Finally,",
        "I left feeling deeply appreciative for her wonderful help."
      ],
      "q2": [
        "Describe a shop where you bought something expensive.",
        "You should say: What the shop was Where it is located What you bought there And explain why you chose that specific place.",
        "First of all,",
        "I want to describe an electronics store where I purchased my new laptop.",
        "Actually,",
        "it is located in the largest shopping mall in the city center.",
        "Recently,",
        "I bought a high-end gaming computer there because I needed it for my university projects.",
        "Primarily,",
        "I chose that specific place because they offered a comprehensive warranty and excellent after-sales support.",
        "Furthermore,",
        "the staff members were incredibly knowledgeable and did not pressure me into buying unnecessary accessories.",
        "Ultimately,",
        "spending that much money felt justified because the product was perfect.",
        "Looking back,",
        "I am very pleased with my decision."
      ],
      "q3": [
        "Describe a newly opened shop or facility in your area.",
        "You should say: Where it is What it sells or offers Who goes there And explain if you think it will be successful.",
        "To start off,",
        "I am going to describe a new fitness center that just opened in my neighborhood.",
        "Basically,",
        "it is situated right next to the local cinema.",
        "Inside,",
        "it offers various workout classes and modern exercise machines.",
        "Generally,",
        "it attracts a lot of teenagers and young adults on the weekends.",
        "Personally,",
        "I think it will be highly successful because there is no other gym quite like it nearby.",
        "Moreover,",
        "the pricing is very reasonable for students.",
        "Finally,",
        "they constantly update their equipment,",
        "which will definitely keep customers coming back."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Do you think expensive services are necessarily good services?",
        "Generally speaking,",
        "high prices do not guarantee quality,",
        "although they often raise expectations.",
        "In reality,",
        "some luxury brands focus entirely on marketing rather than the actual hospitality provided.",
        "For example,",
        "a cheap local diner might offer much better service and give you more bang for your buck than a fancy restaurant."
      ],
      "q2": [
        "Q2: Which one is better,",
        "face-to-face service or online service?",
        "In my opinion,",
        "physical service is superior,",
        "because it provides a crucial human touch.",
        "Undoubtedly,",
        "talking to a real person provides clear guidance when solving complex issues.",
        "Therefore,",
        "if a financial transaction fails,",
        "a human bank teller can reassure the customer immediately."
      ],
      "q3": [
        "Q3: Why do people buy things that they clearly don't need?",
        "Fundamentally,",
        "impulsive consumption happens frequently,",
        "because advertising creates strong artificial desires.",
        "Moreover,",
        "a buyer's primary motivation is often emotional satisfaction rather than absolute practical necessity.",
        "For instance,",
        "many young shoppers purchase unnecessary trendy clothing just to feel a temporary sense of happiness."
      ],
      "q4": [
        "Q4: Do you often go over your budget when you go shopping?",
        "Personally,",
        "I rarely overspend,",
        "since I practice strict budgeting every month.",
        "Actually,",
        "I believe the old saying that the customer is always right is a marketing trap designed to make us buy more.",
        "As a result,",
        "I always make a shopping list to avoid buying random items."
      ],
      "q5": [
        "Q5: How does poor customer service affect a company's reputation in the age of social media?",
        "Undeniably,",
        "bad service can destroy a brand instantly,",
        "because negative reviews spread rapidly.",
        "Consequently,",
        "a single viral complaint video can reach millions of potential buyers in just a few hours.",
        "For example,",
        "a rude waiter might cause an entire restaurant chain to lose significant profits."
      ],
      "q6": [
        "Q6: Is the trend of automation (e.",
        "g.,",
        "self-checkout) killing the \"human touch\" in shopping?",
        "Admittedly,",
        "strict automation reduces personal connections,",
        "though it vastly improves speed.",
        "Unfortunately,",
        "self-checkout machines cannot offer friendly conversations or personalized recommendations to shoppers.",
        "Therefore,",
        "elderly customers often feel socially isolated when supermarkets replace all their human cashiers with screens."
      ]
    }
  },
  {
    "week": 27,
    "part_2": {
      "q1": [
        "Describe an online TV program.",
        "You should say: What the program is When and where you watched it What it was about And explain why you liked/disliked this program.",
        "To start with,",
        "I want to describe a truly engaging documentary,",
        "which is highly informative,",
        "and which focuses on wildlife.",
        "Honestly,",
        "the production quality is absolutely impeccable.",
        "Recently,",
        "it started to blow up online.",
        "As a result,",
        "I decided to binge-watch the entire season last weekend.",
        "Actually,",
        "the short clips are so entertaining that they often go viral.",
        "Furthermore,",
        "the storytelling is incredibly addictive.",
        "Consequently,",
        "I found myself being very attentive to every single detail.",
        "Overall,",
        "I highly recommend that you scroll through the episodes and watch them."
      ],
      "q2": [
        "Describe something interesting you saw on social media.",
        "You should say: What platform you were using What the content was (video,",
        "article,",
        "post) Why it caught your attention And explain why you felt it was interesting.",
        "First and foremost,",
        "I would like to describe a fascinating short video I saw on a popular social media app.",
        "Actually,",
        "it was a detailed tutorial on how to restore old,",
        "damaged photographs using digital software.",
        "I was scrolling through my feed when the amazing before-and-after thumbnail caught my attention.",
        "Personally,",
        "I found it extremely interesting because the creator explained the complex editing process in a very simple way.",
        "Furthermore,",
        "it showed how modern technology can preserve precious historical memories.",
        "Ultimately,",
        "I saved the video so I could try the technique on my own family photos later."
      ],
      "q3": [
        "Describe a website or platform you use to get information.",
        "You should say: What the website is How often you visit it What kind of information it provides And explain why you trust it.",
        "To begin with,",
        "I want to talk about a free online encyclopedia that I use almost every single day.",
        "Basically,",
        "it is a massive website that provides detailed articles on virtually any topic imaginable.",
        "Normally,",
        "I visit it whenever I need quick facts for my university assignments or when I am just curious about history.",
        "Frankly,",
        "I trust it because the articles are constantly reviewed and updated by thousands of volunteers and experts globally.",
        "Moreover,",
        "it is incredibly easy to navigate and does not have annoying advertisements.",
        "Overall,",
        "it is an essential tool for my daily learning."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What do you think are the benefits of watching TV programs?",
        "Generally speaking,",
        "television is an excellent stress reliever,",
        "since it actively broadens our cultural horizons.",
        "Specifically,",
        "the daily consumption of high-quality documentaries teaches viewers about different global communities.",
        "For example,",
        "a well-produced nature show can significantly increase our awareness of critical environmental issues."
      ],
      "q2": [
        "Q2: Why don't young people pay much attention to local news?",
        "Honestly,",
        "teenagers find local politics boring,",
        "since they prefer global entertainment.",
        "Furthermore,",
        "the mainstream news networks rarely target the interests of younger demographics.",
        "Consequently,",
        "they would rather watch a funny video go viral on social media than watch a city council meeting."
      ],
      "q3": [
        "Q3: Do you think some people waste too much time on social media?",
        "Absolutely,",
        "smartphone addiction is a massive problem,",
        "because it completely destroys daily productivity.",
        "Undeniably,",
        "every social media algorithm is strictly designed to keep users endlessly scrolling for hours.",
        "As a result,",
        "many individuals become a lazy couch potato instead of going outside or exercising."
      ],
      "q4": [
        "Q4: What do you think are the drawbacks of social media?",
        "In my view,",
        "although cyberbullying is a major issue,",
        "false information is often much worse.",
        "Sadly,",
        "the rapid online spread of misinformation creates unnecessary panic and heavily divides communities.",
        "For instance,",
        "malicious users frequently share dangerous fake news during important political elections to manipulate voters."
      ],
      "q5": [
        "Q5: Has the rise of streaming services (like Netflix) destroyed traditional television?",
        "Definitely,",
        "streaming platforms dominate the market,",
        "while cable networks are dying.",
        "Fundamentally,",
        "the automation of video recommendations gives viewers exactly what they want instantly.",
        "Therefore,",
        "people prefer the connectivity of watching shows on their phones anytime over fixed broadcasting schedules."
      ],
      "q6": [
        "Q6: Do you think governments should censor content on the internet?",
        "To an extent,",
        "regulating illegal content is necessary,",
        "but strict control limits freedom.",
        "Essentially,",
        "heavy censorship prevents citizens from accessing diverse global perspectives.",
        "Instead,",
        "governments should promote digital literacy so users can identify harmful content themselves without relying on bans."
      ]
    }
  },
  {
    "week": 28,
    "part_2": {
      "q1": [
        "Describe a time when you had dinner together with your friend.",
        "You should say: When it was What you ate What you talked about And explain how you felt about it.",
        "To begin with,",
        "I want to describe a lively dinner party,",
        "which was highly engaging,",
        "and where the food was fantastic.",
        "Honestly,",
        "the meal was absolutely delicious.",
        "At first,",
        "the atmosphere felt slightly awkward because some guests didn't know each other.",
        "However,",
        "my best friend managed to break the ice with a funny story.",
        "Actually,",
        "he is always very sociable and the life of the party.",
        "Furthermore,",
        "his jokes were incredibly entertaining.",
        "Ultimately,",
        "we all managed to have a blast together.",
        "Overall,",
        "it was a truly memorable evening."
      ],
      "q2": [
        "Describe an event you attended (e.",
        "g.,",
        "concert or party) that you didn't enjoy.",
        "You should say: What the event was Who you went with Why you went there And explain why you didn't enjoy it.",
        "First of all,",
        "I want to describe an outdoor music festival I attended last summer that was quite disappointing.",
        "Initially,",
        "I went there with a large group of my university friends,",
        "expecting a fantastic weekend.",
        "Unfortunately,",
        "it rained heavily for three days straight,",
        "turning the entire venue into a muddy swamp.",
        "Furthermore,",
        "the event was severely overcrowded,",
        "making it impossible to see the bands or buy food easily.",
        "Frankly,",
        "I did not enjoy it because the poor organization completely ruined the atmosphere.",
        "Eventually,",
        "we decided to leave early,",
        "feeling cold,",
        "tired,",
        "and thoroughly frustrated with the whole experience."
      ],
      "q3": [
        "Describe a celebration you attended recently.",
        "You should say: What the celebration was for Where it was held Who was there And explain how you felt during the event.",
        "To start off,",
        "I will describe a wonderful graduation celebration I attended just a few weeks ago.",
        "Essentially,",
        "it was a special dinner held at a beautiful lakeside restaurant to honor my older sister.",
        "Unsurprisingly,",
        "all of our close relatives and her best friends were there to congratulate her.",
        "During the event,",
        "we enjoyed a massive feast,",
        "gave heartfelt speeches,",
        "and took hundreds of photographs.",
        "Personally,",
        "I felt incredibly proud and joyous witnessing her hard work finally pay off.",
        "Looking back,",
        "the warm atmosphere and shared happiness made it a truly perfect evening for our family."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why are people nowadays less willing to have meals with their families?",
        "In modern society,",
        "since people are incredibly busy,",
        "they frequently prioritize work over family.",
        "Unfortunately,",
        "long commuting hours and stressful jobs cause severe social isolation within the household.",
        "Consequently,",
        "young adults rarely share meaningful quality time with their parents at the dinner table anymore."
      ],
      "q2": [
        "Q2: What are the differences in food for different occasions?",
        "Undeniably,",
        "daily meals are quick and simple,",
        "whereas holiday feasts are highly complex and rich.",
        "Fundamentally,",
        "any grand celebration requires special,",
        "expensive dishes that deeply represent cultural tradition.",
        "For instance,",
        "Chinese families spend several days preparing intricate dumplings and fish for the Lunar New Year dinner."
      ],
      "q3": [
        "Q3: What kind of music events do people like today?",
        "Currently,",
        "huge outdoor festivals are incredibly popular,",
        "because they offer highly diverse entertainment.",
        "Specifically,",
        "these mainstream events allow the youth to securely let their hair down and escape academic pressure.",
        "For example,",
        "electronic dance music concerts attract thousands of energetic fans every single summer weekend."
      ],
      "q4": [
        "Q4: Do you think children should receive some musical education?",
        "Absolutely,",
        "learning a musical instrument is vital,",
        "as it significantly boosts early brain development.",
        "Furthermore,",
        "practicing classical music actively improves their neuronal connectivity and emotional intelligence.",
        "As an illustration,",
        "children who play the piano often show much better focus and concentration in their mathematics classes."
      ],
      "q5": [
        "Q5: Is it important for communities to have public festivals and celebrations?",
        "Without a doubt,",
        "local festivals are essential,",
        "since they unite different neighborhoods.",
        "Essentially,",
        "a shared public event strengthens the community bond,",
        "proving that the more the merrier.",
        "For instance,",
        "a summer food market encourages strangers to mingle and build local friendships safely."
      ],
      "q6": [
        "Q6: How has the definition of \"socializing\" changed with the introduction of smartphones?",
        "Unfortunately,",
        "because socializing is now mostly digital,",
        "it lacks genuine intimacy.",
        "Nowadays,",
        "strict physical etiquette is ignored because people prefer texting over talking face-to-face.",
        "Consequently,",
        "groups of friends often sit together in cafes while silently staring at their individual screens."
      ]
    }
  },
  {
    "week": 29,
    "part_2": {
      "q1": [
        "Describe a person who apologized to you.",
        "You should say: Who the person was When it was Why this person apologized And explain how you felt about it.",
        "To begin with,",
        "I want to talk about my highly sociable colleague,",
        "who is generally very honest,",
        "but who made a mistake.",
        "Honestly,",
        "the situation was incredibly awkward at first.",
        "Actually,",
        "he lost an important file,",
        "but he was very courageous to admit it.",
        "Furthermore,",
        "he sounded truly regretful.",
        "Ultimately,",
        "he decided to swallow his pride and apologize.",
        "Moreover,",
        "he just wanted to get something off his chest.",
        "Consequently,",
        "his sincere apology managed to clear the air between us completely.",
        "Finally,",
        "I am a very forgiving person,",
        "so we moved on quickly."
      ],
      "q2": [
        "Describe a time when you told your friend an important truth.",
        "You should say: Who your friend is What the truth was What your friend's reaction was And explain why you think it was important to be honest.",
        "To start off,",
        "I want to describe a difficult conversation I had with my best friend last year.",
        "Basically,",
        "she was wearing a terrible outfit to a very important job interview.",
        "Initially,",
        "I hesitated to say anything because I did not want to hurt her feelings.",
        "However,",
        "I realized that letting her look unprofessional would be much worse.",
        "Therefore,",
        "I gently told her the truth about the clothes and suggested a better suit.",
        "Surprisingly,",
        "she was incredibly grateful for my honesty.",
        "Ultimately,",
        "she changed her outfit,",
        "performed well,",
        "and actually secured the job offer the following week."
      ],
      "q3": [
        "Describe a person you admire for their honesty.",
        "You should say: Who this person is How they showed their honesty What the result of their honesty was And explain why you respect them.",
        "First of all,",
        "I would like to talk about my high school history teacher,",
        "who is the most honest person I know.",
        "Generally,",
        "teachers pretend to know everything,",
        "but he was entirely different.",
        "Whenever a student asked a highly obscure question,",
        "he would openly admit if he did not know the answer.",
        "Afterward,",
        "he would research it and tell us the next day.",
        "Personally,",
        "I respect him immensely because this transparency built tremendous trust in the classroom.",
        "Furthermore,",
        "it taught us that acknowledging our own ignorance is actually a vital step in the lifelong learning process."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: In what situations should we apologize immediately?",
        "Generally speaking,",
        "we must apologize quickly when we cause physical harm,",
        "or when we accidentally damage property.",
        "Fundamentally,",
        "promptly acknowledging a mistake prevents a minor accident from escalating into a serious emotional conflict.",
        "For instance,",
        "if you accidentally spill hot coffee on a colleague,",
        "an immediate apology is essential for harmony."
      ],
      "q2": [
        "Q2: Do you think accepting apologies is always the correct thing to do?",
        "In my opinion,",
        "forgiveness is generally good,",
        "but it depends on the severity of the offense.",
        "Specifically,",
        "if someone displays malicious deception,",
        "blindly accepting their apology is foolish.",
        "Therefore,",
        "while it is nice to bury the hatchet,",
        "repeated betrayals do not deserve instant forgiveness."
      ],
      "q3": [
        "Q3: Do you agree that sometimes people should tell lies (white lies)?",
        "Admittedly,",
        "strict truthfulness is ideal,",
        "yet small fabrications are occasionally completely necessary.",
        "Sometimes,",
        "basic social etiquette requires a harmless white lie to actively protect someone's fragile feelings.",
        "For example,",
        "pretending to love a terrible birthday gift prevents unnecessary sadness and maintains the long-term friendship."
      ],
      "q4": [
        "Q4: Do you think we should tell the truth at all times?",
        "Ultimately,",
        "I firmly believe that honesty is the best policy in almost all situations.",
        "Essentially,",
        "personal integrity builds trust,",
        "which is the foundation of any healthy relationship.",
        "Therefore,",
        "constantly lying,",
        "even about small things,",
        "will eventually destroy a person's credibility and reputation completely."
      ],
      "q5": [
        "Q5: Is \"honesty\" still valued as a primary virtue in modern business?",
        "Unfortunately,",
        "profit often overshadows truth,",
        "though ethical companies still prioritize transparency.",
        "Today,",
        "corporate morality is frequently compromised by aggressive marketing and hidden fees.",
        "However,",
        "brands that maintain absolute honesty usually secure much stronger,",
        "long-term loyalty from their dedicated customer base."
      ],
      "q6": [
        "Q6: How does a culture of forgiveness contribute to social harmony?",
        "Undeniably,",
        "since forgiveness reduces societal tension,",
        "it effectively promotes peaceful coexistence.",
        "Basically,",
        "without a clear path for conflict resolution,",
        "grudges would divide a local community permanently.",
        "As an illustration,",
        "restorative justice programs allow offenders to make amends,",
        "thereby healing the neighborhood collectively."
      ]
    }
  },
  {
    "week": 30,
    "part_2": {
      "q1": [
        "Describe a wild animal that you want to know more about.",
        "(Examiner Note: You may focus on where this animal lives) You should say: What it is Where you saw it (or where it lives) Why you are interested in it And explain why you want to know more about it.",
        "To begin with,",
        "I want to describe the tiger,",
        "which is a truly fascinating creature,",
        "and which is sadly endangered today.",
        "Honestly,",
        "it is a completely wild animal that lives in deep forests.",
        "Actually,",
        "I dream of seeing one face to face in a nature reserve.",
        "Furthermore,",
        "they look incredibly majestic.",
        "Consequently,",
        "I have a sincere interest in their unique hunting habits.",
        "Moreover,",
        "observing them in the wild requires a courageous heart.",
        "Ultimately,",
        "the tiger is known as the king of the jungle.",
        "Overall,",
        "I want to learn more to help protect them."
      ],
      "q2": [
        "Describe a place where you saw wild animals (e.",
        "g.,",
        "Zoo,",
        "National Park).",
        "You should say: Where the place was What animals you saw How the animals were treated And explain how you felt visiting this place.",
        "To start off,",
        "I want to describe a large wildlife park I visited last summer.",
        "Basically,",
        "it is located in the beautiful mountains of Sichuan province.",
        "During my trip,",
        "I saw many giant pandas eating bamboo peacefully.",
        "Truthfully,",
        "the animals were treated incredibly well with plenty of open space.",
        "Consequently,",
        "I felt very happy and relieved visiting this place because it focused heavily on animal rescue.",
        "Furthermore,",
        "seeing these rare creatures thriving gave me a lot of hope.",
        "Ultimately,",
        "it was a deeply inspiring trip that changed my view on modern zoos."
      ],
      "q3": [
        "Describe a natural habitat you would like to visit to see wildlife.",
        "You should say: Where it is located What kind of ecosystem it is What animals live there And explain why you want to go there.",
        "First of all,",
        "I would absolutely love to visit the Amazon rainforest to see its wildlife.",
        "Essentially,",
        "it is located in South America and represents the largest tropical ecosystem on our planet.",
        "Apparently,",
        "thousands of rare birds and colorful frogs live there in the dense trees.",
        "Honestly,",
        "I want to go there because I love nature photography.",
        "Moreover,",
        "it is a completely untouched environment that feels incredibly mysterious.",
        "Ultimately,",
        "taking a boat down the massive river would be the perfect adventure for someone who enjoys the outdoors.",
        "Looking back,",
        "watching documentaries about it has always inspired me."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why are some people more willing to protect wild animals than others?",
        "Generally speaking,",
        "education plays a huge role,",
        "since some people truly understand global biodiversity.",
        "Specifically,",
        "those who study nature realize that preventing animal extinction is crucial for human survival too.",
        "For example,",
        "individuals working in global conservation deeply value every single species."
      ],
      "q2": [
        "Q2: Do you think it's important to take children to the zoo to see animals?",
        "In my opinion,",
        "visiting zoos is highly educational,",
        "though keeping animals in captivity remains controversial today.",
        "Fundamentally,",
        "seeing real creatures builds empathy,",
        "which can prevent future human-animal conflict.",
        "Therefore,",
        "children who watch lions closely learn to respect nature deeply rather than fearing it."
      ],
      "q3": [
        "Q3: Does tourism have a positive or negative impact on animals?",
        "Honestly,",
        "it is a double-edged sword,",
        "because it funds parks but ruins habitats.",
        "Unfortunately,",
        "heavy foot traffic frequently disrupts a delicate ecosystem completely.",
        "To illustrate,",
        "many businesses shed crocodile tears about protecting wildlife while secretly destroying forests for new hotels."
      ],
      "q4": [
        "Q4: Should animals be kept in captivity for entertainment purposes?",
        "Absolutely not,",
        "using animals for cheap amusement completely violates basic human morality.",
        "Essentially,",
        "forcing wild beasts to perform unnatural tricks in circuses is cruel and outdated.",
        "Consequently,",
        "it is much better to let sleeping dogs lie and leave animals undisturbed."
      ],
      "q5": [
        "Q5: How does the extinction of a single species affect the wider environment?",
        "Undeniably,",
        "losing one species creates a massive chain reaction,",
        "which damages food webs.",
        "In nature,",
        "the harsh law of survival of the fittest maintains a very delicate environmental balance.",
        "As a result,",
        "if bees vanish,",
        "countless plants and other dependent animals will also die rapidly."
      ],
      "q6": [
        "Q6: Is it the responsibility of rich nations to help poor nations protect their wildlife?",
        "Certainly,",
        "wealthy countries must provide funding,",
        "since environmental protection is a global duty.",
        "Actually,",
        "poorer nations often lack the necessary financial resources to fight illegal poaching effectively.",
        "For instance,",
        "donating advanced tracking technology helps developing countries save rare rhinos from armed hunters."
      ]
    }
  },
  {
    "week": 31,
    "part_2": {
      "q1": [
        "Describe an area of science (physics,",
        "biology,",
        "psychology,",
        "etc.",
        ") that interests you.",
        "You should say: What it is When you knew about it How you learnt it And explain why you are interested.",
        "To begin with,",
        "I want to talk about astronomy,",
        "which is highly complex,",
        "and which explores the universe.",
        "Honestly,",
        "it is a truly fascinating subject for me.",
        "Furthermore,",
        "understanding black holes requires a very logical and theoretical approach.",
        "Actually,",
        "reading about space gives me endless food for thought.",
        "Sometimes,",
        "the vastness of galaxies gives me a light bulb moment about human existence.",
        "Moreover,",
        "astronomers are doing groundbreaking and creative work every day.",
        "Ultimately,",
        "studying this unique field is not exactly rocket science if you have passion."
      ],
      "q2": [
        "Describe a time when you needed to use your imagination.",
        "You should say: When it was Why you needed to use your imagination How you used it And explain how you felt about the result.",
        "To start off,",
        "I want to describe a time I had to use my imagination for a school project.",
        "Basically,",
        "our teacher asked us to design a futuristic city using recycled materials.",
        "Initially,",
        "I felt completely stuck because I had no clear ideas.",
        "However,",
        "I decided to brainstorm and sketch out some wild concepts.",
        "Eventually,",
        "I constructed a floating island powered by solar energy.",
        "Frankly,",
        "I felt incredibly proud of the final result because it looked amazing.",
        "Looking back,",
        "it taught me how powerful creative thinking can be when solving unusual problems."
      ],
      "q3": [
        "Describe a scientific invention that you think is very important.",
        "You should say: What it is Who invented it (if you know) How it helps people And explain why the world would be different without it.",
        "First of all,",
        "I will describe the invention of the internet,",
        "which is undoubtedly the most important creation ever.",
        "Essentially,",
        "it was developed by computer scientists several decades ago to share information quickly.",
        "Today,",
        "it connects billions of people and powers the modern global economy.",
        "Honestly,",
        "the world would be completely unrecognizable without it,",
        "as we rely on it for work and communication.",
        "Furthermore,",
        "it allows students to access unlimited educational resources instantly.",
        "Ultimately,",
        "it has transformed human society into a truly global village,",
        "making physical borders much less significant."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Are science majors popular in schools?",
        "Generally speaking,",
        "STEM subjects are highly popular,",
        "because they offer excellent career prospects.",
        "Specifically,",
        "students with natural curiosity are drawn to fields that drive global innovation.",
        "For example,",
        "computer science degrees are currently the most sought-after programs in many modern universities."
      ],
      "q2": [
        "Q2: Is learning science important?",
        "What are the applications of science in daily life?",
        "Absolutely,",
        "scientific knowledge is crucial,",
        "as it builds the foundation of modern society.",
        "In fact,",
        "every medical breakthrough relies heavily on rigorous testing and repeated experiment.",
        "Therefore,",
        "the medicines we take daily are direct results of careful biological research."
      ],
      "q3": [
        "Q3: Which requires more imagination: reading books or watching cartoons?",
        "In my opinion,",
        "reading demands much more imagination,",
        "since the visuals are completely absent.",
        "Essentially,",
        "when reading text,",
        "your brain must actively construct every scene instead of having it handed to you.",
        "As an illustration,",
        "two people reading the same novel will picture the characters entirely differently,",
        "showing that great minds think alike but imagine uniquely."
      ],
      "q4": [
        "Q4: Which occupations (or jobs) require a high degree of imagination?",
        "Undeniably,",
        "architects and writers need immense creativity,",
        "but scientists do too.",
        "Fundamentally,",
        "researchers must formulate a unique hypothesis before they can discover anything new.",
        "Consequently,",
        "an ecologist studying a complex ecosystem must imagine unseen connections to solve environmental puzzles."
      ],
      "q5": [
        "Q5: Does the current education system encourage or kill creativity?",
        "Sadly,",
        "rigid schooling often stifles creativity,",
        "because it focuses heavily on standardized testing.",
        "Unfortunately,",
        "students are taught to memorize facts rather than explore new ideas,",
        "forcing them to reinvent the wheel unnecessarily.",
        "For instance,",
        "strict grading rubrics penalize students who solve math problems using unconventional methods."
      ],
      "q6": [
        "Q6: Is scientific progress always good for society,",
        "or are there ethical risks?",
        "Admittedly,",
        "progress brings huge benefits,",
        "yet it also carries severe ethical dangers.",
        "Sometimes,",
        "corporations try to blind with science to hide the devastating environmental impacts of their inventions.",
        "Therefore,",
        "unregulated genetic modification might eventually lead to the terrifying extinction of natural plant species."
      ]
    }
  },
  {
    "week": 32,
    "part_2": {
      "q1": [
        "Describe a new activity that you tried for the first time and felt excited about.",
        "You should say: What it was When you tried it Who you did it with And explain why you felt excited.",
        "To begin with,",
        "I want to talk about indoor rock climbing,",
        "which is incredibly complex,",
        "and which requires great strength.",
        "Honestly,",
        "the steep learning curve made it incredibly challenging at first.",
        "Actually,",
        "looking down from the wall was extremely nerve-wracking.",
        "However,",
        "I was highly determined to reach the top.",
        "Furthermore,",
        "my friend encouraged me to just give it a go.",
        "Eventually,",
        "I managed to get the hang of it by using a very logical climbing technique.",
        "Ultimately,",
        "the feeling of success was absolutely exhilarating.",
        "Overall,",
        "it was a deeply rewarding experience."
      ],
      "q2": [
        "Describe the first time you used a foreign language to communicate.",
        "You should say: Who you talked to Where it happened What you talked about And explain how you felt about your language skills.",
        "To start off,",
        "I want to describe the first time I used English to communicate with a foreigner.",
        "Basically,",
        "I was volunteering at a tourist information desk when an Australian visitor asked for directions.",
        "Initially,",
        "my mind went completely blank,",
        "and my heart was beating rapidly.",
        "However,",
        "I took a deep breath and slowly explained the subway route to him.",
        "Amazingly,",
        "he understood me perfectly and thanked me warmly.",
        "Frankly,",
        "I felt incredibly proud of my language skills in that moment.",
        "Ultimately,",
        "it gave me a massive confidence boost to keep studying hard."
      ],
      "q3": [
        "Describe a challenge you faced when learning something new.",
        "You should say: What you were learning Why it was difficult How you overcame the difficulty And explain what you learned from the experience.",
        "First and foremost,",
        "I will describe the major challenge I faced when learning how to play the guitar.",
        "Essentially,",
        "memorizing the complicated chord shapes was incredibly painful for my fingers.",
        "Truthfully,",
        "it was difficult because I lacked natural musical talent and rhythm.",
        "Consequently,",
        "I wanted to quit during the first few weeks.",
        "However,",
        "I overcame the difficulty by practicing for twenty minutes every single day without fail.",
        "Slowly,",
        "my hands built muscle memory.",
        "Looking back,",
        "I learned that pure consistency and patience are far more important than raw talent when acquiring a new skill."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do some people like extreme sports?",
        "Generally speaking,",
        "thrill-seekers love the massive adrenaline rush,",
        "because it makes them feel truly alive.",
        "Furthermore,",
        "conquering a terrifying physical barrier provides a deep sense of personal achievement.",
        "For instance,",
        "skydiving forces people to face their darkest fears,",
        "rapidly increasing their mental adaptability."
      ],
      "q2": [
        "Q2: What common activities could make people relax?",
        "In my opinion,",
        "reading books and doing yoga are fantastic ways to unwind completely.",
        "Basically,",
        "these quiet hobbies allow individuals to escape the intense pressure of constant workplace innovation.",
        "Therefore,",
        "spending an hour meditating in a silent room lowers stress and restores mental peace instantly."
      ],
      "q3": [
        "Q3: Why do people learn foreign languages?",
        "Undeniably,",
        "learning languages is essential for career growth,",
        "and it significantly helps people travel easily.",
        "Due to rapid globalization,",
        "international companies demand employees with high linguistic proficiency.",
        "Consequently,",
        "mastering English or Spanish allows young professionals to successfully broaden their horizons."
      ],
      "q4": [
        "Q4: At what age do you think is the best time for people to learn a foreign language?",
        "Absolutely,",
        "early childhood is the optimal period,",
        "since young brains absorb information like sponges.",
        "Essentially,",
        "language acquisition is much faster before the age of ten because children possess endless curiosity.",
        "For example,",
        "toddlers raised in bilingual households learn to speak two languages without any conscious effort."
      ],
      "q5": [
        "Q5: Is it necessary to learn the culture of a country when learning its language?",
        "Definitely,",
        "understanding the culture is crucial,",
        "because language is deeply tied to social history.",
        "In fact,",
        "to truly learn the ropes of local slang,",
        "you must understand the cultural context behind the words.",
        "As an illustration,",
        "Japanese greetings change significantly depending on the strict social hierarchy and politeness levels."
      ],
      "q6": [
        "Q6: Does globalization mean that everyone will eventually speak the same language?",
        "Personally,",
        "I highly doubt it,",
        "although English will likely remain the dominant business tool.",
        "Ultimately,",
        "people value their native tongues too much to abandon them entirely,",
        "even though practice makes perfect in English.",
        "Therefore,",
        "regional dialects and historical languages will always survive alongside any global lingua franca."
      ]
    }
  },
  {
    "week": 33,
    "part_2": {
      "q1": [
        "Describe a good habit your friend has and you want to develop.",
        "You should say: Who your friend is What habit he/she has When you noticed this habit And explain why you want to develop this habit.",
        "To begin with,",
        "I want to talk about my highly disciplined friend,",
        "who is incredibly productive,",
        "and who always wakes up early.",
        "Honestly,",
        "his daily schedule is extremely beneficial for his health.",
        "Actually,",
        "I am naturally a creature of habit who stays up late,",
        "which is detrimental.",
        "However,",
        "I am determined to turn over a new leaf.",
        "Furthermore,",
        "I really want to kick the habit of scrolling on my phone at night.",
        "Consequently,",
        "if I remain persistent,",
        "waking up early will be deeply rewarding.",
        "Overall,",
        "I admire his excellent time management."
      ],
      "q2": [
        "Describe a bad habit you successfully got rid of.",
        "You should say: What the habit was How long you had it How you stopped it And explain how your life improved afterwards.",
        "To start off,",
        "I want to describe my journey of quitting junk food.",
        "Basically,",
        "I used to eat fast food every single day after school for over three years.",
        "Unfortunately,",
        "it made me feel constantly tired and negatively affected my skin.",
        "Eventually,",
        "I decided to completely stop buying sugary snacks and started cooking my own meals.",
        "Frankly,",
        "the first few weeks were extremely difficult because my cravings were intense.",
        "However,",
        "my life improved dramatically afterwards as my energy levels skyrocketed.",
        "Looking back,",
        "it was the best health decision I have ever made for my body."
      ],
      "q3": [
        "Describe a person you know who is very disciplined.",
        "You should say: Who they are What their daily routine is like Why they are so disciplined And explain what you admire about them.",
        "First of all,",
        "I will describe my older brother,",
        "who is the most disciplined person I know.",
        "Essentially,",
        "he is a professional athlete who trains rigorously every single day.",
        "Usually,",
        "his routine involves waking up at dawn,",
        "running five kilometers,",
        "and eating a strictly measured diet.",
        "Personally,",
        "I believe he is so disciplined because he is deeply determined to win a gold medal.",
        "Furthermore,",
        "he refuses to let temporary laziness ruin his long-term goals.",
        "Ultimately,",
        "I admire his immense mental strength and his ability to push through physical pain to achieve absolute greatness."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What influences do children with bad habits have on other children?",
        "Undeniably,",
        "negative peer influence is highly contagious,",
        "because kids mimic each other constantly.",
        "Unfortunately,",
        "children lack the necessary willpower to resist copying bad behavior like swearing or skipping homework.",
        "As a result,",
        "one disruptive student can easily ruin the entire classroom's focus and academic proficiency."
      ],
      "q2": [
        "Q2: Why do some habits change when people get older?",
        "Generally speaking,",
        "age brings maturity,",
        "and aging bodies demand a healthier lifestyle.",
        "Although old habits die hard,",
        "severe health scares often force adults to adjust their toxic patterns.",
        "For instance,",
        "a person might finally stop smoking after realizing the deadly consequence on their lungs."
      ],
      "q3": [
        "Q3: How do we develop bad habits?",
        "Essentially,",
        "poor choices become automatic,",
        "because humans naturally seek instant gratification.",
        "Specifically,",
        "the rapid acquisition of a terrible routine usually begins as a temporary coping mechanism for daily stress.",
        "Therefore,",
        "eating sugary chocolate once to feel better quickly turns into a daily sugar addiction."
      ],
      "q4": [
        "Q4: What can we do to get rid of bad habits?",
        "In my opinion,",
        "substituting the bad action with a healthy alternative is highly effective.",
        "Frankly,",
        "relying purely on motivation fails;",
        "you must consciously change your environment to succeed.",
        "As an illustration,",
        "an early bird who wants to stop drinking coffee should drink green tea instead."
      ],
      "q5": [
        "Q5: Do you think successful people always have strict daily routines?",
        "Mostly yes,",
        "top performers thrive on structure,",
        "though some creative geniuses prefer absolute chaos.",
        "Normally,",
        "having a predictable schedule saves mental energy for making extremely important business decisions.",
        "However,",
        "some famous artists are deeply set in their ways and refuse any strict timetables completely."
      ],
      "q6": [
        "Q6: Is self-discipline more important than natural talent for success?",
        "Absolutely,",
        "hard work consistently beats raw talent,",
        "especially when talent is lazy.",
        "Fundamentally,",
        "unyielding discipline guarantees continuous improvement,",
        "whereas natural gifts eventually plateau without strict practice.",
        "For example,",
        "a highly disciplined athlete will eventually outrun a naturally fast runner who skips daily training."
      ]
    }
  },
  {
    "week": 34,
    "part_2": {
      "q1": [
        "Describe an occasion when you were not allowed to use your mobile phone.",
        "(Examiner Note: Focus your description on the place/setting where this rule applied) You should say: When it was Where it happened Why you were not allowed to use your phone And explain how you felt about it.",
        "To start with,",
        "I want to talk about my university library,",
        "which is incredibly strict,",
        "and where using phones is entirely prohibited.",
        "Honestly,",
        "the librarians are very disciplined about this policy.",
        "Furthermore,",
        "any loud noise is considered highly disruptive to studying students.",
        "Consequently,",
        "they never bend the rules for anyone.",
        "Therefore,",
        "I always make sure to follow the rules carefully.",
        "Actually,",
        "being a respectful and considerate student is important here.",
        "Moreover,",
        "distractions are completely detrimental to learning.",
        "Ultimately,",
        "I just keep my voice down to avoid trouble."
      ],
      "q2": [
        "Describe a public place where people must be quiet (e.",
        "g.,",
        "Library,",
        "Hospital).",
        "You should say: Where it is How often you go there Why silence is important there And explain how you behave when you are there.",
        "To begin with,",
        "I want to describe a local hospital where silence is absolutely required.",
        "Usually,",
        "I only go there when visiting sick relatives or getting an annual checkup.",
        "Naturally,",
        "keeping quiet is important there because the patients need peace to recover properly.",
        "Frankly,",
        "I always try to walk softly and speak in whispers when I am inside the building.",
        "Ultimately,",
        "it feels a bit tense but entirely necessary.",
        "Looking back,",
        "maintaining a calm environment definitely helps the busy doctors focus on their critical work."
      ],
      "q3": [
        "Describe a place you visited where there were strict rules.",
        "You should say: Where it was What the rules were Why the rules existed And explain if you agreed with the rules.",
        "First of all,",
        "I will talk about a historical museum I visited that had very strict regulations.",
        "Basically,",
        "it was located in Beijing and contained ancient artifacts.",
        "Upon entering,",
        "the rules clearly stated we could not take photos or touch the glass cases.",
        "Honestly,",
        "these rules existed to preserve the delicate items from light damage and human oils.",
        "Personally,",
        "I completely agreed with the rules because protecting history is vital for future generations.",
        "Eventually,",
        "I just enjoyed the tour by looking closely with my own eyes."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: How do young and old people use mobile phones differently?",
        "Generally speaking,",
        "teenagers use phones for entertainment,",
        "whereas seniors mainly use them for calling.",
        "Specifically,",
        "young people love the freedom of social media,",
        "which exerts a massive influence on their daily lives.",
        "For instance,",
        "an elderly person might just check the weather,",
        "while a student watches hours of videos."
      ],
      "q2": [
        "Q2: Do you think it is necessary to have laws on the use of mobile phones?",
        "Absolutely,",
        "strict regulations are crucial,",
        "especially when public safety is directly involved.",
        "Fundamentally,",
        "maintaining basic law and order requires firm restriction on distracted driving.",
        "Therefore,",
        "enforcing steep fines ensures driver compliance and prevents terrible accidents on the highway."
      ],
      "q3": [
        "Q3: Is it a waste of time to take pictures with mobile phones?",
        "In my view,",
        "taking a few photos is wonderful,",
        "but constantly snapping pictures ruins the moment.",
        "Unfortunately,",
        "some tourists completely cross the line by blocking pathways just to get a selfie.",
        "As a result,",
        "they forget basic common courtesy and annoy everyone else around them."
      ],
      "q4": [
        "Q4: Should there be more \"phone-free zones\" in public spaces?",
        "Definitely,",
        "establishing quiet areas is a great idea,",
        "because it forces people to disconnect.",
        "Actually,",
        "proper social etiquette is often forgotten in busy restaurants or cinemas.",
        "For example,",
        "a phone-free cafe allows customers to enjoy genuine conversations without any digital interruptions."
      ],
      "q5": [
        "Q5: How has constant connectivity (always being online) affected mental health?",
        "Sadly,",
        "being always online increases anxiety,",
        "and it disrupts normal sleeping patterns.",
        "Essentially,",
        "the negative consequence of checking notifications at night is chronic exhaustion.",
        "Consequently,",
        "many teenagers suffer from severe stress because they feel pressured to reply to messages instantly."
      ],
      "q6": [
        "Q6: Do rules in society limit our freedom or protect us?",
        "Ultimately,",
        "well-designed laws protect citizens,",
        "even though they impose minor daily limits.",
        "Basically,",
        "without a strong authority enforcing safety guidelines,",
        "chaos would easily destroy communities.",
        "To illustrate,",
        "traffic lights technically restrict movement,",
        "but they prevent fatal collisions at busy intersections."
      ]
    }
  },
  {
    "week": 35,
    "part_2": {
      "q1": [
        "Describe something you plan regularly.",
        "You should say: What it is that you plan regularly How often you plan it What you do to plan it And explain why you plan it and how you feel about planning it.",
        "To begin with,",
        "I want to talk about planning my weekly study timetable,",
        "which keeps me organized,",
        "and which prevents me from feeling anxious.",
        "Honestly,",
        "my school life is incredibly hectic.",
        "Therefore,",
        "I try to plan ahead every Sunday evening.",
        "Actually,",
        "I am very strict about being punctual for classes.",
        "Sometimes,",
        "I get impatient if unexpected events are disruptive to my routine.",
        "During breaks,",
        "I just read a book to kill time.",
        "Ultimately,",
        "getting good grades makes this planning effort worth the wait."
      ],
      "q2": [
        "Describe a time when you waited for something special.",
        "You should say: What you were waiting for How long you waited What you did while waiting And explain how you felt when it finally happened.",
        "To start off,",
        "I want to describe the time I waited for my favorite band to release their new album.",
        "Basically,",
        "I had been waiting for almost three years since their last release.",
        "While waiting,",
        "I joined online fan groups to discuss rumors and watched old concert videos.",
        "Truthfully,",
        "I felt incredibly excited and nervous on the day it finally dropped.",
        "Ultimately,",
        "listening to the fresh songs was an amazing experience that exceeded all my expectations.",
        "Looking back,",
        "the long delay just made the music sound even sweeter."
      ],
      "q3": [
        "Describe a time when you were very busy.",
        "You should say: When it was Why you were so busy How you managed your time And explain how you felt after the busy period was over.",
        "First of all,",
        "I will talk about the week before my final high school exams,",
        "which was intensely busy.",
        "Essentially,",
        "I had to review an entire year of materials for six different subjects.",
        "Consequently,",
        "I managed my time by waking up at dawn and following a strict hour-by-hour schedule.",
        "Honestly,",
        "I felt exhausted and stressed out during that period.",
        "However,",
        "after the busy period was over,",
        "I felt a massive wave of relief.",
        "Finally,",
        "surviving that week taught me a lot about personal endurance."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Is making plans important?",
        "Absolutely,",
        "setting clear goals is crucial,",
        "because it gives people direction in life.",
        "Essentially,",
        "strong time management prevents terrible procrastination and lowers daily stress.",
        "For instance,",
        "writing a simple to-do list helps students finish their homework much faster."
      ],
      "q2": [
        "Q2: Should children plan their future careers?",
        "Definitely,",
        "teenagers should start thinking about jobs early,",
        "but they should remain flexible.",
        "Ultimately,",
        "making education a top priority helps them choose the right university courses later.",
        "However,",
        "since time flies and industries change quickly,",
        "their plans will naturally evolve."
      ],
      "q3": [
        "Q3: Do you think it is important to be a patient person?",
        "Without a doubt,",
        "staying calm is vital,",
        "since rushing often leads to careless mistakes.",
        "In fact,",
        "true efficiency requires a steady pace rather than frantic panic.",
        "Therefore,",
        "doctors must remain completely patient during a long surgery to ensure the patient's safety."
      ],
      "q4": [
        "Q4: Why do some people dislike waiting?",
        "Honestly,",
        "people hate delays,",
        "because they feel their precious time is being stolen.",
        "Specifically,",
        "a strict restriction on someone's daily schedule causes extreme frustration.",
        "For example,",
        "commuters get very angry when a late train makes them miss an important morning meeting."
      ],
      "q5": [
        "Q5: Does modern technology make us more impatient?",
        "Admittedly,",
        "fast internet makes us expect instant results,",
        "which lowers our tolerance for delays.",
        "Consequently,",
        "when a web page takes ten seconds to load,",
        "we struggle with compliance and get annoyed.",
        "As a result,",
        "people frequently try to beat the clock instead of enjoying the current moment."
      ],
      "q6": [
        "Q6: \"Time is money.",
        "\" Do you agree with this statement?",
        "Why or why not?",
        "To a large extent,",
        "I agree,",
        "because wasted hours equal lost earning opportunities.",
        "However,",
        "resting is also valuable,",
        "so perhaps we should say better late than never when finding balance.",
        "For instance,",
        "working constantly creates wealth,",
        "but skipping sleep will eventually destroy your health."
      ]
    }
  },
  {
    "week": 36,
    "part_2": {
      "q1": [
        "Describe a competition (e.",
        "g.,",
        "TV,",
        "school,",
        "or sports) that you took part in.",
        "You should say: What the competition was When it took place What you had to do And explain how you felt about participating in it.",
        "First of all,",
        "I want to describe a school debate tournament,",
        "which was highly prestigious,",
        "and where the atmosphere was incredibly intense.",
        "Honestly,",
        "I felt quite anxious beforehand.",
        "Actually,",
        "the event was very well organized.",
        "Furthermore,",
        "my opponents were extremely competitive.",
        "However,",
        "I decided to give it my all because I wanted to be in it to win it.",
        "Consequently,",
        "I practiced my speech for weeks.",
        "Surprisingly,",
        "our team managed to win hands down.",
        "Ultimately,",
        "feeling victorious and triumphant on stage was simply amazing."
      ],
      "q2": [
        "Describe a prize that you won.",
        "You should say: What the prize was How you won it Who you were competing against And explain how you felt when you received it.",
        "To begin with,",
        "I want to talk about a gold medal I won in a local swimming race.",
        "Basically,",
        "it was a 100-meter freestyle event held at my city's main sports center.",
        "During the race,",
        "I was competing against several very fast swimmers from neighboring high schools.",
        "Truthfully,",
        "I trained for over three months to prepare for that exact moment.",
        "When I touched the wall first and received the shiny medal,",
        "I felt an overwhelming sense of pride.",
        "Looking back,",
        "holding that prize proved that hard work truly pays off."
      ],
      "q3": [
        "Describe a live sports match or competition you watched.",
        "You should say: What the sport was Where you watched it Who was playing And explain why it was exciting to watch.",
        "To start off,",
        "I will describe a live basketball match I watched at a huge stadium last winter.",
        "Essentially,",
        "it was the final game of the national high school championship.",
        "The stadium was packed with thousands of screaming fans,",
        "creating a deafening noise.",
        "Personally,",
        "it was incredibly exciting to watch because both teams played with incredible speed and skill.",
        "Furthermore,",
        "the score was tied until the very last second when a player hit a spectacular three-point shot.",
        "Ultimately,",
        "the raw energy of a live crowd is impossible to replicate at home."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do people like to participate in competitions?",
        "Generally,",
        "people enjoy contests,",
        "because they love testing their limits against others.",
        "Fundamentally,",
        "a healthy rivalry provides immense motivation and boosts personal determination.",
        "For example,",
        "runners often achieve their fastest times during a real race rather than during lonely practice sessions."
      ],
      "q2": [
        "Q2: Is it good to teach children to be competitive at a young age?",
        "In my opinion,",
        "mild competition is fine,",
        "but intense pressure hurts young minds.",
        "Essentially,",
        "kids need to learn good sportsmanship rather than obsessing over winning.",
        "Therefore,",
        "emphasizing fun creates a win-win situation where every child feels valued regardless of the final score."
      ],
      "q3": [
        "Q3: What skills can people learn from team sports that they cannot learn from individual sports?",
        "Undeniably,",
        "group sports teach incredible teamwork,",
        "which individual sports simply cannot provide.",
        "Specifically,",
        "players learn strict cooperation and trust by relying on their peers.",
        "For instance,",
        "a soccer player must pass the ball unselfishly to secure a victory for the whole squad."
      ],
      "q4": [
        "Q4: Do you think companies encourage competition between employees?",
        "Is this healthy?",
        "Admittedly,",
        "many businesses push internal contests,",
        "yet this often ruins office harmony.",
        "Actually,",
        "if management makes sales targets the only priority,",
        "employees might sabotage each other.",
        "Consequently,",
        "it is usually much healthier to reward collective team success rather than praising cut-throat individuals."
      ],
      "q5": [
        "Q5: Why are reality TV competitions (like singing or cooking shows) so popular globally?",
        "Honestly,",
        "television contests are engaging,",
        "because viewers love dramatic human stories.",
        "Furthermore,",
        "watching ordinary people compete on a level playing field is deeply inspiring.",
        "As an illustration,",
        "a singing show allows an unknown amateur to become a global superstar overnight."
      ],
      "q6": [
        "Q6: Is \"winning\" the only thing that matters in professional sports?",
        "Unfortunately,",
        "winning is heavily prioritized,",
        "though fan entertainment is also crucial.",
        "Essentially,",
        "professional athletes must constantly keep their eye on the ball to secure lucrative contracts.",
        "As a result,",
        "a football coach will quickly be fired if his team loses multiple games,",
        "despite playing beautifully."
      ]
    }
  },
  {
    "week": 37,
    "part_2": {
      "q1": [
        "Describe a neighbor you have who is interesting or helpful.",
        "You should say: Who this person is How long you have known them How often you see them And explain why you think they are interesting/helpful.",
        "To begin with,",
        "I want to talk about my next-door neighbor,",
        "who is incredibly neighborly,",
        "and who always smiles.",
        "Honestly,",
        "he is a very helpful and generous elderly man.",
        "Actually,",
        "some people in our building are quite nosy or overly competitive.",
        "However,",
        "he is just remarkably considerate without any intense drama.",
        "For instance,",
        "he will gladly keep an eye on my cat when I travel.",
        "Furthermore,",
        "he is always ready to lend a hand with heavy groceries.",
        "Ultimately,",
        "having someone so reliable living nearby is a huge blessing."
      ],
      "q2": [
        "Describe a person who contributes a lot to your local community.",
        "You should say: Who the person is What they do for the community Why they do it And explain how their actions affect the neighborhood.",
        "First of all,",
        "I will describe a local volunteer who contributes massively to our neighborhood.",
        "Basically,",
        "she is a retired school teacher who organizes weekly park clean-up events.",
        "She does this simply because she hates seeing litter and wants children to have a safe place to play.",
        "Over the past year,",
        "her actions have completely transformed the park into a beautiful,",
        "green space.",
        "Furthermore,",
        "her dedication has inspired many other teenagers to join the cause.",
        "Overall,",
        "she is a true local hero who brings positive energy to everyone around her."
      ],
      "q3": [
        "Describe a time you helped a neighbor.",
        "You should say: What the problem was How you helped What the result was And explain how you felt about helping them.",
        "To start off,",
        "I want to describe a time when I assisted an elderly neighbor with a technical problem.",
        "Essentially,",
        "her Wi-Fi router stopped working,",
        "and she could not video call her grandchildren overseas.",
        "Because she was quite upset,",
        "I went over to her apartment to troubleshoot the issue.",
        "Quickly,",
        "I realized the cables were just plugged in incorrectly and fixed it within five minutes.",
        "Honestly,",
        "I felt wonderfully warm and happy seeing her smile appear on the screen.",
        "Looking back,",
        "small acts of kindness can make a huge difference in someone's day."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: What are the qualities of a \"good neighbor\"?",
        "Generally speaking,",
        "a good neighbor is quiet,",
        "and they respect boundaries.",
        "In fact,",
        "the old saying good fences make good neighbors highlights the deep need for personal privacy.",
        "Therefore,",
        "being polite but not overly intrusive creates the most peaceful living environment."
      ],
      "q2": [
        "Q2: How has the relationship between neighbors changed compared to the past?",
        "Undeniably,",
        "people are much less connected now,",
        "because they live busier lives.",
        "Historically,",
        "close village cooperation was essential for survival,",
        "but modern convenience has ruined that.",
        "Consequently,",
        "today's rapid urbanization means people often do not even know the names of people living next door."
      ],
      "q3": [
        "Q3: Why do people in big cities often not know their neighbors?",
        "Mainly,",
        "high-rise apartments create physical barriers,",
        "which severely limit daily interaction.",
        "Furthermore,",
        "the fast pace of city life creates a sad sense of social isolation.",
        "For instance,",
        "commuters arrive home exhausted and immediately lock their doors instead of chatting in the hallway."
      ],
      "q4": [
        "Q4: Do you think community centers are important for a neighborhood?",
        "Absolutely,",
        "local centers are incredibly important,",
        "as they provide a shared gathering space.",
        "Essentially,",
        "they help build a strong community by hosting events that are close to home.",
        "As an illustration,",
        "a local hall offering free dance classes helps strangers become fast friends."
      ],
      "q5": [
        "Q5: How can neighbors help each other in times of crisis or emergency?",
        "During disasters,",
        "neighbors are the first responders,",
        "because they are physically closest.",
        "Fundamentally,",
        "when a storm hits,",
        "people must drop any petty rivalry and quickly look out for each other.",
        "For example,",
        "sharing emergency food supplies and checking on elderly residents ensures everyone's basic security."
      ],
      "q6": [
        "Q6: Should there be laws to control noisy neighbors?",
        "Definitely,",
        "noise regulations are absolutely necessary,",
        "since constant loud sounds ruin mental health.",
        "Actually,",
        "everyone deserves a quiet place to sleep after a long,",
        "exhausting day of work.",
        "Therefore,",
        "police should be able to fine people who blast loud music at two in the morning."
      ]
    }
  },
  {
    "week": 38,
    "part_2": {
      "q1": [
        "Describe a place near water (such as a river,",
        "lake,",
        "or the ocean) that you enjoyed visiting.",
        "You should say: Where this place was What you did there Who you went with And explain why you liked this place.",
        "To begin with,",
        "I want to describe a serene bay,",
        "which is incredibly breathtaking,",
        "and which I visited last summer.",
        "Honestly,",
        "the water there is absolutely crystal clear and perfectly safe for swimming.",
        "Furthermore,",
        "the local people are extremely neighborly and welcoming to all tourists.",
        "Actually,",
        "the beach is just a stone's throw away from a very comfortable hotel.",
        "During the day,",
        "I simply loved to soak up the sun on the warm sand.",
        "Moreover,",
        "the cool ocean breeze felt so refreshing.",
        "Thankfully,",
        "the beautiful coastal environment was not polluted at all.",
        "Ultimately,",
        "nature was very generous to this stunning place."
      ],
      "q2": [
        "Describe a holiday destination you would like to visit.",
        "You should say: Where it is located How you would travel there What you would do there And explain why this place attracts you.",
        "First of all,",
        "I would love to visit the beautiful islands of Hawaii for a tropical holiday.",
        "Basically,",
        "it is located in the middle of the Pacific Ocean and boasts incredible natural landscapes.",
        "Hopefully,",
        "I would travel there by airplane with my closest friends during the winter break.",
        "While there,",
        "I would spend my days surfing,",
        "hiking up dormant volcanoes,",
        "and eating fresh seafood.",
        "Frankly,",
        "this place attracts me because I desperately need a break from my busy city life.",
        "Ultimately,",
        "experiencing their unique island culture sounds like an absolute dream come true."
      ],
      "q3": [
        "Describe a place in your country that is famous for its natural beauty.",
        "You should say: Where it is What it looks like Why it is famous And explain if you think it is a good place for tourists.",
        "To start off,",
        "I want to talk about Jiuzhaigou,",
        "which is a famous nature reserve in Sichuan province.",
        "Essentially,",
        "it features spectacular multi-colored lakes,",
        "massive waterfalls,",
        "and dense green forests.",
        "Historically,",
        "it is famous because the water changes colors depending on the season and the sunlight.",
        "Personally,",
        "I think it is an incredibly good place for tourists who love outdoor photography.",
        "However,",
        "it can get overly crowded during the national holidays.",
        "Looking back,",
        "preserving this stunning natural heritage is absolutely vital for our country's future generations to enjoy."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do so many people like to live near the water?",
        "Generally speaking,",
        "coastal areas offer beautiful views,",
        "and they provide a very relaxing lifestyle.",
        "Furthermore,",
        "living near the ocean gives people easy access to fresh air and fun water sports.",
        "For example,",
        "many individuals move to maritime cities specifically to enjoy sailing or daily beach walks."
      ],
      "q2": [
        "Q2: What are the dangers of water pollution to society?",
        "Undeniably,",
        "contaminated rivers threaten human health,",
        "and they severely damage the local biodiversity.",
        "Consequently,",
        "toxic chemicals from rapid urbanization can easily poison drinking water supplies.",
        "As a result,",
        "poor water security leads to terrible disease outbreaks in many developing nations."
      ],
      "q3": [
        "Q3: Should the government limit tourism in environmentally sensitive areas?",
        "Absolutely,",
        "strict limits are necessary,",
        "because crowds can easily destroy fragile natural habitats.",
        "Fundamentally,",
        "prioritizing environmental conservation is much more important than generating short-term tourism profits.",
        "Therefore,",
        "capping visitor numbers helps turn the tide against severe ecological degradation."
      ],
      "q4": [
        "Q4: How important is water transportation (shipping) to the global economy?",
        "In my opinion,",
        "shipping is absolutely vital,",
        "since it enables massive international trade.",
        "Actually,",
        "moving heavy cargo via ocean transportation is significantly cheaper than using airplanes.",
        "For instance,",
        "giant cargo ships continuously transport millions of tons of electronics and clothing across the globe daily."
      ],
      "q5": [
        "Q5: Do you think future wars will be fought over water resources?",
        "Sadly,",
        "this is highly likely,",
        "as clean water is becoming incredibly scarce worldwide.",
        "Essentially,",
        "climate change and overpopulation are rapidly depleting every vital freshwater resource.",
        "Consequently,",
        "neighboring countries sharing a single drying river might easily go to war to survive."
      ],
      "q6": [
        "Q6: How can individuals reduce their water consumption in daily life?",
        "Realistically,",
        "small daily habits matter,",
        "even if they seem like a drop in the ocean.",
        "Moreover,",
        "fixing leaky pipes and taking much shorter showers can collectively save thousands of gallons.",
        "By doing this,",
        "individual citizens can truly make waves in global water preservation efforts."
      ]
    }
  },
  {
    "week": 39,
    "part_2": {
      "q1": [
        "Describe a uniform you have worn (e.",
        "g.,",
        "at school or work).",
        "You should say: When you wore it What it looked like Who provided it And explain how you felt about wearing it.",
        "To begin with,",
        "I want to describe my high school uniform,",
        "which was quite formal,",
        "and which I wore every day.",
        "Honestly,",
        "the dark blue color looked very serene and professional.",
        "Actually,",
        "the blazer was tailored to fit like a glove on me.",
        "Furthermore,",
        "wearing it made me feel quite stylish and incredibly elegant.",
        "Conversely,",
        "some students thought the design was totally outdated.",
        "However,",
        "I liked it because the cotton fabric was highly comfortable and refreshing in summer.",
        "Ultimately,",
        "I always looked dressed to kill for school.",
        "Overall,",
        "I felt like a true trendsetter in my class."
      ],
      "q2": [
        "Describe a piece of clothing you like to wear on special occasions.",
        "You should say: What it is Where you bought it When you wear it And explain why you like it.",
        "First of all,",
        "I want to talk about a beautiful silk dress I save for important celebrations.",
        "Actually,",
        "I bought it from a lovely boutique in the city center during a major sale last year.",
        "Typically,",
        "I only wear it to formal events like weddings or fancy dinner parties.",
        "Frankly,",
        "I love this dress because the deep emerald green color compliments my skin tone perfectly.",
        "Furthermore,",
        "the lightweight fabric makes it incredibly easy to move and dance in.",
        "Ultimately,",
        "putting it on instantly boosts my confidence and makes me feel exceptionally glamorous for the entire evening."
      ],
      "q3": [
        "Describe a traditional piece of clothing from your country.",
        "You should say: What it is called Who wears it When people usually wear it And explain the cultural significance of this clothing.",
        "To start off,",
        "I will describe the Qipao,",
        "which is a highly famous traditional Chinese dress.",
        "Generally,",
        "it is worn by women and features a high collar with intricate silk embroidery.",
        "Nowadays,",
        "people usually wear it during significant cultural festivals like the Lunar New Year or at traditional weddings.",
        "Personally,",
        "I believe its cultural significance is massive because it beautifully represents historical Chinese artistry.",
        "Moreover,",
        "the modern versions have evolved to combine classic elegance with contemporary fashion trends.",
        "Looking back,",
        "seeing someone wear a beautifully crafted Qipao always fills me with a deep sense of national pride."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Why do some companies and schools require people to wear uniforms?",
        "Generally speaking,",
        "uniforms enforce strict uniformity,",
        "which instantly creates a sense of equality.",
        "Specifically,",
        "removing brand-name clothing prevents poorer students from becoming targets for cruel bullying.",
        "As a result,",
        "a shared identity helps everyone focus on their actual work rather than their fashion choices."
      ],
      "q2": [
        "Q2: Do you think people are judged too much by the clothes they wear?",
        "Unfortunately,",
        "society heavily judges appearances,",
        "because clothes often signal a person's financial status.",
        "Basically,",
        "human beings naturally form quick first impressions based entirely on visual cues.",
        "Therefore,",
        "people tend to judge a book by its cover when they meet someone dressed in cheap clothing."
      ],
      "q3": [
        "Q3: How has fashion changed in your country in recent years?",
        "Undeniably,",
        "fashion has become much more diverse,",
        "and western styles are extremely popular.",
        "Furthermore,",
        "young people use clothing as a powerful form of bold self expression today.",
        "For instance,",
        "teenagers now mix traditional garments with modern sneakers to create totally unique outfits."
      ],
      "q4": [
        "Q4: Is it necessary to follow the latest fashion trends?",
        "In my opinion,",
        "chasing trends is completely unnecessary,",
        "as personal comfort matters more.",
        "Actually,",
        "being a slave to fashion is exhausting and extremely expensive over time.",
        "Consequently,",
        "a fashion victim will waste thousands of dollars buying bizarre clothes they only wear once."
      ],
      "q5": [
        "Q5: Do you think expensive designer clothes are worth the money?",
        "Honestly,",
        "luxury brands are rarely worth the huge price tag,",
        "though their quality is good.",
        "Essentially,",
        "you are mostly paying for the famous logo rather than the actual textile itself.",
        "Therefore,",
        "you can easily find durable,",
        "stylish clothes at normal stores for a fraction of the cost."
      ],
      "q6": [
        "Q6: Does the \"fast fashion\" industry (cheap,",
        "disposable clothing) harm the environment?",
        "Absolutely,",
        "fast fashion is disastrous,",
        "because it pollutes rivers and creates massive waste.",
        "Fundamentally,",
        "throwing away cheap shirts constantly drains every natural resource we have left.",
        "Instead,",
        "promoting clothing recycling and mindful conservation is the only way to save our planet."
      ]
    }
  },
  {
    "week": 40,
    "part_2": {
      "q1": [
        "Describe an important traditional festival in your country.",
        "You should say: When the festival takes place What people do during this festival What special food is eaten And explain why this festival is important.",
        "To begin with,",
        "I want to describe the Spring Festival,",
        "which is highly traditional,",
        "and which brings families together.",
        "Honestly,",
        "the atmosphere is incredibly festive and vibrant everywhere.",
        "Actually,",
        "eating dumplings together is a deeply meaningful and ceremonial custom.",
        "Furthermore,",
        "we always dress in formal and elegant red clothing to welcome the new year.",
        "Later,",
        "my friends and I usually go out to paint the town red with fireworks.",
        "Consequently,",
        "we always manage to have a ball.",
        "Ultimately,",
        "since the more the merrier,",
        "large gatherings are simply the best part."
      ],
      "q2": [
        "Describe a party or celebration you attended.",
        "You should say: What the celebration was for (e.",
        "g.,",
        "wedding,",
        "birthday) Who was there What happened at the party And explain whether you enjoyed it or not.",
        "First of all,",
        "I want to describe a wonderful birthday party I attended for my best friend last month.",
        "Basically,",
        "it was a surprise celebration held at a lovely rooftop restaurant in the city.",
        "Unsurprisingly,",
        "all of her close colleagues and university friends were there hiding in the dark.",
        "When she finally arrived,",
        "we all shouted and threw colorful confetti everywhere.",
        "Frankly,",
        "I enjoyed it immensely because the food was delicious and the music was fantastic.",
        "Furthermore,",
        "seeing her genuine tears of joy made the entire evening incredibly special.",
        "Overall,",
        "it was a perfectly planned night."
      ],
      "q3": [
        "Describe a national holiday in your country.",
        "You should say: What day it is The history behind it How you usually spend this day And explain why it is significant to your nation.",
        "To start off,",
        "I will talk about National Day,",
        "which is a massive public holiday in my country.",
        "Essentially,",
        "it takes place on the first of October to commemorate the founding of our nation.",
        "Normally,",
        "people enjoy a seven-day golden week vacation during this exciting period.",
        "Personally,",
        "I usually spend this time traveling with my family or simply relaxing at home to avoid the huge crowds.",
        "Furthermore,",
        "watching the grand military parade on television is a proud tradition for many citizens.",
        "Ultimately,",
        "it is highly significant because it fosters a strong sense of unity and patriotism."
      ]
    },
    "part_3": {
      "q1": [
        "Q1: Is globalization causing young people to lose interest in traditional festivals?",
        "Admittedly,",
        "Western holidays are trending,",
        "but local traditions remain deeply important to the youth.",
        "While globalization introduces new celebrations,",
        "young people still respect their roots to maintain cultural identity.",
        "For instance,",
        "teenagers might celebrate Christmas for fun,",
        "but they still prioritize the Lunar New Year."
      ],
      "q2": [
        "Q2: Do you think festivals have become too commercialized (focused on money/shopping)?",
        "Unfortunately,",
        "heavy marketing has ruined holidays,",
        "because businesses only care about maximizing their profits.",
        "Consequently,",
        "the extreme commercialization of events like Valentine's Day pressures people into buying expensive,",
        "useless gifts.",
        "As a result,",
        "the original emotional expression of love is entirely replaced by pure consumerism."
      ],
      "q3": [
        "Q3: Why are public holidays important for the workforce?",
        "Undeniably,",
        "days off are crucial,",
        "since they prevent severe burnout among exhausted employees.",
        "Fundamentally,",
        "returning to work feeling rested and in high spirits drastically improves overall productivity.",
        "Therefore,",
        "a long weekend allows stressed office workers to properly rest and spend time with their families."
      ],
      "q4": [
        "Q4: How do festivals help to preserve a country's culture?",
        "Essentially,",
        "annual celebrations pass down customs,",
        "which actively prevents historical knowledge from dying completely.",
        "Furthermore,",
        "practicing old rituals guarantees the preservation of a nation's unique intangible heritage.",
        "For example,",
        "teaching children how to make traditional mooncakes helps to keep tradition alive forever."
      ],
      "q5": [
        "Q5: Should immigrants learn about the festivals of their new country?",
        "Absolutely,",
        "learning local customs is vital,",
        "as it promotes smooth social integration.",
        "Actually,",
        "participating in national events helps newcomers feel included in the modern cultural melting pot.",
        "As an illustration,",
        "an expat joining a local Thanksgiving dinner quickly builds strong bonds with their new neighbors."
      ],
      "q6": [
        "Q6: What is the difference between how children and adults enjoy festivals?",
        "Generally speaking,",
        "kids love the games,",
        "whereas adults appreciate the rare chance to relax.",
        "Basically,",
        "children focus entirely on receiving fun toys or eating lots of sweet candy.",
        "Conversely,",
        "tired parents enjoy festivals simply by catching up with old friends over a very quiet meal."
      ]
    }
  }
]