[
  {
    "week": 1,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "When did you make your parents proud?",
        "band_6_plus_peer_question": "Is getting good grades the only way to make parents proud?"
      },
      "q2": {
        "band_5_peer_question": "How did your parents show they were proud?",
        "band_6_plus_peer_question": "Does praise make children more confident?"
      },
      "q3": {
        "band_5_peer_question": "How does this help you every day?",
        "band_6_plus_peer_question": "Is it bad to be too proud of yourself?"
      },
      "q4": {
        "band_5_peer_question": "Who shared this proud moment with you?",
        "band_6_plus_peer_question": "Why is it good to feel proud of yourself?"
      },
      "q5": {
        "band_5_peer_question": "How does a happy family help the neighborhood?",
        "band_6_plus_peer_question": "Can too much family pride cause problems with others?"
      },
      "q6": {
        "band_5_peer_question": "What did 'success' mean to your grandparents?",
        "band_6_plus_peer_question": "How will 'success' change in the future?"
      }
    }
  },
  {
    "week": 2,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Why do foreign students often work in cafes?",
        "band_6_plus_peer_question": "Will computers take away basic jobs for foreigners?"
      },
      "q2": {
        "band_5_peer_question": "What is the best part of working abroad?",
        "band_6_plus_peer_question": "Are the problems of working abroad worth the money?"
      },
      "q3": {
        "band_5_peer_question": "Do your parents want you to work abroad?",
        "band_6_plus_peer_question": "Do parents think differently about working abroad now?"
      },
      "q4": {
        "band_5_peer_question": "What do people miss most when they leave home?",
        "band_6_plus_peer_question": "How can companies help foreign workers feel less lonely?"
      },
      "q5": {
        "band_5_peer_question": "How does working abroad help you learn a language?",
        "band_6_plus_peer_question": "How does working in another country make you a better leader?"
      },
      "q6": {
        "band_5_peer_question": "What happens if all local doctors leave a country?",
        "band_6_plus_peer_question": "How can governments stop smart workers from leaving?"
      }
    }
  },
  {
    "week": 3,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What job did you want as a kid?",
        "band_6_plus_peer_question": "Do movies change what jobs kids want?"
      },
      "q2": {
        "band_5_peer_question": "Is it better to have a fun job or a rich job?",
        "band_6_plus_peer_question": "Is it hard to keep a job safe nowadays?"
      },
      "q3": {
        "band_5_peer_question": "Can you name a fun job that pays badly?",
        "band_6_plus_peer_question": "Would you take less money for more free time?"
      },
      "q4": {
        "band_5_peer_question": "Why do doctors get paid more than shop workers?",
        "band_6_plus_peer_question": "Is it fair that actors make more money than nurses?"
      },
      "q5": {
        "band_5_peer_question": "How has your dream job changed since high school?",
        "band_6_plus_peer_question": "Why do adults give up on their dream jobs?"
      },
      "q6": {
        "band_5_peer_question": "Could a robot do your dream job?",
        "band_6_plus_peer_question": "Should the government give money to people who lose jobs to robots?"
      }
    }
  },
  {
    "week": 4,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "How do you choose a movie to watch?",
        "band_6_plus_peer_question": "Do fake online reviews make people trust critics less?"
      },
      "q2": {
        "band_5_peer_question": "What is your favorite kind of movie?",
        "band_6_plus_peer_question": "Why do funny movies usually make more money than serious ones?"
      },
      "q3": {
        "band_5_peer_question": "Tell me about a historical movie you watched.",
        "band_6_plus_peer_question": "Should historical movies be exactly true or just fun?"
      },
      "q4": {
        "band_5_peer_question": "Who is your favorite actor and why?",
        "band_6_plus_peer_question": "Do famous actors take jobs away from new actors?"
      },
      "q5": {
        "band_5_peer_question": "What is your favorite cartoon?",
        "band_6_plus_peer_question": "How are Japanese cartoons different from American ones?"
      },
      "q6": {
        "band_5_peer_question": "Should famous actors get a lot of money?",
        "band_6_plus_peer_question": "Would paying actors less make movies better?"
      }
    }
  },
  {
    "week": 5,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What do you recycle at home?",
        "band_6_plus_peer_question": "Is recycling enough, or do we need strict laws?"
      },
      "q2": {
        "band_5_peer_question": "Name a wild animal that needs help.",
        "band_6_plus_peer_question": "What happens to our food if animals die out?"
      },
      "q3": {
        "band_5_peer_question": "How does dirty air make you feel?",
        "band_6_plus_peer_question": "How can poor countries grow without hurting nature?"
      },
      "q4": {
        "band_5_peer_question": "Have you ever seen solar panels?",
        "band_6_plus_peer_question": "Why is it hard for countries to use clean energy?"
      },
      "q5": {
        "band_5_peer_question": "What did you learn about nature in school?",
        "band_6_plus_peer_question": "Do school lessons work if parents don't care about nature?"
      },
      "q6": {
        "band_5_peer_question": "Why must countries work together to stop pollution?",
        "band_6_plus_peer_question": "How should we punish countries that pollute too much?"
      }
    }
  },
  {
    "week": 6,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "How do you feel in a quiet park?",
        "band_6_plus_peer_question": "Why do city people need to visit nature?"
      },
      "q2": {
        "band_5_peer_question": "Do you like tall buildings or tall trees?",
        "band_6_plus_peer_question": "How can cities add more trees to their streets?"
      },
      "q3": {
        "band_5_peer_question": "Do you have plants in your room?",
        "band_6_plus_peer_question": "Is it bad for kids to grow up without seeing nature?"
      },
      "q4": {
        "band_5_peer_question": "Why do people throw trash on the street?",
        "band_6_plus_peer_question": "Are people naturally selfish with nature?"
      },
      "q5": {
        "band_5_peer_question": "What makes you stressed in a busy city?",
        "band_6_plus_peer_question": "Do small parks really help people relax?"
      },
      "q6": {
        "band_5_peer_question": "Is it okay to cut down trees for a hospital?",
        "band_6_plus_peer_question": "Why should a city save a forest instead of building factories?"
      }
    }
  },
  {
    "week": 7,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What app do your grandparents use?",
        "band_6_plus_peer_question": "Is it hard to make an app for both kids and old people?"
      },
      "q2": {
        "band_5_peer_question": "Do you turn off your phone to avoid messages?",
        "band_6_plus_peer_question": "Do too many messages make people feel tired?"
      },
      "q3": {
        "band_5_peer_question": "How often do you open your chat app?",
        "band_6_plus_peer_question": "Is it dangerous to use one app for everything?"
      },
      "q4": {
        "band_5_peer_question": "What would you do without your phone for a week?",
        "band_6_plus_peer_question": "Do map apps make us bad at finding our way?"
      },
      "q5": {
        "band_5_peer_question": "Do you worry when an app tracks where you are?",
        "band_6_plus_peer_question": "Should companies be allowed to sell our phone data?"
      },
      "q6": {
        "band_5_peer_question": "Do you prefer a real shop worker or a machine?",
        "band_6_plus_peer_question": "What jobs can robots never do?"
      }
    }
  },
  {
    "week": 8,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What should you think about before giving advice?",
        "band_6_plus_peer_question": "Can bad advice ruin a friendship?"
      },
      "q2": {
        "band_5_peer_question": "Have you ever asked strangers online for help?",
        "band_6_plus_peer_question": "Is it dangerous to ask the internet for big life choices?"
      },
      "q3": {
        "band_5_peer_question": "Why must a doctor be a good listener?",
        "band_6_plus_peer_question": "How do doctors listen to sad problems without feeling sad?"
      },
      "q4": {
        "band_5_peer_question": "How do you feel when friends give opposite advice?",
        "band_6_plus_peer_question": "Is it bad to always ask others before making a choice?"
      },
      "q5": {
        "band_5_peer_question": "What is the best advice your grandparents gave you?",
        "band_6_plus_peer_question": "Do young people today have the same problems as old people did?"
      },
      "q6": {
        "band_5_peer_question": "Why is it sometimes easier to talk to a stranger?",
        "band_6_plus_peer_question": "Why is a doctor's advice better than a friend's advice?"
      }
    }
  },
  {
    "week": 9,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "How is a real painting different from a phone picture?",
        "band_6_plus_peer_question": "Does a quiet museum make art look better?"
      },
      "q2": {
        "band_5_peer_question": "Would you visit museums more if they were free?",
        "band_6_plus_peer_question": "If museums are free, who should pay to fix the art?"
      },
      "q3": {
        "band_5_peer_question": "Has a museum ever made you want to learn more?",
        "band_6_plus_peer_question": "Does looking at old art help us understand life today?"
      },
      "q4": {
        "band_5_peer_question": "What did you like to draw as a kid?",
        "band_6_plus_peer_question": "Does being a busy adult make you less creative?"
      },
      "q5": {
        "band_5_peer_question": "Did you like art class in primary school?",
        "band_6_plus_peer_question": "Is it bad if schools care more about math than art?"
      },
      "q6": {
        "band_5_peer_question": "Does playing music make you smarter?",
        "band_6_plus_peer_question": "Can learning art help people invent new technology?"
      }
    }
  },
  {
    "week": 10,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Is it fair to pay to see old buildings?",
        "band_6_plus_peer_question": "If tickets are expensive, can poor people learn about history?"
      },
      "q2": {
        "band_5_peer_question": "Do you want to live in a tall building or a house?",
        "band_6_plus_peer_question": "Why do so many people live in tall apartments now?"
      },
      "q3": {
        "band_5_peer_question": "What are the bad things about living in an old house?",
        "band_6_plus_peer_question": "Do people care more about fast internet or old building styles?"
      },
      "q4": {
        "band_5_peer_question": "Do you like modern glass buildings or old wooden ones?",
        "band_6_plus_peer_question": "Why do old people and young people like different buildings?"
      },
      "q5": {
        "band_5_peer_question": "Is there a famous building that makes you proud?",
        "band_6_plus_peer_question": "If a city loses its old buildings, do people feel less proud?"
      },
      "q6": {
        "band_5_peer_question": "Should we destroy an old temple to build a train station?",
        "band_6_plus_peer_question": "How can cities grow bigger without destroying old buildings?"
      }
    }
  },
  {
    "week": 11,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Besides phones, what tech do your friends use?",
        "band_6_plus_peer_question": "How have VR games changed the way kids play?"
      },
      "q2": {
        "band_5_peer_question": "How does your phone make your life easier?",
        "band_6_plus_peer_question": "Are we too lazy because machines do everything for us?"
      },
      "q3": {
        "band_5_peer_question": "Is it easier to tell a joke in person or in a text?",
        "band_6_plus_peer_question": "Does texting all the time make people feel lonely?"
      },
      "q4": {
        "band_5_peer_question": "Is it unfair if some students cannot buy a laptop?",
        "band_6_plus_peer_question": "Can free online classes help poor students succeed?"
      },
      "q5": {
        "band_5_peer_question": "Do you feel nervous calling a stranger on the phone?",
        "band_6_plus_peer_question": "Will people forget how to talk face-to-face in the future?"
      },
      "q6": {
        "band_5_peer_question": "Are you worried computers will become too smart?",
        "band_6_plus_peer_question": "How can governments stop AI from being dangerous?"
      }
    }
  },
  {
    "week": 12,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Do you remember street names in a new place?",
        "band_6_plus_peer_question": "Do people get lost easily because they look at their phones?"
      },
      "q2": {
        "band_5_peer_question": "What do you always pack for a trip?",
        "band_6_plus_peer_question": "Does planning a trip too much make it less fun?"
      },
      "q3": {
        "band_5_peer_question": "Who should you ask for help if you are lost?",
        "band_6_plus_peer_question": "Without a phone, how can you find your way?"
      },
      "q4": {
        "band_5_peer_question": "Have you ever used a real paper map?",
        "band_6_plus_peer_question": "Why do mountain climbers still use paper maps?"
      },
      "q5": {
        "band_5_peer_question": "Could you walk to school without your phone?",
        "band_6_plus_peer_question": "Does using map apps make our brains lazy?"
      },
      "q6": {
        "band_5_peer_question": "Can you learn anything by getting lost in a new city?",
        "band_6_plus_peer_question": "Does getting lost in a foreign country make you braver?"
      }
    }
  },
  {
    "week": 13,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Would you like to be a famous movie star?",
        "band_6_plus_peer_question": "Is it bad for children to be famous at a young age?"
      },
      "q2": {
        "band_5_peer_question": "What kind of videos make kids famous online?",
        "band_6_plus_peer_question": "Does the internet make it too easy for untalented people to get famous?"
      },
      "q3": {
        "band_5_peer_question": "Do good-looking people get famous more easily?",
        "band_6_plus_peer_question": "Do people care more about bad celebrity news than real talent?"
      },
      "q4": {
        "band_5_peer_question": "What is your favorite sport to play at school?",
        "band_6_plus_peer_question": "How do team sports help students forget about study stress?"
      },
      "q5": {
        "band_5_peer_question": "Is it annoying when fans take photos of singers?",
        "band_6_plus_peer_question": "Is losing privacy a fair price for being rich and famous?"
      },
      "q6": {
        "band_5_peer_question": "If a famous player does bad things, will kids copy them?",
        "band_6_plus_peer_question": "Should companies fire famous people who do bad things?"
      }
    }
  },
  {
    "week": 14,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Are big shopping malls too crowded for you?",
        "band_6_plus_peer_question": "Do giant malls destroy small local shops?"
      },
      "q2": {
        "band_5_peer_question": "What is the most fun thing to do in a mall?",
        "band_6_plus_peer_question": "Do people go to malls just to relax instead of buying things?"
      },
      "q3": {
        "band_5_peer_question": "Do you prefer paying with cash or your phone?",
        "band_6_plus_peer_question": "Does paying with a phone make money feel less real?"
      },
      "q4": {
        "band_5_peer_question": "What happens if you want lunch but your phone is dead?",
        "band_6_plus_peer_question": "Does paying by phone make people spend too much money?"
      },
      "q5": {
        "band_5_peer_question": "Why do people buy shoes online instead of at a shop?",
        "band_6_plus_peer_question": "How can real street shops survive against internet shopping?"
      },
      "q6": {
        "band_5_peer_question": "Are you happy when you buy a new toy? Does it last?",
        "band_6_plus_peer_question": "How can we stop people from buying things and throwing them away?"
      }
    }
  },
  {
    "week": 15,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What would make you visit a library more often?",
        "band_6_plus_peer_question": "Can free internet in libraries help poor students learn?"
      },
      "q2": {
        "band_5_peer_question": "Do you like the feeling of holding a real book?",
        "band_6_plus_peer_question": "Why do some teachers think paper books are better for learning?"
      },
      "q3": {
        "band_5_peer_question": "Did your parents read to you when you were little?",
        "band_6_plus_peer_question": "Do stories help children understand what is right and wrong?"
      },
      "q4": {
        "band_5_peer_question": "Do you prefer stories about dragons or real history?",
        "band_6_plus_peer_question": "Does liking history show that a teenager is growing up?"
      },
      "q5": {
        "band_5_peer_question": "Is it hard for you to sit and read for an hour?",
        "band_6_plus_peer_question": "Have short internet videos ruined our ability to read long books?"
      },
      "q6": {
        "band_5_peer_question": "How do you learn about your grandparents' lives?",
        "band_6_plus_peer_question": "Why are spoken stories sometimes better than history books?"
      }
    }
  },
  {
    "week": 16,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What is something funny that happened at school?",
        "band_6_plus_peer_question": "Does laughing together make work less stressful?"
      },
      "q2": {
        "band_5_peer_question": "Do you always smile when someone takes a photo?",
        "band_6_plus_peer_question": "Does pretending to be happy online make people feel sad inside?"
      },
      "q3": {
        "band_5_peer_question": "Is it okay to cry when you feel sad?",
        "band_6_plus_peer_question": "Is it dangerous to hide your sadness at work for a long time?"
      },
      "q4": {
        "band_5_peer_question": "Why are boys often told they shouldn't cry?",
        "band_6_plus_peer_question": "Should schools teach boys that it is okay to show their feelings?"
      },
      "q5": {
        "band_5_peer_question": "Would you rather have a serious boss or a funny boss?",
        "band_6_plus_peer_question": "How do jokes from a boss make workers feel more relaxed?"
      },
      "q6": {
        "band_5_peer_question": "Are American jokes always funny in China?",
        "band_6_plus_peer_question": "Why is it so hard to translate a joke into another language?"
      }
    }
  },
  {
    "week": 17,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Do you talk about the same things with friends and parents?",
        "band_6_plus_peer_question": "Are work friends different from real friends?"
      },
      "q2": {
        "band_5_peer_question": "Who was your very first friend?",
        "band_6_plus_peer_question": "Do the friends we make as kids teach us how to share?"
      },
      "q3": {
        "band_5_peer_question": "Does singing with classmates make you happy?",
        "band_6_plus_peer_question": "How does playing in a school band teach teamwork?"
      },
      "q4": {
        "band_5_peer_question": "Are there secrets you only tell your friends?",
        "band_6_plus_peer_question": "Why is it hard for teenagers to tell their parents everything?"
      },
      "q5": {
        "band_5_peer_question": "Is someone a real friend if you only talk online?",
        "band_6_plus_peer_question": "Do internet 'likes' make real friendships feel less special?"
      },
      "q6": {
        "band_5_peer_question": "How do you talk to friends who live far away?",
        "band_6_plus_peer_question": "Can a video call replace a real hug from a friend?"
      }
    }
  },
  {
    "week": 18,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What makes you feel tired after school or work?",
        "band_6_plus_peer_question": "Why does living in a busy city make it hard to relax?"
      },
      "q2": {
        "band_5_peer_question": "Is it better to sleep or watch a funny movie to rest?",
        "band_6_plus_peer_question": "If your mind is tired, does sleeping your body actually help?"
      },
      "q3": {
        "band_5_peer_question": "Do you want a new apartment or an old house?",
        "band_6_plus_peer_question": "Do people care more about smart tech than old building styles?"
      },
      "q4": {
        "band_5_peer_question": "Is it hard to study if your bed is next to your desk?",
        "band_6_plus_peer_question": "How should homes change if more people work from home?"
      },
      "q5": {
        "band_5_peer_question": "What happens when young people cannot buy a house?",
        "band_6_plus_peer_question": "Does expensive housing make people wait longer to get married?"
      },
      "q6": {
        "band_5_peer_question": "Should the government help poor people pay rent?",
        "band_6_plus_peer_question": "How can laws stop landlords from charging too much rent?"
      }
    }
  },
  {
    "week": 19,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does your family have an old thing they keep forever?",
        "band_6_plus_peer_question": "Why do old people feel so attached to physical objects?"
      },
      "q2": {
        "band_5_peer_question": "Why do teens always want the newest phone?",
        "band_6_plus_peer_question": "Do internet ads trick us into buying things we don't need?"
      },
      "q3": {
        "band_5_peer_question": "Would you rather have a new watch or a 100-year-old one?",
        "band_6_plus_peer_question": "Why do young people care more about new tech than old history?"
      },
      "q4": {
        "band_5_peer_question": "What is the coolest old thing you saw in a museum?",
        "band_6_plus_peer_question": "Does looking at ancient tools help us understand life today?"
      },
      "q5": {
        "band_5_peer_question": "What happens to plastic toys when kids grow up?",
        "band_6_plus_peer_question": "Will the earth be ruined if everyone keeps throwing things away?"
      },
      "q6": {
        "band_5_peer_question": "How do you feel when your phone breaks quickly?",
        "band_6_plus_peer_question": "Should governments punish companies that make phones break on purpose?"
      }
    }
  },
  {
    "week": 20,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Do your grandparents like taking long flights?",
        "band_6_plus_peer_question": "Do old people and young people like different kinds of travel?"
      },
      "q2": {
        "band_5_peer_question": "What are three things you always pack for a trip?",
        "band_6_plus_peer_question": "Why is it smart to plan a trip very carefully?"
      },
      "q3": {
        "band_5_peer_question": "Is it easier to travel where people speak your language?",
        "band_6_plus_peer_question": "Do things like visas and different money stop people from traveling?"
      },
      "q4": {
        "band_5_peer_question": "Does the air smell bad near a busy road?",
        "band_6_plus_peer_question": "Do big factories make more dirty air than cars do?"
      },
      "q5": {
        "band_5_peer_question": "Would you ride a bike to school to help the earth?",
        "band_6_plus_peer_question": "What can governments do to make people drive electric cars?"
      },
      "q6": {
        "band_5_peer_question": "Does traveling help you understand different people?",
        "band_6_plus_peer_question": "Do cheap airplane tickets help people learn about the world?"
      }
    }
  },
  {
    "week": 21,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "How can a teacher tell if a student is good at drawing?",
        "band_6_plus_peer_question": "What is the difference between a curious kid and a real genius?"
      },
      "q2": {
        "band_5_peer_question": "How would you feel if the smartest kid never studied?",
        "band_6_plus_peer_question": "Should very smart people be forced to use their brains to help society?"
      },
      "q3": {
        "band_5_peer_question": "Is practicing more important than being naturally smart?",
        "band_6_plus_peer_question": "Which is more important for success: good genes or a good school?"
      },
      "q4": {
        "band_5_peer_question": "Do very smart students sometimes struggle to make friends?",
        "band_6_plus_peer_question": "Why do super smart people sometimes feel lonely?"
      },
      "q5": {
        "band_5_peer_question": "Do school tests let you show your creative ideas?",
        "band_6_plus_peer_question": "Do strict school tests stop kids from thinking outside the box?"
      },
      "q6": {
        "band_5_peer_question": "Can anyone paint beautifully if they practice daily?",
        "band_6_plus_peer_question": "Can trying new hobbies actually change how your brain thinks?"
      }
    }
  },
  {
    "week": 22,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Would you want to work in a shop with your parents?",
        "band_6_plus_peer_question": "Is it bad for family relationships to work in the same business?"
      },
      "q2": {
        "band_5_peer_question": "What is the best part of working with your brother or sister?",
        "band_6_plus_peer_question": "Do family businesses fail because they lack professional managers?"
      },
      "q3": {
        "band_5_peer_question": "Do you want to be your own boss in the future?",
        "band_6_plus_peer_question": "Why do young graduates want to start their own companies?"
      },
      "q4": {
        "band_5_peer_question": "What happens to a small shop when a big supermarket opens?",
        "band_6_plus_peer_question": "Is it unfair when big companies lower prices to kill small shops?"
      },
      "q5": {
        "band_5_peer_question": "Do you prefer a street with tiny shops or one big mall?",
        "band_6_plus_peer_question": "Why is it better for a city to have many different small shops?"
      },
      "q6": {
        "band_5_peer_question": "Are there fewer clothing shops on your street now?",
        "band_6_plus_peer_question": "How can cities save street shops from losing to internet stores?"
      }
    }
  },
  {
    "week": 23,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Did you play with the same toys as girls or boys when you were small?",
        "band_6_plus_peer_question": "Do kids pick toys naturally, or do parents tell them what to like?"
      },
      "q2": {
        "band_5_peer_question": "Are your toys different from what your grandparents had?",
        "band_6_plus_peer_question": "Is it bad that kids today play with iPads instead of wooden blocks?"
      },
      "q3": {
        "band_5_peer_question": "Should parents buy a toy because it looks cool or teaches something?",
        "band_6_plus_peer_question": "How can a toy be fun to play with but also make a kid smarter?"
      },
      "q4": {
        "band_5_peer_question": "Will kids become greedy if they always pick their own toys?",
        "band_6_plus_peer_question": "Does letting kids buy their own toys teach them about money?"
      },
      "q5": {
        "band_5_peer_question": "Does playing with blocks help your math skills?",
        "band_6_plus_peer_question": "Can a smart toy replace the time a parent spends playing with a child?"
      },
      "q6": {
        "band_5_peer_question": "If a child has 100 toys, will they still have fun playing?",
        "band_6_plus_peer_question": "Does having too many toys make it hard for a kid to focus?"
      }
    }
  },
  {
    "week": 24,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Why do old mobile phones suddenly stop working?",
        "band_6_plus_peer_question": "Do phone companies make old phones slow down on purpose?"
      },
      "q2": {
        "band_5_peer_question": "Is it easier to buy a new TV or call a repairman?",
        "band_6_plus_peer_question": "Why is it so hard to find someone to fix broken electronics today?"
      },
      "q3": {
        "band_5_peer_question": "Are factory clothes better than hand-made ones?",
        "band_6_plus_peer_question": "What do we lose when machines make everything instead of humans?"
      },
      "q4": {
        "band_5_peer_question": "What do you do at home when the lights turn off?",
        "band_6_plus_peer_question": "Does a city with bad electricity have a weak economy?"
      },
      "q5": {
        "band_5_peer_question": "Could you survive for three days without electricity?",
        "band_6_plus_peer_question": "What would happen if a big city lost power for a whole month?"
      },
      "q6": {
        "band_5_peer_question": "What happens to broken computers thrown in the trash?",
        "band_6_plus_peer_question": "Should the law force companies to make phones that last ten years?"
      }
    }
  },
  {
    "week": 25,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What is the best way for a teacher to make you study?",
        "band_6_plus_peer_question": "Is a boss who works hard better than a boss who just yells?"
      },
      "q2": {
        "band_5_peer_question": "Should a parent say 'good job' even if a child loses a game?",
        "band_6_plus_peer_question": "Does cheering for a kid when they lose make them braver?"
      },
      "q3": {
        "band_5_peer_question": "Do you always ask friends before buying new shoes?",
        "band_6_plus_peer_question": "Why are people so scared to make their own choices?"
      },
      "q4": {
        "band_5_peer_question": "Should teenagers pick their own clothes, or should parents decide?",
        "band_6_plus_peer_question": "Does letting teenagers choose their friends help them grow up?"
      },
      "q5": {
        "band_5_peer_question": "Do you learn faster from praise or from being yelled at?",
        "band_6_plus_peer_question": "Why is giving advice nicely better than giving angry criticism?"
      },
      "q6": {
        "band_5_peer_question": "Is it good if your friends force you to skip homework?",
        "band_6_plus_peer_question": "What is the difference between a good mentor and bad peer pressure?"
      }
    }
  },
  {
    "week": 26,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "If a meal is expensive, is it always delicious?",
        "band_6_plus_peer_question": "Do expensive restaurants spend more on ads than on good service?"
      },
      "q2": {
        "band_5_peer_question": "Do you prefer returning a toy to a person or a website?",
        "band_6_plus_peer_question": "Why do people prefer human bank workers when dealing with big money?"
      },
      "q3": {
        "band_5_peer_question": "Have you ever bought a snack just for the cool box?",
        "band_6_plus_peer_question": "How do internet ads trick people into buying things they don't need?"
      },
      "q4": {
        "band_5_peer_question": "Do you write a list before going to the supermarket?",
        "band_6_plus_peer_question": "Is 'the customer is always right' just a trick to sell more?"
      },
      "q5": {
        "band_5_peer_question": "Would you visit a restaurant after seeing a video of a rude waiter?",
        "band_6_plus_peer_question": "How can one bad internet video ruin a huge company?"
      },
      "q6": {
        "band_5_peer_question": "Do you miss talking to the cashier at self-checkouts?",
        "band_6_plus_peer_question": "Is society becoming more lonely because machines replace human workers?"
      }
    }
  },
  {
    "week": 27,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "What did you learn from a TV nature show?",
        "band_6_plus_peer_question": "Can TV documentaries help people understand foreign cultures better?"
      },
      "q2": {
        "band_5_peer_question": "Is the evening TV news boring to watch?",
        "band_6_plus_peer_question": "Why do young people care more about funny videos than real news?"
      },
      "q3": {
        "band_5_peer_question": "Do you sometimes look at your phone for hours?",
        "band_6_plus_peer_question": "Do tech companies make apps addictive on purpose?"
      },
      "q4": {
        "band_5_peer_question": "Can fake internet stories make people feel scared?",
        "band_6_plus_peer_question": "How do fake news stories hurt elections and voting?"
      },
      "q5": {
        "band_5_peer_question": "Do you prefer streaming shows or waiting for TV?",
        "band_6_plus_peer_question": "How has internet streaming completely changed the TV business?"
      },
      "q6": {
        "band_5_peer_question": "Should the government block bad videos?",
        "band_6_plus_peer_question": "How can we stop bad videos without destroying free speech?"
      }
    }
  },
  {
    "week": 28,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does your family eat dinner together every night?",
        "band_6_plus_peer_question": "Does working too many hours stop families from talking at home?"
      },
      "q2": {
        "band_5_peer_question": "How is birthday food different from normal food?",
        "band_6_plus_peer_question": "Why are special holiday foods important for remembering our culture?"
      },
      "q3": {
        "band_5_peer_question": "Do you prefer a loud pop concert or a quiet show?",
        "band_6_plus_peer_question": "Why do young people love going to loud music festivals?"
      },
      "q4": {
        "band_5_peer_question": "Does learning to play a song make you proud?",
        "band_6_plus_peer_question": "Does learning to play the piano make a child better at math?"
      },
      "q5": {
        "band_5_peer_question": "Do you like big summer markets in your town?",
        "band_6_plus_peer_question": "How do public festivals help neighbors become better friends?"
      },
      "q6": {
        "band_5_peer_question": "Is it rude to look at your phone during dinner?",
        "band_6_plus_peer_question": "Have smartphones ruined our ability to talk face-to-face?"
      }
    }
  },
  {
    "week": 29,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Should you say sorry if you break a pen?",
        "band_6_plus_peer_question": "Does saying sorry quickly stop big arguments from happening?"
      },
      "q2": {
        "band_5_peer_question": "If someone lies three times, should you forgive them?",
        "band_6_plus_peer_question": "Is it foolish to keep forgiving someone who always lies?"
      },
      "q3": {
        "band_5_peer_question": "Is it okay to lie to protect your mother's feelings?",
        "band_6_plus_peer_question": "When is it acceptable to tell a white lie to a friend?"
      },
      "q4": {
        "band_5_peer_question": "Is it hard to be honest when you make a mistake?",
        "band_6_plus_peer_question": "Why is honesty the most important part of business trust?"
      },
      "q5": {
        "band_5_peer_question": "Do you trust shops that tell you the real price?",
        "band_6_plus_peer_question": "Do big companies often hide the truth to make more money?"
      },
      "q6": {
        "band_5_peer_question": "Does saying 'I forgive you' make class happier?",
        "band_6_plus_peer_question": "How does forgiving people help a neighborhood stay peaceful?"
      }
    }
  },
  {
    "week": 30,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does watching animal shows make you care about nature?",
        "band_6_plus_peer_question": "Does learning about nature in school make kids want to protect it?"
      },
      "q2": {
        "band_5_peer_question": "What did you learn seeing an elephant at the zoo?",
        "band_6_plus_peer_question": "Is it right to keep animals in cages just so we can look at them?"
      },
      "q3": {
        "band_5_peer_question": "Does having many people in a forest scare the birds?",
        "band_6_plus_peer_question": "Does the money from tourists fix the damage they do to forests?"
      },
      "q4": {
        "band_5_peer_question": "Is it fair to make bears ride bikes in a circus?",
        "band_6_plus_peer_question": "Why do people think using wild animals for entertainment is wrong?"
      },
      "q5": {
        "band_5_peer_question": "If all bees die, what happens to the flowers?",
        "band_6_plus_peer_question": "How does the death of one animal species hurt all the others?"
      },
      "q6": {
        "band_5_peer_question": "Should rich countries pay to stop bad hunters?",
        "band_6_plus_peer_question": "How can the world work together to stop illegal animal hunting?"
      }
    }
  },
  {
    "week": 31,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Do many classmates want to make computer games?",
        "band_6_plus_peer_question": "Why are technology jobs so popular with university students today?"
      },
      "q2": {
        "band_5_peer_question": "How does science help make the medicine we take?",
        "band_6_plus_peer_question": "Why is it dangerous if people do not understand basic science?"
      },
      "q3": {
        "band_5_peer_question": "Does reading a story make you think harder than cartoons?",
        "band_6_plus_peer_question": "Why does reading a book require more imagination than watching a movie?"
      },
      "q4": {
        "band_5_peer_question": "Why does a bridge builder need good ideas?",
        "band_6_plus_peer_question": "Do scientists need a lot of imagination to discover new things?"
      },
      "q5": {
        "band_5_peer_question": "Do too many exams stop students from having fun ideas?",
        "band_6_plus_peer_question": "Do strict school tests kill a student's ability to be creative?"
      },
      "q6": {
        "band_5_peer_question": "Can inventing a new machine cause environmental damage?",
        "band_6_plus_peer_question": "Why do we need strict laws to control new scientific inventions?"
      }
    }
  },
  {
    "week": 32,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Why jump from an airplane if it is scary?",
        "band_6_plus_peer_question": "How does facing your fears in sports make you a stronger person?"
      },
      "q2": {
        "band_5_peer_question": "Does reading a book before bed help you sleep?",
        "band_6_plus_peer_question": "How does yoga help people forget about their stressful office jobs?"
      },
      "q3": {
        "band_5_peer_question": "Does speaking English help you when traveling abroad?",
        "band_6_plus_peer_question": "How important is speaking a second language for getting a good job?"
      },
      "q4": {
        "band_5_peer_question": "Do kids learn new words faster than their parents?",
        "band_6_plus_peer_question": "Why are young children so much better at learning foreign languages?"
      },
      "q5": {
        "band_5_peer_question": "Can knowing local food help you learn the language?",
        "band_6_plus_peer_question": "Is it possible to really learn a language without understanding the culture?"
      },
      "q6": {
        "band_5_peer_question": "Will we still speak our native languages in 100 years?",
        "band_6_plus_peer_question": "Will English completely replace all other languages in the future?"
      }
    }
  },
  {
    "week": 33,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "If one student talks loudly, do others start doing it?",
        "band_6_plus_peer_question": "How easily can one bad student ruin a whole classroom's focus?"
      },
      "q2": {
        "band_5_peer_question": "Do adults eat healthier food than teenagers?",
        "band_6_plus_peer_question": "Do people only change their bad habits when they get sick?"
      },
      "q3": {
        "band_5_peer_question": "Is it hard to stop eating chocolate when you're sad?",
        "band_6_plus_peer_question": "Why do stress-relief habits so quickly turn into real addictions?"
      },
      "q4": {
        "band_5_peer_question": "Should you keep water in your fridge to stop drinking soda?",
        "band_6_plus_peer_question": "Is changing your environment the best way to break a bad habit?"
      },
      "q5": {
        "band_5_peer_question": "Does waking up at the same time help you finish homework?",
        "band_6_plus_peer_question": "How does having a strict daily routine save your brain energy?"
      },
      "q6": {
        "band_5_peer_question": "Can a lazy smart person be beaten by a hard worker?",
        "band_6_plus_peer_question": "Why does hard work always beat natural talent in the end?"
      }
    }
  },
  {
    "week": 34,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does your grandfather play phone games or just call?",
        "band_6_plus_peer_question": "How do old and young people use their smartphones differently?"
      },
      "q2": {
        "band_5_peer_question": "Why is looking at your phone while driving dangerous?",
        "band_6_plus_peer_question": "Should the police give huge fines to people who text while driving?"
      },
      "q3": {
        "band_5_peer_question": "Is it annoying when someone stops to take a selfie?",
        "band_6_plus_peer_question": "Do people miss out on real life because they take too many photos?"
      },
      "q4": {
        "band_5_peer_question": "Would a phone-free restaurant be nice for talking?",
        "band_6_plus_peer_question": "Should we have places where mobile phones are completely banned?"
      },
      "q5": {
        "band_5_peer_question": "Do you feel tired if you answer messages at night?",
        "band_6_plus_peer_question": "How does the pressure to always reply to messages cause stress?"
      },
      "q6": {
        "band_5_peer_question": "Do traffic lights stop us from driving fast or stop crashes?",
        "band_6_plus_peer_question": "Why are strict rules sometimes necessary to keep society safe?"
      }
    }
  },
  {
    "week": 35,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does writing down a homework list help you finish faster?",
        "band_6_plus_peer_question": "How does making a daily schedule help reduce stress and laziness?"
      },
      "q2": {
        "band_5_peer_question": "Is it okay if a student doesn't know their future job?",
        "band_6_plus_peer_question": "Why should young people keep their career plans flexible today?"
      },
      "q3": {
        "band_5_peer_question": "Why is rushing bad during an important math test?",
        "band_6_plus_peer_question": "Why is staying calm more important than working fast?"
      },
      "q4": {
        "band_5_peer_question": "How do you feel when the bus is twenty minutes late?",
        "band_6_plus_peer_question": "Why do unexpected delays make modern people so incredibly angry?"
      },
      "q5": {
        "band_5_peer_question": "Do you get angry if a website takes five seconds to open?",
        "band_6_plus_peer_question": "Has fast internet made us unable to wait for anything?"
      },
      "q6": {
        "band_5_peer_question": "Does working every hour make you rich or just tired?",
        "band_6_plus_peer_question": "How can we balance working hard for money with getting enough rest?"
      }
    }
  },
  {
    "week": 36,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does running in a race make you run faster than normal?",
        "band_6_plus_peer_question": "How does competing against others make us push our physical limits?"
      },
      "q2": {
        "band_5_peer_question": "Should kids focus on having fun or only care about winning?",
        "band_6_plus_peer_question": "Does focusing too much on winning ruin the fun of youth sports?"
      },
      "q3": {
        "band_5_peer_question": "Why is it important to pass the ball in soccer?",
        "band_6_plus_peer_question": "How does playing team sports teach people to trust each other?"
      },
      "q4": {
        "band_5_peer_question": "If workers fight for a prize, will they still help each other?",
        "band_6_plus_peer_question": "Can too much competition between office workers destroy a company?"
      },
      "q5": {
        "band_5_peer_question": "Do you like watching normal people sing on TV?",
        "band_6_plus_peer_question": "Why are reality TV competitions so popular all over the world?"
      },
      "q6": {
        "band_5_peer_question": "If a soccer team plays beautifully but loses, are fans happy?",
        "band_6_plus_peer_question": "In professional sports, does winning matter more than playing beautifully?"
      }
    }
  },
  {
    "week": 37,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Is a quiet neighbor better than a very talkative one?",
        "band_6_plus_peer_question": "Why is respecting personal privacy the key to being a good neighbor?"
      },
      "q2": {
        "band_5_peer_question": "Do you know the names of the people living next door?",
        "band_6_plus_peer_question": "Has living in modern cities destroyed traditional neighborhood friendships?"
      },
      "q3": {
        "band_5_peer_question": "Does living in a tall apartment make it harder to meet people?",
        "band_6_plus_peer_question": "How do high-rise buildings make city people feel more lonely?"
      },
      "q4": {
        "band_5_peer_question": "Do parks help neighbors become friends?",
        "band_6_plus_peer_question": "How important are public parks for building a friendly community?"
      },
      "q5": {
        "band_5_peer_question": "How can you help an older neighbor during a big storm?",
        "band_6_plus_peer_question": "Why are neighbors the most important people during an emergency?"
      },
      "q6": {
        "band_5_peer_question": "Is it fair if someone plays loud music when you need sleep?",
        "band_6_plus_peer_question": "Why must the government make strict laws against noisy neighbors?"
      }
    }
  },
  {
    "week": 38,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does breathing ocean air make you feel relaxed?",
        "band_6_plus_peer_question": "Why does living near the ocean improve a person's mental health?"
      },
      "q2": {
        "band_5_peer_question": "What happens if a factory dumps dirty water into the river?",
        "band_6_plus_peer_question": "How does severe water pollution threaten the health of whole cities?"
      },
      "q3": {
        "band_5_peer_question": "Should we stop crowds from ruining beautiful beaches?",
        "band_6_plus_peer_question": "Should the government limit tourists to protect beautiful natural areas?"
      },
      "q4": {
        "band_5_peer_question": "Is it cheaper to send heavy boxes on a ship or an airplane?",
        "band_6_plus_peer_question": "How important are giant cargo ships to global business?"
      },
      "q5": {
        "band_5_peer_question": "If two towns share a drying river, will they fight?",
        "band_6_plus_peer_question": "Will future wars be fought over clean drinking water?"
      },
      "q6": {
        "band_5_peer_question": "Can taking a shorter shower really help save the earth?",
        "band_6_plus_peer_question": "Can small daily changes in our homes actually save water globally?"
      }
    }
  },
  {
    "week": 39,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Does wearing the same clothes stop children from teasing?",
        "band_6_plus_peer_question": "Do school uniforms prevent poor students from being bullied?"
      },
      "q2": {
        "band_5_peer_question": "Do you think someone is rich if they wear an expensive jacket?",
        "band_6_plus_peer_question": "Why do people judge others so quickly based on their clothes?"
      },
      "q3": {
        "band_5_peer_question": "Do young people wear the same clothes their parents wore?",
        "band_6_plus_peer_question": "How has Western fashion changed what teenagers wear in your country?"
      },
      "q4": {
        "band_5_peer_question": "Is it silly to spend all your money to look like a singer?",
        "band_6_plus_peer_question": "Why is blindly following fast fashion trends a bad idea financially?"
      },
      "q5": {
        "band_5_peer_question": "Would you pay ten times more for a shirt just for a logo?",
        "band_6_plus_peer_question": "Are expensive designer clothes actually better quality, or just famous?"
      },
      "q6": {
        "band_5_peer_question": "What happens if millions throw cheap shirts in the garbage?",
        "band_6_plus_peer_question": "How does cheap, disposable fashion permanently damage the environment?"
      }
    }
  },
  {
    "week": 40,
    "lesson_2_part_3": {
      "q1": {
        "band_5_peer_question": "Do you like celebrating Christmas as much as the Spring Festival?",
        "band_6_plus_peer_question": "Do young people still care about traditional festivals today?"
      },
      "q2": {
        "band_5_peer_question": "Do stores care more about selling gifts or the real meaning of a holiday?",
        "band_6_plus_peer_question": "Have businesses ruined holidays by focusing too much on shopping?"
      },
      "q3": {
        "band_5_peer_question": "Does a long weekend prepare you to work harder on Monday?",
        "band_6_plus_peer_question": "How do public holidays prevent workers from becoming completely exhausted?"
      },
      "q4": {
        "band_5_peer_question": "If we stop making mooncakes, will we forget old stories?",
        "band_6_plus_peer_question": "How do traditional festival foods help preserve a country's history?"
      },
      "q5": {
        "band_5_peer_question": "Is going to a local party the best way to make friends abroad?",
        "band_6_plus_peer_question": "Should foreigners participate in the local festivals of their new country?"
      },
      "q6": {
        "band_5_peer_question": "Do kids care more about toys, while parents just want to rest?",
        "band_6_plus_peer_question": "How do children and adults enjoy holidays differently?"
      }
    }
  }
]
